-file("src/data/camp_fruit_data.erl", 1).

-module(camp_fruit_data).

-export([indexs/0,
         get_rand/1,
         ids/0,
         type_ids/1,
         get_land/1,
         get_reward/1]).

-file("inc/camp_fruit.hrl", 1).

-record(camp_fruit,
        {id = {0, "", 0},
         lev = 0,
         list = [],
         start_time = 0,
         end_time = 0,
         helped = 0}).

-record(camp_fruit_land,
        {id = 0,
         status = 0,
         base_id = 0,
         num = 0,
         need_num = 0,
         start_time = 0,
         end_time = 0,
         guilds = [],
         friends = [],
         log = []}).

-record(camp_fruit_land_log,
        {id = {0, "", 0},
         name = "",
         type = 0,
         base_id = 0,
         num = 0,
         mtime = 0}).

-record(camp_fruit_data,
        {id = 0,
         item_id = 0,
         type = 0,
         num = 0,
         cd = 0,
         reward = [],
         rand_reward = [],
         cast_msg = "",
         help_reward = [],
         help_exp_mode = 0,
         help_exp_radio = 0,
         help_rand_reward = [],
         help_cast_msg = "",
         exp_mode = 0,
         exp_radio = 0,
         plant_reward = [],
         plant_rand_reward = [],
         plant_cast_msg = "",
         plant_exp_mode = 0,
         plant_exp_radio = 0,
         friend_help_id = 0,
         guild_help_id = 0}).

-record(camp_fruit_reward_data,
        {min = 0,
         max = 0,
         reward = [],
         rand_reward = [],
         cast_msg = "",
         exp_mode = 0,
         exp_radio = 0}).

-file("src/data/camp_fruit_data.erl", 21).

-file("inc/common.hrl", 1).

-type p() :: bitstring().

-type z() :: non_neg_integer().

-type role_id() :: {pos_integer(), p(), z()}.

-type unit_id() :: {pos_integer(), pos_integer()}.

-type pos() :: {pos_integer(),
                non_neg_integer(),
                non_neg_integer()}.

-record(center,
        {ready = 0 :: 1 | 0,
         pid :: undefined | pid(),
         node :: undefined | atom(),
         center_platform = "" :: list(),
         center_zone_id = 0 :: non_neg_integer(),
         platform = <<>> :: bitstring(),
         zone_id = 0 :: non_neg_integer(),
         combine = [] :: [{bitstring(), non_neg_integer()}]}).

-record(notice_rec,
        {type = 11, digit_attr = [], str_attr = []}).

-file("src/data/camp_fruit_data.erl", 22).

indexs() -> [1, 2, 3, 4, 5, 6].

get_rand(1) -> [{2, 250}, {5, 250}, {6, 250}, {8, 250}];
get_rand(2) ->
    [{12, 250}, {15, 250}, {16, 250}, {18, 250}];
get_rand(3) -> [{23, 333}, {24, 333}, {27, 334}];
get_rand(4) ->
    [{32, 100}, {35, 100}, {36, 100}, {38, 100}];
get_rand(5) ->
    [{52, 50},
     {55, 50},
     {56, 50},
     {58, 50},
     {53, 250},
     {54, 250},
     {57, 300}];
get_rand(6) ->
    [{42, 100}, {45, 100}, {46, 100}, {48, 100}, {41, 600}];
get_rand(_) -> [].

ids() ->
    [1,
     2,
     3,
     4,
     5,
     6,
     7,
     8,
     11,
     12,
     13,
     14,
     15,
     16,
     17,
     18,
     21,
     22,
     23,
     24,
     25,
     26,
     27,
     28,
     31,
     32,
     33,
     34,
     35,
     36,
     37,
     38,
     41,
     42,
     43,
     44,
     45,
     46,
     47,
     48,
     51,
     52,
     53,
     54,
     55,
     56,
     57,
     58].

type_ids(2) ->
    [1,
     2,
     3,
     4,
     5,
     6,
     7,
     8,
     11,
     12,
     13,
     14,
     15,
     16,
     17,
     18,
     21,
     22,
     23,
     24,
     25,
     26,
     27,
     28,
     31,
     32,
     33,
     34,
     35,
     36,
     37,
     38,
     41,
     42,
     43,
     44,
     45,
     46,
     47,
     48,
     51,
     52,
     53,
     54,
     55,
     56,
     57,
     58];
type_ids(_) -> [].

get_land(1) ->
    #camp_fruit_data{id = 1, item_id = 70181, type = 2,
                     num = 1, cd = 7200, reward = [{70172, 0, 1}],
                     help_exp_mode = 3210, help_exp_radio = 4000,
                     help_rand_reward =
                         [{20052, 0, 1, 150, 0},
                          {20087, 0, 1, 5, 1},
                          {20006, 0, 4, 67, 0},
                          {20025, 0, 1, 9, 0},
                          {20039, 0, 1, 2, 1},
                          {20046, 0, 1, 1, 1},
                          {20075, 0, 1, 1, 1},
                          {20022, 0, 1, 3, 1},
                          {20095, 0, 1, 1, 1},
                          {20088, 0, 1, 10, 0},
                          {20020, 0, 2, 10, 0},
                          {20616, 0, 1, 1, 1},
                          {20091, 0, 1, 40, 0},
                          {90000, 0, 20000, 700, 0}],
                     help_cast_msg =
                         lang:get("#role#慷慨献出自己的种子为好友播种，然后慷慨地将掘出来的#item#装进口袋{fac"
                                  "e_1, 10}"),
                     plant_reward = [{20000, 0, 2}], plant_exp_mode = 3210,
                     plant_exp_radio = 5000,
                     plant_rand_reward =
                         [{20006, 0, 1, 200, 0},
                          {20000, 0, 1, 100, 0},
                          {20005, 0, 1, 100, 0},
                          {20013, 0, 1, 90, 0},
                          {20025, 0, 1, 120, 0},
                          {21220, 0, 1, 180, 0},
                          {20087, 0, 1, 80, 0},
                          {20095, 0, 1, 20, 0},
                          {20038, 0, 1, 10, 0},
                          {22306, 0, 1, 50, 0}],
                     plant_cast_msg =
                         lang:get("#role#顶着烈阳播种，嘿咻一锄头下去，竟刨出了一件#item#{face_1, "
                                  "31}"),
                     friend_help_id = 6, guild_help_id = 14};
get_land(2) ->
    #camp_fruit_data{id = 2, item_id = 70182, type = 2,
                     num = 3, cd = 600, reward = [{70173, 0, 1}],
                     help_exp_mode = 3210, help_exp_radio = 800,
                     help_rand_reward =
                         [{20052, 0, 1, 150, 0},
                          {20087, 0, 1, 5, 1},
                          {20006, 0, 4, 67, 0},
                          {20025, 0, 1, 9, 0},
                          {20039, 0, 1, 2, 1},
                          {20046, 0, 1, 1, 1},
                          {20075, 0, 1, 1, 1},
                          {20022, 0, 1, 3, 1},
                          {20095, 0, 1, 1, 1},
                          {20088, 0, 1, 10, 0},
                          {20020, 0, 2, 10, 0},
                          {20616, 0, 1, 1, 1},
                          {20091, 0, 1, 40, 0},
                          {90000, 0, 20000, 700, 0}],
                     help_cast_msg =
                         lang:get("#role#慷慨献出自己的种子为好友播种，然后慷慨地将掘出来的#item#装进口袋{fac"
                                  "e_1, 10}"),
                     plant_reward = [{20000, 0, 1}], plant_exp_mode = 3210,
                     plant_exp_radio = 1000,
                     plant_rand_reward =
                         [{20006, 0, 1, 200, 0},
                          {20000, 0, 1, 100, 0},
                          {20005, 0, 1, 100, 0},
                          {20013, 0, 1, 80, 0},
                          {20025, 0, 1, 120, 0},
                          {21220, 0, 1, 180, 0},
                          {20087, 0, 1, 20, 0},
                          {20004, 0, 1, 100, 0},
                          {20020, 0, 1, 50, 0},
                          {20021, 0, 1, 50, 0}],
                     plant_cast_msg =
                         lang:get("#role#顶着烈阳播种，嘿咻一锄头下去，竟刨出了一件#item#{face_1, "
                                  "31}"),
                     friend_help_id = 6, guild_help_id = 14};
get_land(3) ->
    #camp_fruit_data{id = 3, item_id = 70183, type = 2,
                     num = 2, cd = 1800, reward = [{70174, 0, 1}],
                     help_exp_mode = 3210, help_exp_radio = 1600,
                     help_rand_reward =
                         [{20052, 0, 1, 150, 0},
                          {20087, 0, 1, 5, 1},
                          {20006, 0, 4, 67, 0},
                          {20025, 0, 1, 9, 0},
                          {20039, 0, 1, 2, 1},
                          {20046, 0, 1, 1, 1},
                          {20075, 0, 1, 1, 1},
                          {20022, 0, 1, 3, 1},
                          {20095, 0, 1, 1, 1},
                          {20088, 0, 1, 10, 0},
                          {20020, 0, 2, 10, 0},
                          {20616, 0, 1, 1, 1},
                          {20091, 0, 1, 40, 0},
                          {90000, 0, 20000, 700, 0}],
                     help_cast_msg =
                         lang:get("#role#慷慨献出自己的种子为好友播种，然后慷慨地将掘出来的#item#装进口袋{fac"
                                  "e_1, 10}"),
                     plant_reward = [{20000, 0, 1}], plant_exp_mode = 3210,
                     plant_exp_radio = 2000,
                     plant_rand_reward =
                         [{20006, 0, 1, 200, 0},
                          {20000, 0, 1, 150, 0},
                          {20005, 0, 1, 100, 0},
                          {20013, 0, 1, 80, 0},
                          {20025, 0, 1, 120, 0},
                          {21220, 0, 1, 180, 0},
                          {20087, 0, 1, 60, 0},
                          {20095, 0, 1, 10, 0},
                          {20021, 0, 1, 50, 0},
                          {20091, 0, 1, 50, 0},
                          {21098, 0, 1, 50, 0}],
                     plant_cast_msg =
                         lang:get("#role#顶着烈阳播种，嘿咻一锄头下去，竟刨出了一件#item#{face_1, "
                                  "31}"),
                     friend_help_id = 6, guild_help_id = 14};
get_land(4) ->
    #camp_fruit_data{id = 4, item_id = 70184, type = 2,
                     num = 2, cd = 1800, reward = [{70175, 0, 1}],
                     help_exp_mode = 3210, help_exp_radio = 1600,
                     help_rand_reward =
                         [{20052, 0, 1, 150, 0},
                          {20087, 0, 1, 5, 1},
                          {20006, 0, 4, 67, 0},
                          {20025, 0, 1, 9, 0},
                          {20039, 0, 1, 2, 1},
                          {20046, 0, 1, 1, 1},
                          {20075, 0, 1, 1, 1},
                          {20022, 0, 1, 3, 1},
                          {20095, 0, 1, 1, 1},
                          {20088, 0, 1, 10, 0},
                          {20020, 0, 2, 10, 0},
                          {20616, 0, 1, 1, 1},
                          {20091, 0, 1, 40, 0},
                          {90000, 0, 20000, 700, 0}],
                     help_cast_msg =
                         lang:get("#role#慷慨献出自己的种子为好友播种，然后慷慨地将掘出来的#item#装进口袋{fac"
                                  "e_1, 10}"),
                     plant_reward = [{20000, 0, 1}], plant_exp_mode = 3210,
                     plant_exp_radio = 2000,
                     plant_rand_reward =
                         [{20006, 0, 1, 200, 0},
                          {20000, 0, 1, 150, 0},
                          {20005, 0, 1, 100, 0},
                          {20013, 0, 1, 80, 0},
                          {20025, 0, 1, 120, 0},
                          {21220, 0, 1, 180, 0},
                          {20087, 0, 1, 60, 0},
                          {20095, 0, 1, 10, 0},
                          {20021, 0, 1, 50, 0},
                          {20091, 0, 1, 50, 0},
                          {21098, 0, 1, 50, 0}],
                     plant_cast_msg =
                         lang:get("#role#顶着烈阳播种，嘿咻一锄头下去，竟刨出了一件#item#{face_1, "
                                  "31}"),
                     friend_help_id = 6, guild_help_id = 14};
get_land(5) ->
    #camp_fruit_data{id = 5, item_id = 70185, type = 2,
                     num = 3, cd = 600, reward = [{70176, 0, 1}],
                     help_exp_mode = 3210, help_exp_radio = 800,
                     help_rand_reward =
                         [{20052, 0, 1, 150, 0},
                          {20087, 0, 1, 5, 1},
                          {20006, 0, 4, 67, 0},
                          {20025, 0, 1, 9, 0},
                          {20039, 0, 1, 2, 1},
                          {20046, 0, 1, 1, 1},
                          {20075, 0, 1, 1, 1},
                          {20022, 0, 1, 3, 1},
                          {20095, 0, 1, 1, 1},
                          {20088, 0, 1, 10, 0},
                          {20020, 0, 2, 10, 0},
                          {20616, 0, 1, 1, 1},
                          {20091, 0, 1, 40, 0},
                          {90000, 0, 20000, 700, 0}],
                     help_cast_msg =
                         lang:get("#role#慷慨献出自己的种子为好友播种，然后慷慨地将掘出来的#item#装进口袋{fac"
                                  "e_1, 10}"),
                     plant_reward = [{20000, 0, 1}], plant_exp_mode = 3210,
                     plant_exp_radio = 1000,
                     plant_rand_reward =
                         [{20006, 0, 1, 200, 0},
                          {20000, 0, 1, 100, 0},
                          {20005, 0, 1, 100, 0},
                          {20013, 0, 1, 80, 0},
                          {20025, 0, 1, 120, 0},
                          {21220, 0, 1, 180, 0},
                          {20087, 0, 1, 20, 0},
                          {20004, 0, 1, 100, 0},
                          {20020, 0, 1, 50, 0},
                          {20021, 0, 1, 50, 0}],
                     plant_cast_msg =
                         lang:get("#role#顶着烈阳播种，嘿咻一锄头下去，竟刨出了一件#item#{face_1, "
                                  "31}"),
                     friend_help_id = 6, guild_help_id = 14};
get_land(6) ->
    #camp_fruit_data{id = 6, item_id = 70186, type = 2,
                     num = 3, cd = 600, reward = [{70177, 0, 1}],
                     help_exp_mode = 3210, help_exp_radio = 800,
                     help_rand_reward =
                         [{20052, 0, 1, 150, 0},
                          {20087, 0, 1, 5, 1},
                          {20006, 0, 4, 67, 0},
                          {20025, 0, 1, 9, 0},
                          {20039, 0, 1, 2, 1},
                          {20046, 0, 1, 1, 1},
                          {20075, 0, 1, 1, 1},
                          {20022, 0, 1, 3, 1},
                          {20095, 0, 1, 1, 1},
                          {20088, 0, 1, 10, 0},
                          {20020, 0, 2, 10, 0},
                          {20616, 0, 1, 1, 1},
                          {20091, 0, 1, 40, 0},
                          {90000, 0, 20000, 700, 0}],
                     help_cast_msg =
                         lang:get("#role#慷慨献出自己的种子为好友播种，然后慷慨地将掘出来的#item#装进口袋{fac"
                                  "e_1, 10}"),
                     plant_reward = [{20000, 0, 1}], plant_exp_mode = 3210,
                     plant_exp_radio = 1000,
                     plant_rand_reward =
                         [{20006, 0, 1, 200, 0},
                          {20000, 0, 1, 100, 0},
                          {20005, 0, 1, 100, 0},
                          {20013, 0, 1, 80, 0},
                          {20025, 0, 1, 120, 0},
                          {21220, 0, 1, 180, 0},
                          {20087, 0, 1, 20, 0},
                          {20004, 0, 1, 100, 0},
                          {20020, 0, 1, 50, 0},
                          {20021, 0, 1, 50, 0}],
                     plant_cast_msg =
                         lang:get("#role#顶着烈阳播种，嘿咻一锄头下去，竟刨出了一件#item#{face_1, "
                                  "31}"),
                     friend_help_id = 6, guild_help_id = 14};
get_land(7) ->
    #camp_fruit_data{id = 7, item_id = 70187, type = 2,
                     num = 2, cd = 1800, reward = [{70178, 0, 1}],
                     help_exp_mode = 3210, help_exp_radio = 1600,
                     help_rand_reward =
                         [{20052, 0, 1, 150, 0},
                          {20087, 0, 1, 5, 1},
                          {20006, 0, 4, 67, 0},
                          {20025, 0, 1, 9, 0},
                          {20039, 0, 1, 2, 1},
                          {20046, 0, 1, 1, 1},
                          {20075, 0, 1, 1, 1},
                          {20022, 0, 1, 3, 1},
                          {20095, 0, 1, 1, 1},
                          {20088, 0, 1, 10, 0},
                          {20020, 0, 2, 10, 0},
                          {20616, 0, 1, 1, 1},
                          {20091, 0, 1, 40, 0},
                          {90000, 0, 20000, 700, 0}],
                     help_cast_msg =
                         lang:get("#role#慷慨献出自己的种子为好友播种，然后慷慨地将掘出来的#item#装进口袋{fac"
                                  "e_1, 10}"),
                     plant_reward = [{20000, 0, 1}], plant_exp_mode = 3210,
                     plant_exp_radio = 2000,
                     plant_rand_reward =
                         [{20006, 0, 1, 200, 0},
                          {20000, 0, 1, 150, 0},
                          {20005, 0, 1, 100, 0},
                          {20013, 0, 1, 80, 0},
                          {20025, 0, 1, 120, 0},
                          {21220, 0, 1, 180, 0},
                          {20087, 0, 1, 60, 0},
                          {20095, 0, 1, 10, 0},
                          {20021, 0, 1, 50, 0},
                          {20091, 0, 1, 50, 0},
                          {21098, 0, 1, 50, 0}],
                     plant_cast_msg =
                         lang:get("#role#顶着烈阳播种，嘿咻一锄头下去，竟刨出了一件#item#{face_1, "
                                  "31}"),
                     friend_help_id = 6, guild_help_id = 14};
get_land(8) ->
    #camp_fruit_data{id = 8, item_id = 70188, type = 2,
                     num = 3, cd = 600, reward = [{70179, 0, 1}],
                     help_exp_mode = 3210, help_exp_radio = 800,
                     help_rand_reward =
                         [{20052, 0, 1, 150, 0},
                          {20087, 0, 1, 5, 1},
                          {20006, 0, 4, 67, 0},
                          {20025, 0, 1, 9, 0},
                          {20039, 0, 1, 2, 1},
                          {20046, 0, 1, 1, 1},
                          {20075, 0, 1, 1, 1},
                          {20022, 0, 1, 3, 1},
                          {20095, 0, 1, 1, 1},
                          {20088, 0, 1, 10, 0},
                          {20020, 0, 2, 10, 0},
                          {20616, 0, 1, 1, 1},
                          {20091, 0, 1, 40, 0},
                          {90000, 0, 20000, 700, 0}],
                     help_cast_msg =
                         lang:get("#role#慷慨献出自己的种子为好友播种，然后慷慨地将掘出来的#item#装进口袋{fac"
                                  "e_1, 10}"),
                     plant_reward = [{20000, 0, 1}], plant_exp_mode = 3210,
                     plant_exp_radio = 1000,
                     plant_rand_reward =
                         [{20006, 0, 1, 200, 0},
                          {20000, 0, 1, 100, 0},
                          {20005, 0, 1, 100, 0},
                          {20013, 0, 1, 80, 0},
                          {20025, 0, 1, 120, 0},
                          {21220, 0, 1, 180, 0},
                          {20087, 0, 1, 20, 0},
                          {20004, 0, 1, 100, 0},
                          {20020, 0, 1, 50, 0},
                          {20021, 0, 1, 50, 0}],
                     plant_cast_msg =
                         lang:get("#role#顶着烈阳播种，嘿咻一锄头下去，竟刨出了一件#item#{face_1, "
                                  "31}"),
                     friend_help_id = 6, guild_help_id = 14};
get_land(11) ->
    #camp_fruit_data{id = 11, item_id = 70181, type = 2,
                     num = 1, cd = 7200, reward = [{70172, 0, 1}],
                     help_exp_mode = 3210, help_exp_radio = 4000,
                     help_rand_reward =
                         [{20052, 0, 1, 150, 0},
                          {20087, 0, 1, 5, 1},
                          {20006, 0, 4, 67, 0},
                          {20025, 0, 1, 9, 0},
                          {20039, 0, 1, 2, 1},
                          {20046, 0, 1, 1, 1},
                          {20075, 0, 1, 1, 1},
                          {20022, 0, 1, 3, 1},
                          {20095, 0, 1, 1, 1},
                          {20088, 0, 1, 10, 0},
                          {20020, 0, 2, 10, 0},
                          {20616, 0, 1, 1, 1},
                          {20091, 0, 1, 40, 0},
                          {90000, 0, 20000, 700, 0}],
                     help_cast_msg =
                         lang:get("#role#慷慨献出自己的种子为好友播种，然后慷慨地将掘出来的#item#装进口袋{fac"
                                  "e_1, 10}"),
                     plant_reward = [{20000, 0, 2}], plant_exp_mode = 3210,
                     plant_exp_radio = 5000,
                     plant_rand_reward =
                         [{20006, 0, 1, 200, 0},
                          {20000, 0, 1, 100, 0},
                          {20005, 0, 1, 100, 0},
                          {20013, 0, 1, 90, 0},
                          {20025, 0, 1, 120, 0},
                          {21220, 0, 1, 180, 0},
                          {20087, 0, 1, 80, 0},
                          {20095, 0, 1, 20, 0},
                          {20038, 0, 1, 10, 0},
                          {22306, 0, 1, 50, 0}],
                     plant_cast_msg =
                         lang:get("#role#顶着烈阳播种，嘿咻一锄头下去，竟刨出了一件#item#{face_1, "
                                  "31}"),
                     friend_help_id = 7, guild_help_id = 15};
get_land(12) ->
    #camp_fruit_data{id = 12, item_id = 70182, type = 2,
                     num = 3, cd = 600, reward = [{70173, 0, 1}],
                     help_exp_mode = 3210, help_exp_radio = 800,
                     help_rand_reward =
                         [{20052, 0, 1, 150, 0},
                          {20087, 0, 1, 5, 1},
                          {20006, 0, 4, 67, 0},
                          {20025, 0, 1, 9, 0},
                          {20039, 0, 1, 2, 1},
                          {20046, 0, 1, 1, 1},
                          {20075, 0, 1, 1, 1},
                          {20022, 0, 1, 3, 1},
                          {20095, 0, 1, 1, 1},
                          {20088, 0, 1, 10, 0},
                          {20020, 0, 2, 10, 0},
                          {20616, 0, 1, 1, 1},
                          {20091, 0, 1, 40, 0},
                          {90000, 0, 20000, 700, 0}],
                     help_cast_msg =
                         lang:get("#role#慷慨献出自己的种子为好友播种，然后慷慨地将掘出来的#item#装进口袋{fac"
                                  "e_1, 10}"),
                     plant_reward = [{20000, 0, 1}], plant_exp_mode = 3210,
                     plant_exp_radio = 1000,
                     plant_rand_reward =
                         [{20006, 0, 1, 200, 0},
                          {20000, 0, 1, 100, 0},
                          {20005, 0, 1, 100, 0},
                          {20013, 0, 1, 80, 0},
                          {20025, 0, 1, 120, 0},
                          {21220, 0, 1, 180, 0},
                          {20087, 0, 1, 20, 0},
                          {20004, 0, 1, 100, 0},
                          {20020, 0, 1, 50, 0},
                          {20021, 0, 1, 50, 0}],
                     plant_cast_msg =
                         lang:get("#role#顶着烈阳播种，嘿咻一锄头下去，竟刨出了一件#item#{face_1, "
                                  "31}"),
                     friend_help_id = 7, guild_help_id = 15};
get_land(13) ->
    #camp_fruit_data{id = 13, item_id = 70183, type = 2,
                     num = 2, cd = 1800, reward = [{70174, 0, 1}],
                     help_exp_mode = 3210, help_exp_radio = 1600,
                     help_rand_reward =
                         [{20052, 0, 1, 150, 0},
                          {20087, 0, 1, 5, 1},
                          {20006, 0, 4, 67, 0},
                          {20025, 0, 1, 9, 0},
                          {20039, 0, 1, 2, 1},
                          {20046, 0, 1, 1, 1},
                          {20075, 0, 1, 1, 1},
                          {20022, 0, 1, 3, 1},
                          {20095, 0, 1, 1, 1},
                          {20088, 0, 1, 10, 0},
                          {20020, 0, 2, 10, 0},
                          {20616, 0, 1, 1, 1},
                          {20091, 0, 1, 40, 0},
                          {90000, 0, 20000, 700, 0}],
                     help_cast_msg =
                         lang:get("#role#慷慨献出自己的种子为好友播种，然后慷慨地将掘出来的#item#装进口袋{fac"
                                  "e_1, 10}"),
                     plant_reward = [{20000, 0, 1}], plant_exp_mode = 3210,
                     plant_exp_radio = 2000,
                     plant_rand_reward =
                         [{20006, 0, 1, 200, 0},
                          {20000, 0, 1, 150, 0},
                          {20005, 0, 1, 100, 0},
                          {20013, 0, 1, 80, 0},
                          {20025, 0, 1, 120, 0},
                          {21220, 0, 1, 180, 0},
                          {20087, 0, 1, 60, 0},
                          {20095, 0, 1, 10, 0},
                          {20021, 0, 1, 50, 0},
                          {20091, 0, 1, 50, 0},
                          {21098, 0, 1, 50, 0}],
                     plant_cast_msg =
                         lang:get("#role#顶着烈阳播种，嘿咻一锄头下去，竟刨出了一件#item#{face_1, "
                                  "31}"),
                     friend_help_id = 7, guild_help_id = 15};
get_land(14) ->
    #camp_fruit_data{id = 14, item_id = 70184, type = 2,
                     num = 2, cd = 1800, reward = [{70175, 0, 1}],
                     help_exp_mode = 3210, help_exp_radio = 1600,
                     help_rand_reward =
                         [{20052, 0, 1, 150, 0},
                          {20087, 0, 1, 5, 1},
                          {20006, 0, 4, 67, 0},
                          {20025, 0, 1, 9, 0},
                          {20039, 0, 1, 2, 1},
                          {20046, 0, 1, 1, 1},
                          {20075, 0, 1, 1, 1},
                          {20022, 0, 1, 3, 1},
                          {20095, 0, 1, 1, 1},
                          {20088, 0, 1, 10, 0},
                          {20020, 0, 2, 10, 0},
                          {20616, 0, 1, 1, 1},
                          {20091, 0, 1, 40, 0},
                          {90000, 0, 20000, 700, 0}],
                     help_cast_msg =
                         lang:get("#role#慷慨献出自己的种子为好友播种，然后慷慨地将掘出来的#item#装进口袋{fac"
                                  "e_1, 10}"),
                     plant_reward = [{20000, 0, 1}], plant_exp_mode = 3210,
                     plant_exp_radio = 2000,
                     plant_rand_reward =
                         [{20006, 0, 1, 200, 0},
                          {20000, 0, 1, 150, 0},
                          {20005, 0, 1, 100, 0},
                          {20013, 0, 1, 80, 0},
                          {20025, 0, 1, 120, 0},
                          {21220, 0, 1, 180, 0},
                          {20087, 0, 1, 60, 0},
                          {20095, 0, 1, 10, 0},
                          {20021, 0, 1, 50, 0},
                          {20091, 0, 1, 50, 0},
                          {21098, 0, 1, 50, 0}],
                     plant_cast_msg =
                         lang:get("#role#顶着烈阳播种，嘿咻一锄头下去，竟刨出了一件#item#{face_1, "
                                  "31}"),
                     friend_help_id = 7, guild_help_id = 15};
get_land(15) ->
    #camp_fruit_data{id = 15, item_id = 70185, type = 2,
                     num = 3, cd = 600, reward = [{70176, 0, 1}],
                     help_exp_mode = 3210, help_exp_radio = 800,
                     help_rand_reward =
                         [{20052, 0, 1, 150, 0},
                          {20087, 0, 1, 5, 1},
                          {20006, 0, 4, 67, 0},
                          {20025, 0, 1, 9, 0},
                          {20039, 0, 1, 2, 1},
                          {20046, 0, 1, 1, 1},
                          {20075, 0, 1, 1, 1},
                          {20022, 0, 1, 3, 1},
                          {20095, 0, 1, 1, 1},
                          {20088, 0, 1, 10, 0},
                          {20020, 0, 2, 10, 0},
                          {20616, 0, 1, 1, 1},
                          {20091, 0, 1, 40, 0},
                          {90000, 0, 20000, 700, 0}],
                     help_cast_msg =
                         lang:get("#role#慷慨献出自己的种子为好友播种，然后慷慨地将掘出来的#item#装进口袋{fac"
                                  "e_1, 10}"),
                     plant_reward = [{20000, 0, 1}], plant_exp_mode = 3210,
                     plant_exp_radio = 1000,
                     plant_rand_reward =
                         [{20006, 0, 1, 200, 0},
                          {20000, 0, 1, 100, 0},
                          {20005, 0, 1, 100, 0},
                          {20013, 0, 1, 80, 0},
                          {20025, 0, 1, 120, 0},
                          {21220, 0, 1, 180, 0},
                          {20087, 0, 1, 20, 0},
                          {20004, 0, 1, 100, 0},
                          {20020, 0, 1, 50, 0},
                          {20021, 0, 1, 50, 0}],
                     plant_cast_msg =
                         lang:get("#role#顶着烈阳播种，嘿咻一锄头下去，竟刨出了一件#item#{face_1, "
                                  "31}"),
                     friend_help_id = 7, guild_help_id = 15};
get_land(16) ->
    #camp_fruit_data{id = 16, item_id = 70186, type = 2,
                     num = 3, cd = 600, reward = [{70177, 0, 1}],
                     help_exp_mode = 3210, help_exp_radio = 800,
                     help_rand_reward =
                         [{20052, 0, 1, 150, 0},
                          {20087, 0, 1, 5, 1},
                          {20006, 0, 4, 67, 0},
                          {20025, 0, 1, 9, 0},
                          {20039, 0, 1, 2, 1},
                          {20046, 0, 1, 1, 1},
                          {20075, 0, 1, 1, 1},
                          {20022, 0, 1, 3, 1},
                          {20095, 0, 1, 1, 1},
                          {20088, 0, 1, 10, 0},
                          {20020, 0, 2, 10, 0},
                          {20616, 0, 1, 1, 1},
                          {20091, 0, 1, 40, 0},
                          {90000, 0, 20000, 700, 0}],
                     help_cast_msg =
                         lang:get("#role#慷慨献出自己的种子为好友播种，然后慷慨地将掘出来的#item#装进口袋{fac"
                                  "e_1, 10}"),
                     plant_reward = [{20000, 0, 1}], plant_exp_mode = 3210,
                     plant_exp_radio = 1000,
                     plant_rand_reward =
                         [{20006, 0, 1, 200, 0},
                          {20000, 0, 1, 100, 0},
                          {20005, 0, 1, 100, 0},
                          {20013, 0, 1, 80, 0},
                          {20025, 0, 1, 120, 0},
                          {21220, 0, 1, 180, 0},
                          {20087, 0, 1, 20, 0},
                          {20004, 0, 1, 100, 0},
                          {20020, 0, 1, 50, 0},
                          {20021, 0, 1, 50, 0}],
                     plant_cast_msg =
                         lang:get("#role#顶着烈阳播种，嘿咻一锄头下去，竟刨出了一件#item#{face_1, "
                                  "31}"),
                     friend_help_id = 7, guild_help_id = 15};
get_land(17) ->
    #camp_fruit_data{id = 17, item_id = 70187, type = 2,
                     num = 2, cd = 1800, reward = [{70178, 0, 1}],
                     help_exp_mode = 3210, help_exp_radio = 1600,
                     help_rand_reward =
                         [{20052, 0, 1, 150, 0},
                          {20087, 0, 1, 5, 1},
                          {20006, 0, 4, 67, 0},
                          {20025, 0, 1, 9, 0},
                          {20039, 0, 1, 2, 1},
                          {20046, 0, 1, 1, 1},
                          {20075, 0, 1, 1, 1},
                          {20022, 0, 1, 3, 1},
                          {20095, 0, 1, 1, 1},
                          {20088, 0, 1, 10, 0},
                          {20020, 0, 2, 10, 0},
                          {20616, 0, 1, 1, 1},
                          {20091, 0, 1, 40, 0},
                          {90000, 0, 20000, 700, 0}],
                     help_cast_msg =
                         lang:get("#role#慷慨献出自己的种子为好友播种，然后慷慨地将掘出来的#item#装进口袋{fac"
                                  "e_1, 10}"),
                     plant_reward = [{20000, 0, 1}], plant_exp_mode = 3210,
                     plant_exp_radio = 2000,
                     plant_rand_reward =
                         [{20006, 0, 1, 200, 0},
                          {20000, 0, 1, 150, 0},
                          {20005, 0, 1, 100, 0},
                          {20013, 0, 1, 80, 0},
                          {20025, 0, 1, 120, 0},
                          {21220, 0, 1, 180, 0},
                          {20087, 0, 1, 60, 0},
                          {20095, 0, 1, 10, 0},
                          {20021, 0, 1, 50, 0},
                          {20091, 0, 1, 50, 0},
                          {21098, 0, 1, 50, 0}],
                     plant_cast_msg =
                         lang:get("#role#顶着烈阳播种，嘿咻一锄头下去，竟刨出了一件#item#{face_1, "
                                  "31}"),
                     friend_help_id = 7, guild_help_id = 15};
get_land(18) ->
    #camp_fruit_data{id = 18, item_id = 70188, type = 2,
                     num = 3, cd = 600, reward = [{70179, 0, 1}],
                     help_exp_mode = 3210, help_exp_radio = 800,
                     help_rand_reward =
                         [{20052, 0, 1, 150, 0},
                          {20087, 0, 1, 5, 1},
                          {20006, 0, 4, 67, 0},
                          {20025, 0, 1, 9, 0},
                          {20039, 0, 1, 2, 1},
                          {20046, 0, 1, 1, 1},
                          {20075, 0, 1, 1, 1},
                          {20022, 0, 1, 3, 1},
                          {20095, 0, 1, 1, 1},
                          {20088, 0, 1, 10, 0},
                          {20020, 0, 2, 10, 0},
                          {20616, 0, 1, 1, 1},
                          {20091, 0, 1, 40, 0},
                          {90000, 0, 20000, 700, 0}],
                     help_cast_msg =
                         lang:get("#role#慷慨献出自己的种子为好友播种，然后慷慨地将掘出来的#item#装进口袋{fac"
                                  "e_1, 10}"),
                     plant_reward = [{20000, 0, 1}], plant_exp_mode = 3210,
                     plant_exp_radio = 1000,
                     plant_rand_reward =
                         [{20006, 0, 1, 200, 0},
                          {20000, 0, 1, 100, 0},
                          {20005, 0, 1, 100, 0},
                          {20013, 0, 1, 80, 0},
                          {20025, 0, 1, 120, 0},
                          {21220, 0, 1, 180, 0},
                          {20087, 0, 1, 20, 0},
                          {20004, 0, 1, 100, 0},
                          {20020, 0, 1, 50, 0},
                          {20021, 0, 1, 50, 0}],
                     plant_cast_msg =
                         lang:get("#role#顶着烈阳播种，嘿咻一锄头下去，竟刨出了一件#item#{face_1, "
                                  "31}"),
                     friend_help_id = 7, guild_help_id = 15};
get_land(21) ->
    #camp_fruit_data{id = 21, item_id = 70181, type = 2,
                     num = 1, cd = 7200, reward = [{70172, 0, 1}],
                     help_exp_mode = 3210, help_exp_radio = 4000,
                     help_rand_reward =
                         [{20052, 0, 1, 150, 0},
                          {20087, 0, 1, 5, 1},
                          {20006, 0, 4, 67, 0},
                          {20025, 0, 1, 9, 0},
                          {20039, 0, 1, 2, 1},
                          {20046, 0, 1, 1, 1},
                          {20075, 0, 1, 1, 1},
                          {20022, 0, 1, 3, 1},
                          {20095, 0, 1, 1, 1},
                          {20088, 0, 1, 10, 0},
                          {20020, 0, 2, 10, 0},
                          {20616, 0, 1, 1, 1},
                          {20091, 0, 1, 40, 0},
                          {90000, 0, 20000, 700, 0}],
                     help_cast_msg =
                         lang:get("#role#慷慨献出自己的种子为好友播种，然后慷慨地将掘出来的#item#装进口袋{fac"
                                  "e_1, 10}"),
                     plant_reward = [{20000, 0, 2}], plant_exp_mode = 3210,
                     plant_exp_radio = 5000,
                     plant_rand_reward =
                         [{20006, 0, 1, 200, 0},
                          {20000, 0, 1, 100, 0},
                          {20005, 0, 1, 100, 0},
                          {20013, 0, 1, 90, 0},
                          {20025, 0, 1, 120, 0},
                          {21220, 0, 1, 180, 0},
                          {20087, 0, 1, 80, 0},
                          {20095, 0, 1, 20, 0},
                          {20038, 0, 1, 10, 0},
                          {22306, 0, 1, 50, 0}],
                     plant_cast_msg =
                         lang:get("#role#顶着烈阳播种，嘿咻一锄头下去，竟刨出了一件#item#{face_1, "
                                  "31}"),
                     friend_help_id = 8, guild_help_id = 16};
get_land(22) ->
    #camp_fruit_data{id = 22, item_id = 70182, type = 2,
                     num = 3, cd = 600, reward = [{70173, 0, 1}],
                     help_exp_mode = 3210, help_exp_radio = 800,
                     help_rand_reward =
                         [{20052, 0, 1, 150, 0},
                          {20087, 0, 1, 5, 1},
                          {20006, 0, 4, 67, 0},
                          {20025, 0, 1, 9, 0},
                          {20039, 0, 1, 2, 1},
                          {20046, 0, 1, 1, 1},
                          {20075, 0, 1, 1, 1},
                          {20022, 0, 1, 3, 1},
                          {20095, 0, 1, 1, 1},
                          {20088, 0, 1, 10, 0},
                          {20020, 0, 2, 10, 0},
                          {20616, 0, 1, 1, 1},
                          {20091, 0, 1, 40, 0},
                          {90000, 0, 20000, 700, 0}],
                     help_cast_msg =
                         lang:get("#role#慷慨献出自己的种子为好友播种，然后慷慨地将掘出来的#item#装进口袋{fac"
                                  "e_1, 10}"),
                     plant_reward = [{20000, 0, 1}], plant_exp_mode = 3210,
                     plant_exp_radio = 1000,
                     plant_rand_reward =
                         [{20006, 0, 1, 200, 0},
                          {20000, 0, 1, 100, 0},
                          {20005, 0, 1, 100, 0},
                          {20013, 0, 1, 80, 0},
                          {20025, 0, 1, 120, 0},
                          {21220, 0, 1, 180, 0},
                          {20087, 0, 1, 20, 0},
                          {20004, 0, 1, 100, 0},
                          {20020, 0, 1, 50, 0},
                          {20021, 0, 1, 50, 0}],
                     plant_cast_msg =
                         lang:get("#role#顶着烈阳播种，嘿咻一锄头下去，竟刨出了一件#item#{face_1, "
                                  "31}"),
                     friend_help_id = 8, guild_help_id = 16};
get_land(23) ->
    #camp_fruit_data{id = 23, item_id = 70183, type = 2,
                     num = 2, cd = 1800, reward = [{70174, 0, 1}],
                     help_exp_mode = 3210, help_exp_radio = 1600,
                     help_rand_reward =
                         [{20052, 0, 1, 150, 0},
                          {20087, 0, 1, 5, 1},
                          {20006, 0, 4, 67, 0},
                          {20025, 0, 1, 9, 0},
                          {20039, 0, 1, 2, 1},
                          {20046, 0, 1, 1, 1},
                          {20075, 0, 1, 1, 1},
                          {20022, 0, 1, 3, 1},
                          {20095, 0, 1, 1, 1},
                          {20088, 0, 1, 10, 0},
                          {20020, 0, 2, 10, 0},
                          {20616, 0, 1, 1, 1},
                          {20091, 0, 1, 40, 0},
                          {90000, 0, 20000, 700, 0}],
                     help_cast_msg =
                         lang:get("#role#慷慨献出自己的种子为好友播种，然后慷慨地将掘出来的#item#装进口袋{fac"
                                  "e_1, 10}"),
                     plant_reward = [{20000, 0, 1}], plant_exp_mode = 3210,
                     plant_exp_radio = 2000,
                     plant_rand_reward =
                         [{20006, 0, 1, 200, 0},
                          {20000, 0, 1, 150, 0},
                          {20005, 0, 1, 100, 0},
                          {20013, 0, 1, 80, 0},
                          {20025, 0, 1, 120, 0},
                          {21220, 0, 1, 180, 0},
                          {20087, 0, 1, 60, 0},
                          {20095, 0, 1, 10, 0},
                          {20021, 0, 1, 50, 0},
                          {20091, 0, 1, 50, 0},
                          {21098, 0, 1, 50, 0}],
                     plant_cast_msg =
                         lang:get("#role#顶着烈阳播种，嘿咻一锄头下去，竟刨出了一件#item#{face_1, "
                                  "31}"),
                     friend_help_id = 8, guild_help_id = 16};
get_land(24) ->
    #camp_fruit_data{id = 24, item_id = 70184, type = 2,
                     num = 2, cd = 1800, reward = [{70175, 0, 1}],
                     help_exp_mode = 3210, help_exp_radio = 1600,
                     help_rand_reward =
                         [{20052, 0, 1, 150, 0},
                          {20087, 0, 1, 5, 1},
                          {20006, 0, 4, 67, 0},
                          {20025, 0, 1, 9, 0},
                          {20039, 0, 1, 2, 1},
                          {20046, 0, 1, 1, 1},
                          {20075, 0, 1, 1, 1},
                          {20022, 0, 1, 3, 1},
                          {20095, 0, 1, 1, 1},
                          {20088, 0, 1, 10, 0},
                          {20020, 0, 2, 10, 0},
                          {20616, 0, 1, 1, 1},
                          {20091, 0, 1, 40, 0},
                          {90000, 0, 20000, 700, 0}],
                     help_cast_msg =
                         lang:get("#role#慷慨献出自己的种子为好友播种，然后慷慨地将掘出来的#item#装进口袋{fac"
                                  "e_1, 10}"),
                     plant_reward = [{20000, 0, 1}], plant_exp_mode = 3210,
                     plant_exp_radio = 2000,
                     plant_rand_reward =
                         [{20006, 0, 1, 200, 0},
                          {20000, 0, 1, 150, 0},
                          {20005, 0, 1, 100, 0},
                          {20013, 0, 1, 80, 0},
                          {20025, 0, 1, 120, 0},
                          {21220, 0, 1, 180, 0},
                          {20087, 0, 1, 60, 0},
                          {20095, 0, 1, 10, 0},
                          {20021, 0, 1, 50, 0},
                          {20091, 0, 1, 50, 0},
                          {21098, 0, 1, 50, 0}],
                     plant_cast_msg =
                         lang:get("#role#顶着烈阳播种，嘿咻一锄头下去，竟刨出了一件#item#{face_1, "
                                  "31}"),
                     friend_help_id = 8, guild_help_id = 16};
get_land(25) ->
    #camp_fruit_data{id = 25, item_id = 70185, type = 2,
                     num = 3, cd = 600, reward = [{70176, 0, 1}],
                     help_exp_mode = 3210, help_exp_radio = 800,
                     help_rand_reward =
                         [{20052, 0, 1, 150, 0},
                          {20087, 0, 1, 5, 1},
                          {20006, 0, 4, 67, 0},
                          {20025, 0, 1, 9, 0},
                          {20039, 0, 1, 2, 1},
                          {20046, 0, 1, 1, 1},
                          {20075, 0, 1, 1, 1},
                          {20022, 0, 1, 3, 1},
                          {20095, 0, 1, 1, 1},
                          {20088, 0, 1, 10, 0},
                          {20020, 0, 2, 10, 0},
                          {20616, 0, 1, 1, 1},
                          {20091, 0, 1, 40, 0},
                          {90000, 0, 20000, 700, 0}],
                     help_cast_msg =
                         lang:get("#role#慷慨献出自己的种子为好友播种，然后慷慨地将掘出来的#item#装进口袋{fac"
                                  "e_1, 10}"),
                     plant_reward = [{20000, 0, 1}], plant_exp_mode = 3210,
                     plant_exp_radio = 1000,
                     plant_rand_reward =
                         [{20006, 0, 1, 200, 0},
                          {20000, 0, 1, 100, 0},
                          {20005, 0, 1, 100, 0},
                          {20013, 0, 1, 80, 0},
                          {20025, 0, 1, 120, 0},
                          {21220, 0, 1, 180, 0},
                          {20087, 0, 1, 20, 0},
                          {20004, 0, 1, 100, 0},
                          {20020, 0, 1, 50, 0},
                          {20021, 0, 1, 50, 0}],
                     plant_cast_msg =
                         lang:get("#role#顶着烈阳播种，嘿咻一锄头下去，竟刨出了一件#item#{face_1, "
                                  "31}"),
                     friend_help_id = 8, guild_help_id = 16};
get_land(26) ->
    #camp_fruit_data{id = 26, item_id = 70186, type = 2,
                     num = 3, cd = 600, reward = [{70177, 0, 1}],
                     help_exp_mode = 3210, help_exp_radio = 800,
                     help_rand_reward =
                         [{20052, 0, 1, 150, 0},
                          {20087, 0, 1, 5, 1},
                          {20006, 0, 4, 67, 0},
                          {20025, 0, 1, 9, 0},
                          {20039, 0, 1, 2, 1},
                          {20046, 0, 1, 1, 1},
                          {20075, 0, 1, 1, 1},
                          {20022, 0, 1, 3, 1},
                          {20095, 0, 1, 1, 1},
                          {20088, 0, 1, 10, 0},
                          {20020, 0, 2, 10, 0},
                          {20616, 0, 1, 1, 1},
                          {20091, 0, 1, 40, 0},
                          {90000, 0, 20000, 700, 0}],
                     help_cast_msg =
                         lang:get("#role#慷慨献出自己的种子为好友播种，然后慷慨地将掘出来的#item#装进口袋{fac"
                                  "e_1, 10}"),
                     plant_reward = [{20000, 0, 1}], plant_exp_mode = 3210,
                     plant_exp_radio = 1000,
                     plant_rand_reward =
                         [{20006, 0, 1, 200, 0},
                          {20000, 0, 1, 100, 0},
                          {20005, 0, 1, 100, 0},
                          {20013, 0, 1, 80, 0},
                          {20025, 0, 1, 120, 0},
                          {21220, 0, 1, 180, 0},
                          {20087, 0, 1, 20, 0},
                          {20004, 0, 1, 100, 0},
                          {20020, 0, 1, 50, 0},
                          {20021, 0, 1, 50, 0}],
                     plant_cast_msg =
                         lang:get("#role#顶着烈阳播种，嘿咻一锄头下去，竟刨出了一件#item#{face_1, "
                                  "31}"),
                     friend_help_id = 8, guild_help_id = 16};
get_land(27) ->
    #camp_fruit_data{id = 27, item_id = 70187, type = 2,
                     num = 2, cd = 1800, reward = [{70178, 0, 1}],
                     help_exp_mode = 3210, help_exp_radio = 1600,
                     help_rand_reward =
                         [{20052, 0, 1, 150, 0},
                          {20087, 0, 1, 5, 1},
                          {20006, 0, 4, 67, 0},
                          {20025, 0, 1, 9, 0},
                          {20039, 0, 1, 2, 1},
                          {20046, 0, 1, 1, 1},
                          {20075, 0, 1, 1, 1},
                          {20022, 0, 1, 3, 1},
                          {20095, 0, 1, 1, 1},
                          {20088, 0, 1, 10, 0},
                          {20020, 0, 2, 10, 0},
                          {20616, 0, 1, 1, 1},
                          {20091, 0, 1, 40, 0},
                          {90000, 0, 20000, 700, 0}],
                     help_cast_msg =
                         lang:get("#role#慷慨献出自己的种子为好友播种，然后慷慨地将掘出来的#item#装进口袋{fac"
                                  "e_1, 10}"),
                     plant_reward = [{20000, 0, 1}], plant_exp_mode = 3210,
                     plant_exp_radio = 2000,
                     plant_rand_reward =
                         [{20006, 0, 1, 200, 0},
                          {20000, 0, 1, 150, 0},
                          {20005, 0, 1, 100, 0},
                          {20013, 0, 1, 80, 0},
                          {20025, 0, 1, 120, 0},
                          {21220, 0, 1, 180, 0},
                          {20087, 0, 1, 60, 0},
                          {20095, 0, 1, 10, 0},
                          {20021, 0, 1, 50, 0},
                          {20091, 0, 1, 50, 0},
                          {21098, 0, 1, 50, 0}],
                     plant_cast_msg =
                         lang:get("#role#顶着烈阳播种，嘿咻一锄头下去，竟刨出了一件#item#{face_1, "
                                  "31}"),
                     friend_help_id = 8, guild_help_id = 16};
get_land(28) ->
    #camp_fruit_data{id = 28, item_id = 70188, type = 2,
                     num = 3, cd = 600, reward = [{70179, 0, 1}],
                     help_exp_mode = 3210, help_exp_radio = 800,
                     help_rand_reward =
                         [{20052, 0, 1, 150, 0},
                          {20087, 0, 1, 5, 1},
                          {20006, 0, 4, 67, 0},
                          {20025, 0, 1, 9, 0},
                          {20039, 0, 1, 2, 1},
                          {20046, 0, 1, 1, 1},
                          {20075, 0, 1, 1, 1},
                          {20022, 0, 1, 3, 1},
                          {20095, 0, 1, 1, 1},
                          {20088, 0, 1, 10, 0},
                          {20020, 0, 2, 10, 0},
                          {20616, 0, 1, 1, 1},
                          {20091, 0, 1, 40, 0},
                          {90000, 0, 20000, 700, 0}],
                     help_cast_msg =
                         lang:get("#role#慷慨献出自己的种子为好友播种，然后慷慨地将掘出来的#item#装进口袋{fac"
                                  "e_1, 10}"),
                     plant_reward = [{20000, 0, 1}], plant_exp_mode = 3210,
                     plant_exp_radio = 1000,
                     plant_rand_reward =
                         [{20006, 0, 1, 200, 0},
                          {20000, 0, 1, 100, 0},
                          {20005, 0, 1, 100, 0},
                          {20013, 0, 1, 80, 0},
                          {20025, 0, 1, 120, 0},
                          {21220, 0, 1, 180, 0},
                          {20087, 0, 1, 20, 0},
                          {20004, 0, 1, 100, 0},
                          {20020, 0, 1, 50, 0},
                          {20021, 0, 1, 50, 0}],
                     plant_cast_msg =
                         lang:get("#role#顶着烈阳播种，嘿咻一锄头下去，竟刨出了一件#item#{face_1, "
                                  "31}"),
                     friend_help_id = 8, guild_help_id = 16};
get_land(31) ->
    #camp_fruit_data{id = 31, item_id = 70181, type = 2,
                     num = 1, cd = 7200, reward = [{70172, 0, 1}],
                     help_exp_mode = 3210, help_exp_radio = 4000,
                     help_rand_reward =
                         [{20052, 0, 1, 150, 0},
                          {20087, 0, 1, 5, 1},
                          {20006, 0, 4, 67, 0},
                          {20025, 0, 1, 9, 0},
                          {20039, 0, 1, 2, 1},
                          {20046, 0, 1, 1, 1},
                          {20075, 0, 1, 1, 1},
                          {20022, 0, 1, 3, 1},
                          {20095, 0, 1, 1, 1},
                          {20088, 0, 1, 10, 0},
                          {20020, 0, 2, 10, 0},
                          {20616, 0, 1, 1, 1},
                          {20091, 0, 1, 40, 0},
                          {90000, 0, 20000, 700, 0}],
                     help_cast_msg =
                         lang:get("#role#慷慨献出自己的种子为好友播种，然后慷慨地将掘出来的#item#装进口袋{fac"
                                  "e_1, 10}"),
                     plant_reward = [{20000, 0, 2}], plant_exp_mode = 3210,
                     plant_exp_radio = 5000,
                     plant_rand_reward =
                         [{20006, 0, 1, 200, 0},
                          {20000, 0, 1, 100, 0},
                          {20005, 0, 1, 100, 0},
                          {20013, 0, 1, 90, 0},
                          {20025, 0, 1, 120, 0},
                          {21220, 0, 1, 180, 0},
                          {20087, 0, 1, 80, 0},
                          {20095, 0, 1, 20, 0},
                          {20038, 0, 1, 10, 0},
                          {22306, 0, 1, 50, 0}],
                     plant_cast_msg =
                         lang:get("#role#顶着烈阳播种，嘿咻一锄头下去，竟刨出了一件#item#{face_1, "
                                  "31}"),
                     friend_help_id = 9, guild_help_id = 17};
get_land(32) ->
    #camp_fruit_data{id = 32, item_id = 70182, type = 2,
                     num = 3, cd = 600, reward = [{70173, 0, 1}],
                     help_exp_mode = 3210, help_exp_radio = 800,
                     help_rand_reward =
                         [{20052, 0, 1, 150, 0},
                          {20087, 0, 1, 5, 1},
                          {20006, 0, 4, 67, 0},
                          {20025, 0, 1, 9, 0},
                          {20039, 0, 1, 2, 1},
                          {20046, 0, 1, 1, 1},
                          {20075, 0, 1, 1, 1},
                          {20022, 0, 1, 3, 1},
                          {20095, 0, 1, 1, 1},
                          {20088, 0, 1, 10, 0},
                          {20020, 0, 2, 10, 0},
                          {20616, 0, 1, 1, 1},
                          {20091, 0, 1, 40, 0},
                          {90000, 0, 20000, 700, 0}],
                     help_cast_msg =
                         lang:get("#role#慷慨献出自己的种子为好友播种，然后慷慨地将掘出来的#item#装进口袋{fac"
                                  "e_1, 10}"),
                     plant_reward = [{20000, 0, 1}], plant_exp_mode = 3210,
                     plant_exp_radio = 1000,
                     plant_rand_reward =
                         [{20006, 0, 1, 200, 0},
                          {20000, 0, 1, 100, 0},
                          {20005, 0, 1, 100, 0},
                          {20013, 0, 1, 80, 0},
                          {20025, 0, 1, 120, 0},
                          {21220, 0, 1, 180, 0},
                          {20087, 0, 1, 20, 0},
                          {20004, 0, 1, 100, 0},
                          {20020, 0, 1, 50, 0},
                          {20021, 0, 1, 50, 0}],
                     plant_cast_msg =
                         lang:get("#role#顶着烈阳播种，嘿咻一锄头下去，竟刨出了一件#item#{face_1, "
                                  "31}"),
                     friend_help_id = 9, guild_help_id = 17};
get_land(33) ->
    #camp_fruit_data{id = 33, item_id = 70183, type = 2,
                     num = 2, cd = 1800, reward = [{70174, 0, 1}],
                     help_exp_mode = 3210, help_exp_radio = 1600,
                     help_rand_reward =
                         [{20052, 0, 1, 150, 0},
                          {20087, 0, 1, 5, 1},
                          {20006, 0, 4, 67, 0},
                          {20025, 0, 1, 9, 0},
                          {20039, 0, 1, 2, 1},
                          {20046, 0, 1, 1, 1},
                          {20075, 0, 1, 1, 1},
                          {20022, 0, 1, 3, 1},
                          {20095, 0, 1, 1, 1},
                          {20088, 0, 1, 10, 0},
                          {20020, 0, 2, 10, 0},
                          {20616, 0, 1, 1, 1},
                          {20091, 0, 1, 40, 0},
                          {90000, 0, 20000, 700, 0}],
                     help_cast_msg =
                         lang:get("#role#慷慨献出自己的种子为好友播种，然后慷慨地将掘出来的#item#装进口袋{fac"
                                  "e_1, 10}"),
                     plant_reward = [{20000, 0, 1}], plant_exp_mode = 3210,
                     plant_exp_radio = 2000,
                     plant_rand_reward =
                         [{20006, 0, 1, 200, 0},
                          {20000, 0, 1, 150, 0},
                          {20005, 0, 1, 100, 0},
                          {20013, 0, 1, 80, 0},
                          {20025, 0, 1, 120, 0},
                          {21220, 0, 1, 180, 0},
                          {20087, 0, 1, 60, 0},
                          {20095, 0, 1, 10, 0},
                          {20021, 0, 1, 50, 0},
                          {20091, 0, 1, 50, 0},
                          {21098, 0, 1, 50, 0}],
                     plant_cast_msg =
                         lang:get("#role#顶着烈阳播种，嘿咻一锄头下去，竟刨出了一件#item#{face_1, "
                                  "31}"),
                     friend_help_id = 9, guild_help_id = 17};
get_land(34) ->
    #camp_fruit_data{id = 34, item_id = 70184, type = 2,
                     num = 2, cd = 1800, reward = [{70175, 0, 1}],
                     help_exp_mode = 3210, help_exp_radio = 1600,
                     help_rand_reward =
                         [{20052, 0, 1, 150, 0},
                          {20087, 0, 1, 5, 1},
                          {20006, 0, 4, 67, 0},
                          {20025, 0, 1, 9, 0},
                          {20039, 0, 1, 2, 1},
                          {20046, 0, 1, 1, 1},
                          {20075, 0, 1, 1, 1},
                          {20022, 0, 1, 3, 1},
                          {20095, 0, 1, 1, 1},
                          {20088, 0, 1, 10, 0},
                          {20020, 0, 2, 10, 0},
                          {20616, 0, 1, 1, 1},
                          {20091, 0, 1, 40, 0},
                          {90000, 0, 20000, 700, 0}],
                     help_cast_msg =
                         lang:get("#role#慷慨献出自己的种子为好友播种，然后慷慨地将掘出来的#item#装进口袋{fac"
                                  "e_1, 10}"),
                     plant_reward = [{20000, 0, 1}], plant_exp_mode = 3210,
                     plant_exp_radio = 2000,
                     plant_rand_reward =
                         [{20006, 0, 1, 200, 0},
                          {20000, 0, 1, 150, 0},
                          {20005, 0, 1, 100, 0},
                          {20013, 0, 1, 80, 0},
                          {20025, 0, 1, 120, 0},
                          {21220, 0, 1, 180, 0},
                          {20087, 0, 1, 60, 0},
                          {20095, 0, 1, 10, 0},
                          {20021, 0, 1, 50, 0},
                          {20091, 0, 1, 50, 0},
                          {21098, 0, 1, 50, 0}],
                     plant_cast_msg =
                         lang:get("#role#顶着烈阳播种，嘿咻一锄头下去，竟刨出了一件#item#{face_1, "
                                  "31}"),
                     friend_help_id = 9, guild_help_id = 17};
get_land(35) ->
    #camp_fruit_data{id = 35, item_id = 70185, type = 2,
                     num = 3, cd = 600, reward = [{70176, 0, 1}],
                     help_exp_mode = 3210, help_exp_radio = 800,
                     help_rand_reward =
                         [{20052, 0, 1, 150, 0},
                          {20087, 0, 1, 5, 1},
                          {20006, 0, 4, 67, 0},
                          {20025, 0, 1, 9, 0},
                          {20039, 0, 1, 2, 1},
                          {20046, 0, 1, 1, 1},
                          {20075, 0, 1, 1, 1},
                          {20022, 0, 1, 3, 1},
                          {20095, 0, 1, 1, 1},
                          {20088, 0, 1, 10, 0},
                          {20020, 0, 2, 10, 0},
                          {20616, 0, 1, 1, 1},
                          {20091, 0, 1, 40, 0},
                          {90000, 0, 20000, 700, 0}],
                     help_cast_msg =
                         lang:get("#role#慷慨献出自己的种子为好友播种，然后慷慨地将掘出来的#item#装进口袋{fac"
                                  "e_1, 10}"),
                     plant_reward = [{20000, 0, 1}], plant_exp_mode = 3210,
                     plant_exp_radio = 1000,
                     plant_rand_reward =
                         [{20006, 0, 1, 200, 0},
                          {20000, 0, 1, 100, 0},
                          {20005, 0, 1, 100, 0},
                          {20013, 0, 1, 80, 0},
                          {20025, 0, 1, 120, 0},
                          {21220, 0, 1, 180, 0},
                          {20087, 0, 1, 20, 0},
                          {20004, 0, 1, 100, 0},
                          {20020, 0, 1, 50, 0},
                          {20021, 0, 1, 50, 0}],
                     plant_cast_msg =
                         lang:get("#role#顶着烈阳播种，嘿咻一锄头下去，竟刨出了一件#item#{face_1, "
                                  "31}"),
                     friend_help_id = 9, guild_help_id = 17};
get_land(36) ->
    #camp_fruit_data{id = 36, item_id = 70186, type = 2,
                     num = 3, cd = 600, reward = [{70177, 0, 1}],
                     help_exp_mode = 3210, help_exp_radio = 800,
                     help_rand_reward =
                         [{20052, 0, 1, 150, 0},
                          {20087, 0, 1, 5, 1},
                          {20006, 0, 4, 67, 0},
                          {20025, 0, 1, 9, 0},
                          {20039, 0, 1, 2, 1},
                          {20046, 0, 1, 1, 1},
                          {20075, 0, 1, 1, 1},
                          {20022, 0, 1, 3, 1},
                          {20095, 0, 1, 1, 1},
                          {20088, 0, 1, 10, 0},
                          {20020, 0, 2, 10, 0},
                          {20616, 0, 1, 1, 1},
                          {20091, 0, 1, 40, 0},
                          {90000, 0, 20000, 700, 0}],
                     help_cast_msg =
                         lang:get("#role#慷慨献出自己的种子为好友播种，然后慷慨地将掘出来的#item#装进口袋{fac"
                                  "e_1, 10}"),
                     plant_reward = [{20000, 0, 1}], plant_exp_mode = 3210,
                     plant_exp_radio = 1000,
                     plant_rand_reward =
                         [{20006, 0, 1, 200, 0},
                          {20000, 0, 1, 100, 0},
                          {20005, 0, 1, 100, 0},
                          {20013, 0, 1, 80, 0},
                          {20025, 0, 1, 120, 0},
                          {21220, 0, 1, 180, 0},
                          {20087, 0, 1, 20, 0},
                          {20004, 0, 1, 100, 0},
                          {20020, 0, 1, 50, 0},
                          {20021, 0, 1, 50, 0}],
                     plant_cast_msg =
                         lang:get("#role#顶着烈阳播种，嘿咻一锄头下去，竟刨出了一件#item#{face_1, "
                                  "31}"),
                     friend_help_id = 9, guild_help_id = 17};
get_land(37) ->
    #camp_fruit_data{id = 37, item_id = 70187, type = 2,
                     num = 2, cd = 1800, reward = [{70178, 0, 1}],
                     help_exp_mode = 3210, help_exp_radio = 1600,
                     help_rand_reward =
                         [{20052, 0, 1, 150, 0},
                          {20087, 0, 1, 5, 1},
                          {20006, 0, 4, 67, 0},
                          {20025, 0, 1, 9, 0},
                          {20039, 0, 1, 2, 1},
                          {20046, 0, 1, 1, 1},
                          {20075, 0, 1, 1, 1},
                          {20022, 0, 1, 3, 1},
                          {20095, 0, 1, 1, 1},
                          {20088, 0, 1, 10, 0},
                          {20020, 0, 2, 10, 0},
                          {20616, 0, 1, 1, 1},
                          {20091, 0, 1, 40, 0},
                          {90000, 0, 20000, 700, 0}],
                     help_cast_msg =
                         lang:get("#role#慷慨献出自己的种子为好友播种，然后慷慨地将掘出来的#item#装进口袋{fac"
                                  "e_1, 10}"),
                     plant_reward = [{20000, 0, 1}], plant_exp_mode = 3210,
                     plant_exp_radio = 2000,
                     plant_rand_reward =
                         [{20006, 0, 1, 200, 0},
                          {20000, 0, 1, 150, 0},
                          {20005, 0, 1, 100, 0},
                          {20013, 0, 1, 80, 0},
                          {20025, 0, 1, 120, 0},
                          {21220, 0, 1, 180, 0},
                          {20087, 0, 1, 60, 0},
                          {20095, 0, 1, 10, 0},
                          {20021, 0, 1, 50, 0},
                          {20091, 0, 1, 50, 0},
                          {21098, 0, 1, 50, 0}],
                     plant_cast_msg =
                         lang:get("#role#顶着烈阳播种，嘿咻一锄头下去，竟刨出了一件#item#{face_1, "
                                  "31}"),
                     friend_help_id = 9, guild_help_id = 17};
get_land(38) ->
    #camp_fruit_data{id = 38, item_id = 70188, type = 2,
                     num = 3, cd = 600, reward = [{70179, 0, 1}],
                     help_exp_mode = 3210, help_exp_radio = 800,
                     help_rand_reward =
                         [{20052, 0, 1, 150, 0},
                          {20087, 0, 1, 5, 1},
                          {20006, 0, 4, 67, 0},
                          {20025, 0, 1, 9, 0},
                          {20039, 0, 1, 2, 1},
                          {20046, 0, 1, 1, 1},
                          {20075, 0, 1, 1, 1},
                          {20022, 0, 1, 3, 1},
                          {20095, 0, 1, 1, 1},
                          {20088, 0, 1, 10, 0},
                          {20020, 0, 2, 10, 0},
                          {20616, 0, 1, 1, 1},
                          {20091, 0, 1, 40, 0},
                          {90000, 0, 20000, 700, 0}],
                     help_cast_msg =
                         lang:get("#role#慷慨献出自己的种子为好友播种，然后慷慨地将掘出来的#item#装进口袋{fac"
                                  "e_1, 10}"),
                     plant_reward = [{20000, 0, 1}], plant_exp_mode = 3210,
                     plant_exp_radio = 1000,
                     plant_rand_reward =
                         [{20006, 0, 1, 200, 0},
                          {20000, 0, 1, 100, 0},
                          {20005, 0, 1, 100, 0},
                          {20013, 0, 1, 80, 0},
                          {20025, 0, 1, 120, 0},
                          {21220, 0, 1, 180, 0},
                          {20087, 0, 1, 20, 0},
                          {20004, 0, 1, 100, 0},
                          {20020, 0, 1, 50, 0},
                          {20021, 0, 1, 50, 0}],
                     plant_cast_msg =
                         lang:get("#role#顶着烈阳播种，嘿咻一锄头下去，竟刨出了一件#item#{face_1, "
                                  "31}"),
                     friend_help_id = 9, guild_help_id = 17};
get_land(41) ->
    #camp_fruit_data{id = 41, item_id = 70181, type = 2,
                     num = 1, cd = 7200, reward = [{70172, 0, 1}],
                     help_exp_mode = 3210, help_exp_radio = 4000,
                     help_rand_reward =
                         [{20052, 0, 1, 150, 0},
                          {20087, 0, 1, 5, 1},
                          {20006, 0, 4, 67, 0},
                          {20025, 0, 1, 9, 0},
                          {20039, 0, 1, 2, 1},
                          {20046, 0, 1, 1, 1},
                          {20075, 0, 1, 1, 1},
                          {20022, 0, 1, 3, 1},
                          {20095, 0, 1, 1, 1},
                          {20088, 0, 1, 10, 0},
                          {20020, 0, 2, 10, 0},
                          {20616, 0, 1, 1, 1},
                          {20091, 0, 1, 40, 0},
                          {90000, 0, 20000, 700, 0}],
                     help_cast_msg =
                         lang:get("#role#慷慨献出自己的种子为好友播种，然后慷慨地将掘出来的#item#装进口袋{fac"
                                  "e_1, 10}"),
                     plant_reward = [{20000, 0, 2}], plant_exp_mode = 3210,
                     plant_exp_radio = 5000,
                     plant_rand_reward =
                         [{20006, 0, 1, 200, 0},
                          {20000, 0, 1, 100, 0},
                          {20005, 0, 1, 100, 0},
                          {20013, 0, 1, 90, 0},
                          {20025, 0, 1, 120, 0},
                          {21220, 0, 1, 180, 0},
                          {20087, 0, 1, 80, 0},
                          {20095, 0, 1, 20, 0},
                          {20038, 0, 1, 10, 0},
                          {22306, 0, 1, 50, 0}],
                     plant_cast_msg =
                         lang:get("#role#顶着烈阳播种，嘿咻一锄头下去，竟刨出了一件#item#{face_1, "
                                  "31}"),
                     friend_help_id = 10, guild_help_id = 18};
get_land(42) ->
    #camp_fruit_data{id = 42, item_id = 70182, type = 2,
                     num = 3, cd = 600, reward = [{70173, 0, 1}],
                     help_exp_mode = 3210, help_exp_radio = 800,
                     help_rand_reward =
                         [{20052, 0, 1, 150, 0},
                          {20087, 0, 1, 5, 1},
                          {20006, 0, 4, 67, 0},
                          {20025, 0, 1, 9, 0},
                          {20039, 0, 1, 2, 1},
                          {20046, 0, 1, 1, 1},
                          {20075, 0, 1, 1, 1},
                          {20022, 0, 1, 3, 1},
                          {20095, 0, 1, 1, 1},
                          {20088, 0, 1, 10, 0},
                          {20020, 0, 2, 10, 0},
                          {20616, 0, 1, 1, 1},
                          {20091, 0, 1, 40, 0},
                          {90000, 0, 20000, 700, 0}],
                     help_cast_msg =
                         lang:get("#role#慷慨献出自己的种子为好友播种，然后慷慨地将掘出来的#item#装进口袋{fac"
                                  "e_1, 10}"),
                     plant_reward = [{20000, 0, 1}], plant_exp_mode = 3210,
                     plant_exp_radio = 1000,
                     plant_rand_reward =
                         [{20006, 0, 1, 200, 0},
                          {20000, 0, 1, 100, 0},
                          {20005, 0, 1, 100, 0},
                          {20013, 0, 1, 80, 0},
                          {20025, 0, 1, 120, 0},
                          {21220, 0, 1, 180, 0},
                          {20087, 0, 1, 20, 0},
                          {20004, 0, 1, 100, 0},
                          {20020, 0, 1, 50, 0},
                          {20021, 0, 1, 50, 0}],
                     plant_cast_msg =
                         lang:get("#role#顶着烈阳播种，嘿咻一锄头下去，竟刨出了一件#item#{face_1, "
                                  "31}"),
                     friend_help_id = 10, guild_help_id = 18};
get_land(43) ->
    #camp_fruit_data{id = 43, item_id = 70183, type = 2,
                     num = 2, cd = 1800, reward = [{70174, 0, 1}],
                     help_exp_mode = 3210, help_exp_radio = 1600,
                     help_rand_reward =
                         [{20052, 0, 1, 150, 0},
                          {20087, 0, 1, 5, 1},
                          {20006, 0, 4, 67, 0},
                          {20025, 0, 1, 9, 0},
                          {20039, 0, 1, 2, 1},
                          {20046, 0, 1, 1, 1},
                          {20075, 0, 1, 1, 1},
                          {20022, 0, 1, 3, 1},
                          {20095, 0, 1, 1, 1},
                          {20088, 0, 1, 10, 0},
                          {20020, 0, 2, 10, 0},
                          {20616, 0, 1, 1, 1},
                          {20091, 0, 1, 40, 0},
                          {90000, 0, 20000, 700, 0}],
                     help_cast_msg =
                         lang:get("#role#慷慨献出自己的种子为好友播种，然后慷慨地将掘出来的#item#装进口袋{fac"
                                  "e_1, 10}"),
                     plant_reward = [{20000, 0, 1}], plant_exp_mode = 3210,
                     plant_exp_radio = 2000,
                     plant_rand_reward =
                         [{20006, 0, 1, 200, 0},
                          {20000, 0, 1, 150, 0},
                          {20005, 0, 1, 100, 0},
                          {20013, 0, 1, 80, 0},
                          {20025, 0, 1, 120, 0},
                          {21220, 0, 1, 180, 0},
                          {20087, 0, 1, 60, 0},
                          {20095, 0, 1, 10, 0},
                          {20021, 0, 1, 50, 0},
                          {20091, 0, 1, 50, 0},
                          {21098, 0, 1, 50, 0}],
                     plant_cast_msg =
                         lang:get("#role#顶着烈阳播种，嘿咻一锄头下去，竟刨出了一件#item#{face_1, "
                                  "31}"),
                     friend_help_id = 10, guild_help_id = 18};
get_land(44) ->
    #camp_fruit_data{id = 44, item_id = 70184, type = 2,
                     num = 2, cd = 1800, reward = [{70175, 0, 1}],
                     help_exp_mode = 3210, help_exp_radio = 1600,
                     help_rand_reward =
                         [{20052, 0, 1, 150, 0},
                          {20087, 0, 1, 5, 1},
                          {20006, 0, 4, 67, 0},
                          {20025, 0, 1, 9, 0},
                          {20039, 0, 1, 2, 1},
                          {20046, 0, 1, 1, 1},
                          {20075, 0, 1, 1, 1},
                          {20022, 0, 1, 3, 1},
                          {20095, 0, 1, 1, 1},
                          {20088, 0, 1, 10, 0},
                          {20020, 0, 2, 10, 0},
                          {20616, 0, 1, 1, 1},
                          {20091, 0, 1, 40, 0},
                          {90000, 0, 20000, 700, 0}],
                     help_cast_msg =
                         lang:get("#role#慷慨献出自己的种子为好友播种，然后慷慨地将掘出来的#item#装进口袋{fac"
                                  "e_1, 10}"),
                     plant_reward = [{20000, 0, 1}], plant_exp_mode = 3210,
                     plant_exp_radio = 2000,
                     plant_rand_reward =
                         [{20006, 0, 1, 200, 0},
                          {20000, 0, 1, 150, 0},
                          {20005, 0, 1, 100, 0},
                          {20013, 0, 1, 80, 0},
                          {20025, 0, 1, 120, 0},
                          {21220, 0, 1, 180, 0},
                          {20087, 0, 1, 60, 0},
                          {20095, 0, 1, 10, 0},
                          {20021, 0, 1, 50, 0},
                          {20091, 0, 1, 50, 0},
                          {21098, 0, 1, 50, 0}],
                     plant_cast_msg =
                         lang:get("#role#顶着烈阳播种，嘿咻一锄头下去，竟刨出了一件#item#{face_1, "
                                  "31}"),
                     friend_help_id = 10, guild_help_id = 18};
get_land(45) ->
    #camp_fruit_data{id = 45, item_id = 70185, type = 2,
                     num = 3, cd = 600, reward = [{70176, 0, 1}],
                     help_exp_mode = 3210, help_exp_radio = 750,
                     help_rand_reward =
                         [{20052, 0, 1, 150, 0},
                          {20087, 0, 1, 5, 1},
                          {20006, 0, 4, 67, 0},
                          {20025, 0, 1, 9, 0},
                          {20039, 0, 1, 2, 1},
                          {20046, 0, 1, 1, 1},
                          {20075, 0, 1, 1, 1},
                          {20022, 0, 1, 3, 1},
                          {20095, 0, 1, 1, 1},
                          {20088, 0, 1, 10, 0},
                          {20020, 0, 2, 10, 0},
                          {20616, 0, 1, 1, 1},
                          {20091, 0, 1, 40, 0},
                          {90000, 0, 20000, 700, 0}],
                     help_cast_msg =
                         lang:get("#role#慷慨献出自己的种子为好友播种，然后慷慨地将掘出来的#item#装进口袋{fac"
                                  "e_1, 10}"),
                     plant_reward = [{20000, 0, 1}], plant_exp_mode = 3210,
                     plant_exp_radio = 1000,
                     plant_rand_reward =
                         [{20006, 0, 1, 200, 0},
                          {20000, 0, 1, 100, 0},
                          {20005, 0, 1, 100, 0},
                          {20013, 0, 1, 80, 0},
                          {20025, 0, 1, 120, 0},
                          {21220, 0, 1, 180, 0},
                          {20087, 0, 1, 20, 0},
                          {20004, 0, 1, 100, 0},
                          {20020, 0, 1, 50, 0},
                          {20021, 0, 1, 50, 0}],
                     plant_cast_msg =
                         lang:get("#role#顶着烈阳播种，嘿咻一锄头下去，竟刨出了一件#item#{face_1, "
                                  "31}"),
                     friend_help_id = 10, guild_help_id = 18};
get_land(46) ->
    #camp_fruit_data{id = 46, item_id = 70186, type = 2,
                     num = 3, cd = 600, reward = [{70177, 0, 1}],
                     help_exp_mode = 3210, help_exp_radio = 800,
                     help_rand_reward =
                         [{20052, 0, 1, 150, 0},
                          {20087, 0, 1, 5, 1},
                          {20006, 0, 4, 67, 0},
                          {20025, 0, 1, 9, 0},
                          {20039, 0, 1, 2, 1},
                          {20046, 0, 1, 1, 1},
                          {20075, 0, 1, 1, 1},
                          {20022, 0, 1, 3, 1},
                          {20095, 0, 1, 1, 1},
                          {20088, 0, 1, 10, 0},
                          {20020, 0, 2, 10, 0},
                          {20616, 0, 1, 1, 1},
                          {20091, 0, 1, 40, 0},
                          {90000, 0, 20000, 700, 0}],
                     help_cast_msg =
                         lang:get("#role#慷慨献出自己的种子为好友播种，然后慷慨地将掘出来的#item#装进口袋{fac"
                                  "e_1, 10}"),
                     plant_reward = [{20000, 0, 1}], plant_exp_mode = 3210,
                     plant_exp_radio = 1000,
                     plant_rand_reward =
                         [{20006, 0, 1, 200, 0},
                          {20000, 0, 1, 100, 0},
                          {20005, 0, 1, 100, 0},
                          {20013, 0, 1, 80, 0},
                          {20025, 0, 1, 120, 0},
                          {21220, 0, 1, 180, 0},
                          {20087, 0, 1, 20, 0},
                          {20004, 0, 1, 100, 0},
                          {20020, 0, 1, 50, 0},
                          {20021, 0, 1, 50, 0}],
                     plant_cast_msg =
                         lang:get("#role#顶着烈阳播种，嘿咻一锄头下去，竟刨出了一件#item#{face_1, "
                                  "31}"),
                     friend_help_id = 10, guild_help_id = 18};
get_land(47) ->
    #camp_fruit_data{id = 47, item_id = 70187, type = 2,
                     num = 2, cd = 1800, reward = [{70178, 0, 1}],
                     help_exp_mode = 3210, help_exp_radio = 1600,
                     help_rand_reward =
                         [{20052, 0, 1, 150, 0},
                          {20087, 0, 1, 5, 1},
                          {20006, 0, 4, 67, 0},
                          {20025, 0, 1, 9, 0},
                          {20039, 0, 1, 2, 1},
                          {20046, 0, 1, 1, 1},
                          {20075, 0, 1, 1, 1},
                          {20022, 0, 1, 3, 1},
                          {20095, 0, 1, 1, 1},
                          {20088, 0, 1, 10, 0},
                          {20020, 0, 2, 10, 0},
                          {20616, 0, 1, 1, 1},
                          {20091, 0, 1, 40, 0},
                          {90000, 0, 20000, 700, 0}],
                     help_cast_msg =
                         lang:get("#role#慷慨献出自己的种子为好友播种，然后慷慨地将掘出来的#item#装进口袋{fac"
                                  "e_1, 10}"),
                     plant_reward = [{20000, 0, 1}], plant_exp_mode = 3210,
                     plant_exp_radio = 2000,
                     plant_rand_reward =
                         [{20006, 0, 1, 200, 0},
                          {20000, 0, 1, 150, 0},
                          {20005, 0, 1, 100, 0},
                          {20013, 0, 1, 80, 0},
                          {20025, 0, 1, 120, 0},
                          {21220, 0, 1, 180, 0},
                          {20087, 0, 1, 60, 0},
                          {20095, 0, 1, 10, 0},
                          {20021, 0, 1, 50, 0},
                          {20091, 0, 1, 50, 0},
                          {21098, 0, 1, 50, 0}],
                     plant_cast_msg =
                         lang:get("#role#顶着烈阳播种，嘿咻一锄头下去，竟刨出了一件#item#{face_1, "
                                  "31}"),
                     friend_help_id = 10, guild_help_id = 18};
get_land(48) ->
    #camp_fruit_data{id = 48, item_id = 70188, type = 2,
                     num = 3, cd = 600, reward = [{70179, 0, 1}],
                     help_exp_mode = 3210, help_exp_radio = 800,
                     help_rand_reward =
                         [{20052, 0, 1, 150, 0},
                          {20087, 0, 1, 5, 1},
                          {20006, 0, 4, 67, 0},
                          {20025, 0, 1, 9, 0},
                          {20039, 0, 1, 2, 1},
                          {20046, 0, 1, 1, 1},
                          {20075, 0, 1, 1, 1},
                          {20022, 0, 1, 3, 1},
                          {20095, 0, 1, 1, 1},
                          {20088, 0, 1, 10, 0},
                          {20020, 0, 2, 10, 0},
                          {20616, 0, 1, 1, 1},
                          {20091, 0, 1, 40, 0},
                          {90000, 0, 20000, 700, 0}],
                     help_cast_msg =
                         lang:get("#role#慷慨献出自己的种子为好友播种，然后慷慨地将掘出来的#item#装进口袋{fac"
                                  "e_1, 10}"),
                     plant_reward = [{20000, 0, 1}], plant_exp_mode = 3210,
                     plant_exp_radio = 1000,
                     plant_rand_reward =
                         [{20006, 0, 1, 200, 0},
                          {20000, 0, 1, 100, 0},
                          {20005, 0, 1, 100, 0},
                          {20013, 0, 1, 80, 0},
                          {20025, 0, 1, 120, 0},
                          {21220, 0, 1, 180, 0},
                          {20087, 0, 1, 20, 0},
                          {20004, 0, 1, 100, 0},
                          {20020, 0, 1, 50, 0},
                          {20021, 0, 1, 50, 0}],
                     plant_cast_msg =
                         lang:get("#role#顶着烈阳播种，嘿咻一锄头下去，竟刨出了一件#item#{face_1, "
                                  "31}"),
                     friend_help_id = 10, guild_help_id = 18};
get_land(51) ->
    #camp_fruit_data{id = 51, item_id = 70181, type = 2,
                     num = 1, cd = 7200, reward = [{70172, 0, 1}],
                     help_exp_mode = 3210, help_exp_radio = 4000,
                     help_rand_reward =
                         [{20052, 0, 1, 150, 0},
                          {20087, 0, 1, 5, 1},
                          {20006, 0, 4, 67, 0},
                          {20025, 0, 1, 9, 0},
                          {20039, 0, 1, 2, 1},
                          {20046, 0, 1, 1, 1},
                          {20075, 0, 1, 1, 1},
                          {20022, 0, 1, 3, 1},
                          {20095, 0, 1, 1, 1},
                          {20088, 0, 1, 10, 0},
                          {20020, 0, 2, 10, 0},
                          {20616, 0, 1, 1, 1},
                          {20091, 0, 1, 40, 0},
                          {90000, 0, 20000, 700, 0}],
                     help_cast_msg =
                         lang:get("#role#慷慨献出自己的种子为好友播种，然后慷慨地将掘出来的#item#装进口袋{fac"
                                  "e_1, 10}"),
                     plant_reward = [{20000, 0, 2}], plant_exp_mode = 3210,
                     plant_exp_radio = 5000,
                     plant_rand_reward =
                         [{20006, 0, 1, 200, 0},
                          {20000, 0, 1, 100, 0},
                          {20005, 0, 1, 100, 0},
                          {20013, 0, 1, 90, 0},
                          {20025, 0, 1, 120, 0},
                          {21220, 0, 1, 180, 0},
                          {20087, 0, 1, 80, 0},
                          {20095, 0, 1, 20, 0},
                          {20038, 0, 1, 10, 0},
                          {22306, 0, 1, 50, 0}],
                     plant_cast_msg =
                         lang:get("#role#顶着烈阳播种，嘿咻一锄头下去，竟刨出了一件#item#{face_1, "
                                  "31}"),
                     friend_help_id = 11, guild_help_id = 19};
get_land(52) ->
    #camp_fruit_data{id = 52, item_id = 70182, type = 2,
                     num = 3, cd = 600, reward = [{70173, 0, 1}],
                     help_exp_mode = 3210, help_exp_radio = 800,
                     help_rand_reward =
                         [{20052, 0, 1, 150, 0},
                          {20087, 0, 1, 5, 1},
                          {20006, 0, 4, 67, 0},
                          {20025, 0, 1, 9, 0},
                          {20039, 0, 1, 2, 1},
                          {20046, 0, 1, 1, 1},
                          {20075, 0, 1, 1, 1},
                          {20022, 0, 1, 3, 1},
                          {20095, 0, 1, 1, 1},
                          {20088, 0, 1, 10, 0},
                          {20020, 0, 2, 10, 0},
                          {20616, 0, 1, 1, 1},
                          {20091, 0, 1, 40, 0},
                          {90000, 0, 20000, 700, 0}],
                     help_cast_msg =
                         lang:get("#role#慷慨献出自己的种子为好友播种，然后慷慨地将掘出来的#item#装进口袋{fac"
                                  "e_1, 10}"),
                     plant_reward = [{20000, 0, 1}], plant_exp_mode = 3210,
                     plant_exp_radio = 1000,
                     plant_rand_reward =
                         [{20006, 0, 1, 200, 0},
                          {20000, 0, 1, 100, 0},
                          {20005, 0, 1, 100, 0},
                          {20013, 0, 1, 80, 0},
                          {20025, 0, 1, 120, 0},
                          {21220, 0, 1, 180, 0},
                          {20087, 0, 1, 20, 0},
                          {20004, 0, 1, 100, 0},
                          {20020, 0, 1, 50, 0},
                          {20021, 0, 1, 50, 0}],
                     plant_cast_msg =
                         lang:get("#role#顶着烈阳播种，嘿咻一锄头下去，竟刨出了一件#item#{face_1, "
                                  "31}"),
                     friend_help_id = 11, guild_help_id = 19};
get_land(53) ->
    #camp_fruit_data{id = 53, item_id = 70183, type = 2,
                     num = 2, cd = 1800, reward = [{70174, 0, 1}],
                     help_exp_mode = 3210, help_exp_radio = 1600,
                     help_rand_reward =
                         [{20052, 0, 1, 150, 0},
                          {20087, 0, 1, 5, 1},
                          {20006, 0, 4, 67, 0},
                          {20025, 0, 1, 9, 0},
                          {20039, 0, 1, 2, 1},
                          {20046, 0, 1, 1, 1},
                          {20075, 0, 1, 1, 1},
                          {20022, 0, 1, 3, 1},
                          {20095, 0, 1, 1, 1},
                          {20088, 0, 1, 10, 0},
                          {20020, 0, 2, 10, 0},
                          {20616, 0, 1, 1, 1},
                          {20091, 0, 1, 40, 0},
                          {90000, 0, 20000, 700, 0}],
                     help_cast_msg =
                         lang:get("#role#慷慨献出自己的种子为好友播种，然后慷慨地将掘出来的#item#装进口袋{fac"
                                  "e_1, 10}"),
                     plant_reward = [{20000, 0, 1}], plant_exp_mode = 3210,
                     plant_exp_radio = 2000,
                     plant_rand_reward =
                         [{20006, 0, 1, 200, 0},
                          {20000, 0, 1, 150, 0},
                          {20005, 0, 1, 100, 0},
                          {20013, 0, 1, 80, 0},
                          {20025, 0, 1, 120, 0},
                          {21220, 0, 1, 180, 0},
                          {20087, 0, 1, 60, 0},
                          {20095, 0, 1, 10, 0},
                          {20021, 0, 1, 50, 0},
                          {20091, 0, 1, 50, 0},
                          {21098, 0, 1, 50, 0}],
                     plant_cast_msg =
                         lang:get("#role#顶着烈阳播种，嘿咻一锄头下去，竟刨出了一件#item#{face_1, "
                                  "31}"),
                     friend_help_id = 11, guild_help_id = 19};
get_land(54) ->
    #camp_fruit_data{id = 54, item_id = 70184, type = 2,
                     num = 2, cd = 1800, reward = [{70175, 0, 1}],
                     help_exp_mode = 3210, help_exp_radio = 1600,
                     help_rand_reward =
                         [{20052, 0, 1, 150, 0},
                          {20087, 0, 1, 5, 1},
                          {20006, 0, 4, 67, 0},
                          {20025, 0, 1, 9, 0},
                          {20039, 0, 1, 2, 1},
                          {20046, 0, 1, 1, 1},
                          {20075, 0, 1, 1, 1},
                          {20022, 0, 1, 3, 1},
                          {20095, 0, 1, 1, 1},
                          {20088, 0, 1, 10, 0},
                          {20020, 0, 2, 10, 0},
                          {20616, 0, 1, 1, 1},
                          {20091, 0, 1, 40, 0},
                          {90000, 0, 20000, 700, 0}],
                     help_cast_msg =
                         lang:get("#role#慷慨献出自己的种子为好友播种，然后慷慨地将掘出来的#item#装进口袋{fac"
                                  "e_1, 10}"),
                     plant_reward = [{20000, 0, 1}], plant_exp_mode = 3210,
                     plant_exp_radio = 2000,
                     plant_rand_reward =
                         [{20006, 0, 1, 200, 0},
                          {20000, 0, 1, 150, 0},
                          {20005, 0, 1, 100, 0},
                          {20013, 0, 1, 80, 0},
                          {20025, 0, 1, 120, 0},
                          {21220, 0, 1, 180, 0},
                          {20087, 0, 1, 60, 0},
                          {20095, 0, 1, 10, 0},
                          {20021, 0, 1, 50, 0},
                          {20091, 0, 1, 50, 0},
                          {21098, 0, 1, 50, 0}],
                     plant_cast_msg =
                         lang:get("#role#顶着烈阳播种，嘿咻一锄头下去，竟刨出了一件#item#{face_1, "
                                  "31}"),
                     friend_help_id = 11, guild_help_id = 19};
get_land(55) ->
    #camp_fruit_data{id = 55, item_id = 70185, type = 2,
                     num = 3, cd = 600, reward = [{70176, 0, 1}],
                     help_exp_mode = 3210, help_exp_radio = 800,
                     help_rand_reward =
                         [{20052, 0, 1, 150, 0},
                          {20087, 0, 1, 5, 1},
                          {20006, 0, 4, 67, 0},
                          {20025, 0, 1, 9, 0},
                          {20039, 0, 1, 2, 1},
                          {20046, 0, 1, 1, 1},
                          {20075, 0, 1, 1, 1},
                          {20022, 0, 1, 3, 1},
                          {20095, 0, 1, 1, 1},
                          {20088, 0, 1, 10, 0},
                          {20020, 0, 2, 10, 0},
                          {20616, 0, 1, 1, 1},
                          {20091, 0, 1, 40, 0},
                          {90000, 0, 20000, 700, 0}],
                     help_cast_msg =
                         lang:get("#role#慷慨献出自己的种子为好友播种，然后慷慨地将掘出来的#item#装进口袋{fac"
                                  "e_1, 10}"),
                     plant_reward = [{20000, 0, 1}], plant_exp_mode = 3210,
                     plant_exp_radio = 1000,
                     plant_rand_reward =
                         [{20006, 0, 1, 200, 0},
                          {20000, 0, 1, 100, 0},
                          {20005, 0, 1, 100, 0},
                          {20013, 0, 1, 80, 0},
                          {20025, 0, 1, 120, 0},
                          {21220, 0, 1, 180, 0},
                          {20087, 0, 1, 20, 0},
                          {20004, 0, 1, 100, 0},
                          {20020, 0, 1, 50, 0},
                          {20021, 0, 1, 50, 0}],
                     plant_cast_msg =
                         lang:get("#role#顶着烈阳播种，嘿咻一锄头下去，竟刨出了一件#item#{face_1, "
                                  "31}"),
                     friend_help_id = 11, guild_help_id = 19};
get_land(56) ->
    #camp_fruit_data{id = 56, item_id = 70186, type = 2,
                     num = 3, cd = 600, reward = [{70177, 0, 1}],
                     help_exp_mode = 3210, help_exp_radio = 800,
                     help_rand_reward =
                         [{20052, 0, 1, 150, 0},
                          {20087, 0, 1, 5, 1},
                          {20006, 0, 4, 67, 0},
                          {20025, 0, 1, 9, 0},
                          {20039, 0, 1, 2, 1},
                          {20046, 0, 1, 1, 1},
                          {20075, 0, 1, 1, 1},
                          {20022, 0, 1, 3, 1},
                          {20095, 0, 1, 1, 1},
                          {20088, 0, 1, 10, 0},
                          {20020, 0, 2, 10, 0},
                          {20616, 0, 1, 1, 1},
                          {20091, 0, 1, 40, 0},
                          {90000, 0, 20000, 700, 0}],
                     help_cast_msg =
                         lang:get("#role#慷慨献出自己的种子为好友播种，然后慷慨地将掘出来的#item#装进口袋{fac"
                                  "e_1, 10}"),
                     plant_reward = [{20000, 0, 1}], plant_exp_mode = 3210,
                     plant_exp_radio = 1000,
                     plant_rand_reward =
                         [{20006, 0, 1, 200, 0},
                          {20000, 0, 1, 100, 0},
                          {20005, 0, 1, 100, 0},
                          {20013, 0, 1, 80, 0},
                          {20025, 0, 1, 120, 0},
                          {21220, 0, 1, 180, 0},
                          {20087, 0, 1, 20, 0},
                          {20004, 0, 1, 100, 0},
                          {20020, 0, 1, 50, 0},
                          {20021, 0, 1, 50, 0}],
                     plant_cast_msg =
                         lang:get("#role#顶着烈阳播种，嘿咻一锄头下去，竟刨出了一件#item#{face_1, "
                                  "31}"),
                     friend_help_id = 11, guild_help_id = 19};
get_land(57) ->
    #camp_fruit_data{id = 57, item_id = 70187, type = 2,
                     num = 2, cd = 1800, reward = [{70178, 0, 1}],
                     help_exp_mode = 3210, help_exp_radio = 1600,
                     help_rand_reward =
                         [{20052, 0, 1, 150, 0},
                          {20087, 0, 1, 5, 1},
                          {20006, 0, 4, 67, 0},
                          {20025, 0, 1, 9, 0},
                          {20039, 0, 1, 2, 1},
                          {20046, 0, 1, 1, 1},
                          {20075, 0, 1, 1, 1},
                          {20022, 0, 1, 3, 1},
                          {20095, 0, 1, 1, 1},
                          {20088, 0, 1, 10, 0},
                          {20020, 0, 2, 10, 0},
                          {20616, 0, 1, 1, 1},
                          {20091, 0, 1, 40, 0},
                          {90000, 0, 20000, 700, 0}],
                     help_cast_msg =
                         lang:get("#role#慷慨献出自己的种子为好友播种，然后慷慨地将掘出来的#item#装进口袋{fac"
                                  "e_1, 10}"),
                     plant_reward = [{20000, 0, 1}], plant_exp_mode = 3210,
                     plant_exp_radio = 2000,
                     plant_rand_reward =
                         [{20006, 0, 1, 200, 0},
                          {20000, 0, 1, 150, 0},
                          {20005, 0, 1, 100, 0},
                          {20013, 0, 1, 80, 0},
                          {20025, 0, 1, 120, 0},
                          {21220, 0, 1, 180, 0},
                          {20087, 0, 1, 60, 0},
                          {20095, 0, 1, 10, 0},
                          {20021, 0, 1, 50, 0},
                          {20091, 0, 1, 50, 0},
                          {21098, 0, 1, 50, 0}],
                     plant_cast_msg =
                         lang:get("#role#顶着烈阳播种，嘿咻一锄头下去，竟刨出了一件#item#{face_1, "
                                  "31}"),
                     friend_help_id = 11, guild_help_id = 19};
get_land(58) ->
    #camp_fruit_data{id = 58, item_id = 70188, type = 2,
                     num = 3, cd = 600, reward = [{70179, 0, 1}],
                     help_exp_mode = 3210, help_exp_radio = 800,
                     help_rand_reward =
                         [{20052, 0, 1, 150, 0},
                          {20087, 0, 1, 5, 1},
                          {20006, 0, 4, 67, 0},
                          {20025, 0, 1, 9, 0},
                          {20039, 0, 1, 2, 1},
                          {20046, 0, 1, 1, 1},
                          {20075, 0, 1, 1, 1},
                          {20022, 0, 1, 3, 1},
                          {20095, 0, 1, 1, 1},
                          {20088, 0, 1, 10, 0},
                          {20020, 0, 2, 10, 0},
                          {20616, 0, 1, 1, 1},
                          {20091, 0, 1, 40, 0},
                          {90000, 0, 20000, 700, 0}],
                     help_cast_msg =
                         lang:get("#role#慷慨献出自己的种子为好友播种，然后慷慨地将掘出来的#item#装进口袋{fac"
                                  "e_1, 10}"),
                     plant_reward = [{20000, 0, 1}], plant_exp_mode = 3210,
                     plant_exp_radio = 1000,
                     plant_rand_reward =
                         [{20006, 0, 1, 200, 0},
                          {20000, 0, 1, 100, 0},
                          {20005, 0, 1, 100, 0},
                          {20013, 0, 1, 80, 0},
                          {20025, 0, 1, 120, 0},
                          {21220, 0, 1, 180, 0},
                          {20087, 0, 1, 20, 0},
                          {20004, 0, 1, 100, 0},
                          {20020, 0, 1, 50, 0},
                          {20021, 0, 1, 50, 0}],
                     plant_cast_msg =
                         lang:get("#role#顶着烈阳播种，嘿咻一锄头下去，竟刨出了一件#item#{face_1, "
                                  "31}"),
                     friend_help_id = 11, guild_help_id = 19};
get_land(_) -> false.

get_reward(Lev) when Lev >= 0 andalso Lev =< 30 ->
    #camp_fruit_reward_data{min = 0, max = 30,
                            reward = [{70190, 0, 1}, {20002, 0, 1}]};
get_reward(Lev) when Lev >= 31 andalso Lev =< 60 ->
    #camp_fruit_reward_data{min = 31, max = 60,
                            reward = [{70190, 0, 1}, {20002, 0, 1}]};
get_reward(Lev) when Lev >= 61 andalso Lev =< 70 ->
    #camp_fruit_reward_data{min = 61, max = 70,
                            reward = [{70190, 0, 1}, {20002, 0, 2}]};
get_reward(Lev) when Lev >= 71 andalso Lev =< 80 ->
    #camp_fruit_reward_data{min = 71, max = 80,
                            reward = [{70190, 0, 1}, {20002, 0, 2}]};
get_reward(Lev) when Lev >= 81 andalso Lev =< 90 ->
    #camp_fruit_reward_data{min = 81, max = 90,
                            reward = [{70190, 0, 1}, {20002, 0, 3}]};
get_reward(Lev) when Lev >= 91 andalso Lev =< 200 ->
    #camp_fruit_reward_data{min = 91, max = 200,
                            reward = [{70190, 0, 1}, {20002, 0, 3}]};
get_reward(_) -> false.

