-file("src/data/strategy_data.erl", 1).

-module(strategy_data).

-export([list/0, get_data/1]).

-file("inc/common.hrl", 1).

-type p() :: bitstring().

-type z() :: non_neg_integer().

-type role_id() :: {pos_integer(), p(), z()}.

-type unit_id() :: {pos_integer(), pos_integer()}.

-type pos() :: {pos_integer(),
                non_neg_integer(),
                non_neg_integer()}.

-record(center,
        {ready = 0 :: 1 | 0,
         pid :: undefined | pid(),
         node :: undefined | atom(),
         center_platform = "" :: list(),
         center_zone_id = 0 :: non_neg_integer(),
         platform = <<>> :: bitstring(),
         zone_id = 0 :: non_neg_integer(),
         combine = [] :: [{bitstring(), non_neg_integer()}]}).

-record(notice_rec,
        {type = 11, digit_attr = [], str_attr = []}).

-file("src/data/strategy_data.erl", 13).

list() ->
    [1001,
     1002,
     1003,
     1004,
     1005,
     1006,
     1007,
     1008,
     1009,
     2001,
     2002,
     2003,
     3001,
     3002,
     3003,
     4001,
     4002,
     4003,
     4004,
     4005,
     4006].

get_data({1001}) ->
    #{name =>
          lang:get("<color='#249015'>【新手课堂】</color>攻略开始募集啦！"),
      content =>
          lang:get("新手四大课堂现开始面向广大玩家朋友们募集优质攻略，您可以提交以下四个角度进行讲解的攻略，也"
                   "可进行综合论述\n只要所言有理有据都能获得参与奖励，如果被<color='#ffff00'"
                   ">采纳</color>为官方攻略，还将得到丰厚大礼包，快来参与吧{face_1,22}\n"
                   "新手课堂第一课：<color='#ffff00'>练级攻略</color>\n新手课堂第二"
                   "课：<color='#ffff00'>宠物攻略</color>\n新手课堂第三课：<col"
                   "or='#ffff00'>职业攻略</color>\n新手课堂第四课：<color='#f"
                   "fff00'>赚钱攻略</color>"),
      question => [], reward => [], type => 1, order => 1010,
      time => 1468598400};
get_data({1002}) ->
    #{name =>
          lang:get("<color='#249015'>【练级攻略】</color>新服首日40级攻略"),
      content =>
          lang:get("40级并不是开服首日的极限！40级并不是开服首日的极限！40级并不是开服首日的极限！这里首"
                   "先说明下，很重要所以说三遍。\n\n\n由于等级超过世界等级之后，获得的所有经验都会降低，"
                   "所以获得经验的顺序并没有太大的差别，重点是：<color='#ffff00'>做队长！有经"
                   "验加成！</color>\n\n\n首先跟着剧情跑一直到16级，中途可以选择充值一个首充，"
                   "然后把首充宠物带上，可以一直带到55-65级。在16级的时候可以选择做<color='#f"
                   "fff00'>职业任务</color>。（不要挂野外升级，一来经验少，二来要赶上12.30"
                   "的吃货巡游，所以要尽快升到30级）做完职业任务之后，等级已经超过20级了，<color='"
                   "#ffff00'>继续做剧情</color>，25级开启上古妖魔，这时候先别管，继续升级。"
                   "（这时候可以找个公会加入）把剧情做到不能继续之后，<color='#ffff00'>转做悬"
                   "赏</color>，记得领双倍！\n\n\n30级的时候，宝图任务，竞技场，极寒试练也开启"
                   "了，还是先不做。在跑悬赏的途中，注意在17点开启的智慧闯关也会提供比较多的经验，如果实在对"
                   "自己没信心的注意打开网页查答案吧。\n\n\n把60次悬赏都做完之后，等级已经超过35了，"
                   "<color='#ffff00'>精灵公主副本</color>开启，OK，进去。一般这个副"
                   "本难度比较低，如果打不过，注意切手动点杀，控制，基本都可以通过，基本没有装备和宠物的要求。\n\n\n"
                   "注意35级的时候开启的<color='#ffff00'>魔法炼化</color>功能，把一"
                   "些不常用的东西炼化，可以转化成经验，这个在前期很有用。\n\n\n35级后把<color="
                   "'#ffff00'>上古妖魔</color>20次打完，然后看距离40还有多少级，如果差距"
                   "不大可以尝试吃基本经验书先升到40级，然后先去把10张宝图都打了，挖了看有没有合适的东西。\n\n\n"
                   "然后去完成远航商人，这个只需要提交道具就可以获得<color='#ffff00'>冒险技能"
                   "</color>的经验值，注意这里的道具基本都可以通过<color='#ffff00'>生"
                   "活技能</color>来制造，而活力值在日程里面领取活跃度礼包可以得到。\n\n\n技能升"
                   "级完毕之后可以把<color='#ffff00'>精灵公主挑战、天空之塔</color>第"
                   "一层过了，把装备再强化一下。装备搞的差不多之后，可以先去打极寒试练，记得要先把<color"
                   "='#ffff00'>极寒试练</color>打完再打当天的竞技场次数，因为极寒试练的对手"
                   "难度是根据自己的综合实力和竞技场积分来抽取，所以在竞技场上分前先把极寒试练打了。\n把日常"
                   "玩法清理的差不多之后，可以留意下<color='#ffff00'>40级世界BOSS</c"
                   "olor>，基本上听好指挥集火、控制，就能把BOSS杀死。\n\n\n把这些都做完之后，基"
                   "本就到晚上了，只要首日达到40级以上的基本都可以很好的找到队伍，找好队伍参加当天的活动吧。"
                   ""),
      question =>
          [{1,
            lang:get("第1/2题,悬赏做队长是否有经验加成"),
            [{1, "有"}, {2, "无"}],
            1},
           {2,
            lang:get("第2/2题,强力首充宠物云露可以用到多少级"),
            [{1, "25-35"},
             {2, "35-45"},
             {3, "45-55"},
             {4, "55-65"}],
            4}],
      reward => [{20052, 1}, {90000, 50000}], type => 1,
      order => 1020, time => 1468598400};
get_data({1003}) ->
    #{name =>
          lang:get("<color='#249015'>【新手攻略】</color>新手不完全攻略"),
      content =>
          lang:get("浮浮沉沉数十载，终于等到了一款钟爱的回合制网游，那就来说一说我对这个游戏的理解，这里说道的"
                   "不完全攻略只是大致，后期还有专门针对各个职业的总体介绍。\n\n<color='#00ff"
                   "00'>【职业选择】</color>\n不疯狂不成魔，职业的选择本人推荐新手玩输出，比如<"
                   "color='#ffff00'>战弓、狂剑、魔导</color>，为什么在辅助盛行、奶妈吃"
                   "香的年代要选择输出职业呢？\n第一：任务没输出不行，都说宠物比人物强，但60以后就是人物时"
                   "代了，可以强化，装备还是很重要的。\n第二：时间就是金钱，不可能做各种日常还要等待。\n第"
                   "三：到了60级你再穷也有强化装备的钱，而且装备强化的属性就是加输出的。\n第四：人强宠物强"
                   "才是王道，什么职业配什么宠物各位看官不要急，请往下看我会给大家介绍的。\n\n<color"
                   "='#00ff00'>【升级】</color>\n唯一要说的是不要盲目的把主线任务和爵位挑"
                   "战都做了，<color='#ffff00'>经验满后只能获得银币</color>。\n另外"
                   "说下魔法炼化，不是什么东西都可以炼化的，也不是不显示炼化就不能炼化的。现主要炼化<colo"
                   "r='#ffff00'>银币</color>，有多的炼化点可以炼化<color='#fff"
                   "f00'>冒险经验</color>，因为我说了人物才是主力，没钱寸步难行。\n\n<col"
                   "or='#00ff00'>【宠物】</color>\n人生在世谁不想牛B一把，神兽，珍兽，"
                   "我这里说的不是如何获得最厉害最好看的宠物，而是教你如何少花钱获得性价比最高的贴身伙伴\n\n"
                   "如果你是首冲玩家那就更好了，<color='#ffff00'>云露</color>不用洗，"
                   "加点4魔1血，唯一记得要打一本涅槃和一本神佑复生，也可以买个星辰护符是涅槃或者神佑复生的带"
                   "上，同时洗个法术资质不错的满技能<color='#ffff00'>狐狸</color>就可"
                   "以了，然后再洗一只<color='#ffff00'>犀牛战士</color>，这样你就有3"
                   "个宠物了，狐狸日常竞技场都很好用，遇到狐狸被秒了的情况如果犀牛不闪现那么你就把云露召唤出来"
                   "，又能战斗又能保命。\n\n\n65以后的宠物才有升值的空间，这三只宝宝足够你熬到65级了"
                   "，前期洗宝宝越多你浪费的金币越多，65级就可以开始洗<color='#ffff00'>老虎"
                   "或者冰熊</color>了，暴力路线就洗老虎，日常任务不吃力就洗冰熊，因为冰熊的正义打击是"
                   "按百分比掉血的。\n\n<color='#00ff00'>【助战】</color>\n守护"
                   "当然越多越好，但不推荐招募58级石头人，兽灵伙伴就是封，花钱还多。<color='#fff"
                   "f00'>阿瑞斯和露露</color>是必须招募的，很强大。前期带法宠的比较多，建议2秘言"
                   "1战攻1法师。阵法选<color='#ffff00'>速度阵</color>，3级速度阵出"
                   "手比对面快。\n\n<color='#00ff00'>【省钱】</color>\n只要你坚"
                   "持65以前不乱洗宝宝不乱打技能书那么你65级肯定是百万富翁，当然是百万金币，千万银币。我觉"
                   "得我已经不能用省形容我自己了，应该算是扣了，先从银币说起。\n第一个是<color='#f"
                   "fff00'>悬赏</color>（这个大家都会做也是主要经验来源）。\n第二个就是<co"
                   "lor='#ffff00'>极寒挑战</color>，这个也不用说必须做的。\n第三个是<"
                   "color='#ffff00'>活力</color>，活力用在研药，因为远航可以自己用也可"
                   "以市场卖，还有一个省钱的方法就是远航任务，NPC出售的装备就<color='#ffff00"
                   "'>公会求助</color>，因为完成了才有2本冒险笔记，银币不要用来升级冒险经验，可以选"
                   "择整点去找冒险宝箱，各个挂机地图均有出现。\n\n\n说完了银币那么就来说下金币，做活动得"
                   "到的活动<color='#ffff00'>积分兑换宝图</color>，宝图存着，世界等级"
                   "开45了挖一次，开65了挖一次，开放70以后有多少挖多少，装备之魂还是很贵的。\n以上就是"
                   "本人的一些小心得，希望看完对你们有所帮助。"),
      question =>
          [{1,
            lang:get("第1/2题,游戏中的输出职业有哪些"),
            [{1, "魔导"}, {2, "战弓"}, {3, "狂剑"}, {4, "以上都对"}],
            4},
           {2,
            lang:get("第2/2题,银币获得方式有哪些"),
            [{1, "悬赏"}, {2, "极寒挑战"}, {3, "魔法炼化"}, {4, "以上都对"}],
            4}],
      reward => [{20052, 1}, {90000, 50000}], type => 1,
      order => 1030, time => 1468598400};
get_data({1004}) ->
    #{name =>
          lang:get("<color='#249015'>【新手攻略】</color>新服冲榜全攻略"),
      content =>
          lang:get("本篇文章针对平民玩家攻略，土豪玩家可以无视。\n\n<color='#ffff00'>【新"
                   "手篇】</color>\n如果你作为一个新手，第一次玩星辰奇缘，如果是老区，找一个<col"
                   "or='#ffff00'>好师傅</color>很重要，新区的话，找一个<color='#"
                   "ffff00'>好公会</color>很重要，好的公会才能学习更多的东西，作为一个新手一定"
                   "要学会看日程，每天的任务活动要做完，奖励很多的，经验也很多，尽量不浪费一点经验，也要学着带"
                   "队，这样才能更好的融入游戏。\n\n<color='#ffff00'>【任务篇】</col"
                   "or>\n很多小伙伴玩游戏都喜欢选择新区，那么介绍下如何冲新区。\n先做<color='#"
                   "ffff00'>剧情</color>，没剧情做<color='#ffff00'>职业</c"
                   "olor>，然后再剧情，剧情做完就开始做悬赏了，<color='#ffff00'>50次悬"
                   "赏</color>，各位小伙伴一定要选择一个有天火阵法的队伍，因为这样可以节约很多的时间。"
                   "第一天下午都应该能40，这时候就要做40的活动了，<color='#ffff00'>天空，"
                   "副本，封妖</color>。当你没有任务了怎么办，可以继续做悬赏，基础经验也比挂野多，每1"
                   "0环还有银币。\n当很多人度过了新手这一阶段，就要开始每天的活动了。\n\n<color="
                   "'#ffff00'>星座守护</color>，这是每天的经济来源之一呀，很多小伙伴觉得高星"
                   "座可能更容易获得好的东西，其实不然，真正的区别在789，会出两个<color='#ffff"
                   "00'>生命精华</color>，所以建议各位每天打完3次且量力而行。\n\n<color"
                   "='#ffff00'>封妖任务</color>，很多小伙伴认为封妖只是经验，所以每天做了1"
                   "0个，剩下的10个经验变低了就不做，这是错误的。因为封妖可以做20次，奖励依然在，只是经验"
                   "比较低，可以后的魂。\n\n<color='#ffff00'>天空任务</color>，天"
                   "空任务也是经济的来源之一，每天的天空送宝图，星月石，每一个怪能翻牌，60次之后一天10次机"
                   "会抽奖，有可能一次天空赚2-3w呢。\n\n<color='#ffff00'>勇者战场</"
                   "color>，分为两个阵营，进入后随机分配，很多的小伙伴不喜欢弄守护，其实1v1的情况，并"
                   "不看重你的人物，而是守护，获胜队伍有宝箱。\n\n<color='#ffff00'>公会战"
                   "</color>，在这里很多小伙伴觉得没人组不想去参加，其实这是错误的，因为一个队伍点一个"
                   "人的队伍，掉的行动值是5个的，更何况还有经验，物品，所以就算一个人也要打公会战。\n\n<"
                   "color='#ffff00'>公会英雄战</color>，分为三个代表队参加，但是有一个"
                   "细节，那就是队伍的分配，土豪公会略过，普通公会，很难有3支土豪队伍，这时候队伍分配很重要了"
                   "，并不是强打强弱打弱，而是田忌赛马。没能参加，观战也有经验，获胜的公会有宝箱。\n\n<c"
                   "olor='#ffff00'>荣耀战场</color>，分为联盟部落，进入时随机分配，但可"
                   "以两人组队进一个阵营，夫妻档和基友档福利吧，赢得一方有宝箱，可以获得很多物品，有几率<co"
                   "lor='#ffff00'>神兽</color>！\n\n<color='#ffff00'"
                   ">时空段位</color>，很多小伙伴不会玩这个3v3的活动，一般情况，双排是最稳妥的，你"
                   "和你基友，爱人，可以一起参加，我推荐的是一个辅助一个输出组队，这样胜利大一些，这个活动经验"
                   "也不少，输了也不可怕！\n\n<color='#ffff00'>职业挑战</color>，"
                   "职业挑战这个活动，是分为10环，每一环有一次奖励，奖励随机。\n\n<color='#ff"
                   "ff00'>彩虹秘境</color>，可以开出<color='#ffff00'>珍兽，神兽"
                   "</color>几率低。先说说活动玩法，组5个人最好，进入后，活动有12层，前6层两个传送"
                   "使，分为蓝绿，后5层3个，分为红蓝绿，12层为顶，首先到达12层的3支队伍有奖励礼盒，中途"
                   "有宝箱，分为铜，银，金，神秘，4种宝箱，每一层传送使颜色不一定。所以这里要么有一个好队长带"
                   "队，还要有好的运气，后6层碰到错的会自动进入战斗状态。如果想冲前3的小伙伴一定要注意走位啦"
                   "，一开始迅速走向12层，打到boss，都有一次翻牌的机会，然后这时候，就去10或者11层不"
                   "停的打怪，打钥匙，有铜银钥匙找到宝箱就开了，<color='#ffff00'>金钥匙</c"
                   "olor>能开所有的宝箱，但主要用来开启<color='#ffff00'>神秘宝箱</co"
                   "lor>，因为有可能获得<color='#ffff00'>珍兽</color>一只。活动时"
                   "间只有1小时，所以当你最后2分钟时，别执着找什么，而是有什么开什么，这样才不浪费钥匙。\n\n"
                   "<color='#ffff00'>【生活篇】</color>\n很多小伙伴40.50.60"
                   "喜欢洗很多装备，宝宝，翅膀，其实没必要的。装备，翅膀升级了，你洗的属性就消失了，所以在<c"
                   "olor='#ffff00'>70级之前</color>我简直不用太在意装备，翅膀，因为升"
                   "级太快了，没有必要。<color='#ffff00'>宠物篇</color>，如果你能首充"
                   "，那么系统送的云露就可以过渡到55或者后期了，平民由于没有神兽，想要一只厉害的宝宝非常的困"
                   "难，我推荐每个等级的宝宝。\n55级一定要有一只<color='#ffff00'>美人鱼<"
                   "/color>，pk第二宠物，它的控制，群体混乱，再打一个法术连击，一个不小心控制了3个，"
                   "你就成功了。\n65级推荐<color='#ffff00'>熊</color>，一只很厉害"
                   "的血宠，pk第二充宠物不解释。\n很多平民都没有结婚，因为很多妹子都要选择豪华婚礼，这也没"
                   "错，因为，<color='#ffff00'>1314钻石别人就陪你玩几个月的游戏</col"
                   "or>，但是希望妹子们遇到一个好男人，挚爱也可以嫁了哦，肯定一心一意陪你。\n\n接下来就"
                   "要分享几个小技巧了\n积分的用来买<color='#ffff00'>宝石袋子</color"
                   ">最划算，因为宝石的出处很少，所以宝石袋子成了平民玩家唯一的宝石来源.\n装备强化，我建议"
                   "各位<color='#ffff00'>强化平均</color>，因为全套加7以上后会有个冒"
                   "险技能的加成。\n平民如何拥有一只<color='#ffff00'>神兽或者珍兽</col"
                   "or>呢，有一个任务就很重要了，<color='#ffff00'>宝图</color>，大"
                   "家从新区开始第一天不要用，等到世界等级65的时候，挖70魂，一个可是12500，到那时差不"
                   "多有400图了，只要能挖出50个70魂，就是一只兔子，还不包括其他的东西呀！\n不建议挖高"
                   "级，所有材料卖掉<color='#ffff00'>最划算</color>。平民最好少做的事"
                   "，打技能书，洗护符，挖高级宝图。\n\n\n好啦，今天的攻略在这里结束，希望对大家有用，希"
                   "望大家能够喜欢！"),
      question =>
          [{1,
            lang:get("第1/2题,如何查看每日任务？"),
            [{1, "左上角的日程"}, {2, "找GM"}],
            1},
           {2,
            lang:get("第2/2题,每日活动有没有可能获得神兽"),
            [{1, "可能"}, {2, "不可能"}],
            1}],
      reward => [{20052, 1}, {90000, 50000}], type => 1,
      order => 1040, time => 1468598400};
get_data({1005}) ->
    #{name =>
          lang:get("<color='#249015'>【新手攻略】</color>八大核心玩法攻略"),
      content =>
          lang:get("游戏指引方面比较欠缺，小编前期走了很多弯路、花了很多冤枉钱，现在为大家介绍一下哪些方面是能"
                   "省则省的，能赚则赚的：\n\n<color='#00ff00'>【魔法炼化篇】</colo"
                   "r><color='#ffff00'>栽培、魔药</color>的产出多余的拿来炼化成能量"
                   "，比如长生果、波波变身果之类，市场售价也比较便宜。最好是有与<color='#ffff00"
                   "'>优秀能量石</color>，一个就有50点能量。\n1.<color='#ffff00"
                   "'>银币</color>：25点能量值炼化一格，一格的银币是7W5，长期玩家有条件可以开通"
                   "炼化格子。\n2.<color='#ffff00'>人物经验</color>：建议前7天，"
                   "需要上冲级排行榜的可以炼化，平常时期不推荐炼化；\n3.<color='#ffff00'>"
                   "宠物经验</color>：也是要升级宝宝的时候炼化，平时不推荐炼化；\n4.<color="
                   "'#ffff00'>冒险经验</color>：3.9W=100修炼值，推荐下必须每天挖前1"
                   "0冒险宝箱和冒险经验炼化。\n\n<color='#00ff00'>【公会商店篇】</co"
                   "lor>\n小编不喜欢大的公会，公会商店的东西会经常秒不到。现在小编介绍下哪些必须要用帮贡"
                   "买的去抢的：\n1.<color='#ffff00'>幸运石</color>：幸运石金币买"
                   "不到，只能钻石买，<color='#ffff00'>无市场无价</color>，装备强7强"
                   "8、9时放入幸运石会事半功倍的。\n2.<color='#ffff00'>银袋子</col"
                   "or>：100帮贡=30W银币。每周兑换帮贡25W等于100帮贡，你转手也能赚个5W银币。"
                   "但小编建议大家，在公会管理升级的时候，把银子兑换帮贡，25W=120帮贡，比每周兑换帮贡划"
                   "算多了。\n3.<color='#ffff00'>宝石袋</color>：52帮贡=1宝石"
                   "袋。有时人品好，开个8个物攻宝石（60级后期市场价1个3200多） 那就赚翻，反正不亏就是"
                   "了，大不了运气差点得个魔法宝石。\n4.<color='#ffff00'>强化石</col"
                   "or>：1个强化石40帮贡，约10W=1个强化石=2500左右金币（60级后期市场价），需"
                   "要强化装备时，可以购入\n5.其他的商品，需要的时候兑换吧~\n另外说下打完强盗不要马上走"
                   "，等会长开宝箱，在公会领地挖宝箱。\n\n<color='#00ff00'>【装备锻造篇】"
                   "</color>\n60级锻造武器<color='#ffff00'>+9就能发光</col"
                   "or>，所以建议大家还没到60级前，先储备强化石。不推荐将得到的强化石卖掉，不然到60级后"
                   "，强化石至少涨到快2500+。小充党的玩家建议每周必购买<color='#ffff00'>"
                   "96钻石30个强化石</color>，这是钻石商场<color='#ffff00'>最划算"
                   "</color>的钻石商品，我算了一下30强化石（60级大约2500金币一个）=7W5金币"
                   "=96钻石 还有比这个更划算的吗？<color='#ffff00'>宝石</color>不"
                   "要卖掉（除了蓝宝石），还有大伙还没60级前，有多余的金币就买宝石，60级后期会大涨。<co"
                   "lor='#ffff00'>星月石</color>，大家可以查看系统给的价格，假如高于系统"
                   "价格（例如2级星月石系统给的价格23.2W），那么市场2阶星月石高于23.2W就不要买，小"
                   "编通常将活动得到的星月石摆摊卖到7.9W一下子被秒光，再用系统提供的星月石6.5W（好像是"
                   "这价格吧）锻造，两者中间价也能得1W 别小瞧这钱，一天得到的星月石不下5个呢。<color"
                   "='#ffff00'>装备魂</color>，建议得到的魂先存起来,等开等级，冷门的职业就"
                   "马上卖掉吧。\n\n<color='#00ff00'>【挖宝图篇】</color>\n系统"
                   "提醒有人放妖了，你再去挖，小编试了N张过，都没有放妖过。建议<color='#ffff00"
                   "'>积分换宝图</color>，到后期能挖70级魂后再兑换去挖。\n\n<color='#"
                   "00ff00'>【上古封妖篇】</color>\n小编经常带队封妖，虽然日常只写10次，但"
                   "那是10次得的经验多+能得魂，第10-20次只是经验少+能得魂，经常遇到我杀第10只以上的"
                   "时候，队员就离队了，有空就封<color='#ffff00'>20只妖</color>吧。\n\n"
                   "<color='#00ff00'>【宝宝篇】</color>\n65级前练个<color="
                   "'#ffff00'>狐狸群法宝宝</color>挂或者<color='#ffff00'>首"
                   "充云露</color>就行。55级的狼随便洗，资质技能够就行，将就带到65级。因为65级后"
                   "的宝宝能进阶2次，区别还是很大。真穷的话，就带着忍者松鼠和55狼带到65级，反正0到65级"
                   "也就20天。\n要冲竞技榜可以练个群法宝宝(如果有神兽，请无视）。\n\n<color='"
                   "#00ff00'>【结婚篇】</color>\n有人结婚就尽量蹭婚礼现场，能得<color"
                   "='#ffff00'>经验</color>，还能在婚礼现场<color='#ffff00'"
                   ">挖宝箱</color>，得的东西不错，有四宝，强化石幸运石什么的，哈哈~\n\n<col"
                   "or='#00ff00'>【翅膀篇】</color>\n攒两周的金币，如果不花费21万金币"
                   "进阶为3阶翅膀，估计珍兽就能拿到手了。对于翅膀系统，小编还是觉的大家有闲钱再升级吧。"),
      question =>
          [{1,
            lang:get("第1/2题,65级后的宠物可以进阶几次（非神兽）"),
            [{1, "1"}, {2, "2"}, {3, "3"}, {4, "4"}],
            2},
           {2,
            lang:get("第2/2题,上古妖魔多少次内有可能获得装备魂"),
            [{1, "前10次"}, {2, "前20次"}, {3, "前30次"}, {4, "前40次"}],
            2}],
      reward => [{20052, 1}, {90000, 50000}], type => 1,
      order => 1050, time => 1468598400};
get_data({1006}) ->
    #{name =>
          lang:get("<color='#249015'>【新手攻略】</color>新手全面赚钱攻略"),
      content =>
          lang:get("天了噜！又木有钱了！各位小伙伴是不是经常都会有这个感觉呢？今天就带大家看看，大神们都是如何"
                   "赚钱的！\n\n<color='#00ff00'>【日常大力刷】</color>\n首先，"
                   "刷钱钱的第一大途径，就是刷各种日常，尤其是银币产出超高的<color='#ffff00'>"
                   "极寒试炼</color>和挖金币挖到笑死的<color='#ffff00'>宝图任务</c"
                   "olor>，这两个是每日必做的日常任务！其实两个任务要花费的时间不多（相对于悬赏来说），而"
                   "且不需要组队，完成后收益很高，所以性价比是灰常高的！\n然后就是<color='#ffff"
                   "00'>天空之塔</color>，对于新手玩家来说，天空之塔可能会有一定的难度，不过产出的"
                   "道具还不错。像星月石，自己用或卖掉换钱钱都可以！\n如果有时间，就去刷<color='#f"
                   "fff00'>悬赏和职业</color>吧。悬赏虽然钱不多，但是经验多多！而且60轮下来也"
                   "是一大笔银币了。至于职业任务，前期加的经验还是蛮多的，20轮下来的银币也是挺多，能够刷满就"
                   "最好了！\n\n<color='#00ff00'>【炼化少不了】</color>\n日程里"
                   "有一个任务是<color='#ffff00'>魔法炼化</color>，通过炼化玩家可以获"
                   "得大量的银币。只需要点一下炼化，再等上一段时间就可以收获银币了！等待的过程中，可以照常刷其"
                   "他的任务，真是又好又快又省事有木有？！\n\n<color='#00ff00'>【货品卖不"
                   "停】</color><color='#ffff00'>生活技能</color>可以产出各种"
                   "高药高图和雕文，这些放到银币市场去卖，都是可以换很多银币的！\n\n<color='#00"
                   "ff00'>【抢先买买买】</color><color='#ffff00'>新服开启</c"
                   "olor>的时候，很多道具的价格都是很低的，经过一段时间后，一些热卖的道具价格就会上涨很多"
                   "！像灵犀、宠物符石和宠物高书这些！所以刚开新服的时候，可以趁着低价，抢先购买自己需要的道具"
                   "，这样日后要用的时候，就会省下一大笔钱了！而且就算用不到，到时候卖掉也不会亏！\n\n<c"
                   "olor='#00ff00'>【副本搞起来】</color>\n副本主要产出的是各种<co"
                   "lor='#ffff00'>高价值</color>道具,就算用不到，也可以卖了换钱钱。\n\n"
                   "<color='#00ff00'>【积分碗里来】</color>\n最后我们来说一下积分！"
                   "除了钻石银币和金币可以兑换道具，用<color='#ffff00'>积分、人品、恩爱和帮贡"
                   "</color>也是可以换到很多很好的道具的。\n好啦！今天的赚钱攻略就是这么多啦！"),
      question =>
          [{1,
            lang:get("第1/2题,悬赏任务可以获得哪些奖励"),
            [{1, "经验"}, {2, "银币"}, {3, "随机物品"}, {4, "以上都对"}],
            4},
           {2,
            lang:get("第2/2题,正常情况以下哪个日常活动银币奖励最多"),
            [{1, "悬赏"}, {2, "极寒挑战"}, {3, "职业任务"}, {4, "副本"}],
            2}],
      reward => [{20052, 1}, {90000, 50000}], type => 1,
      order => 1060, time => 1468598400};
get_data({1007}) ->
    #{name =>
          lang:get("<color='#249015'>【新手攻略】</color>新手之不能说的秘密"),
      content =>
          lang:get("<color='#00ff00'>【宠物篇】</color>\n1.宠物级数不能超过个人角"
                   "色<color='#ffff00'>5级</color>\n2.宠物的资质有3个数据，分别"
                   "是：该类宠物所能达到的最高上限≥洗髓后所能达到的上限≥当前资质。\n3.尽量要避免宠物宝宝"
                   "死亡，死亡会导致宝宝掉寿命。\n4.宠物的寿命可以通过道具补充，没有使用限制！\n5.速度"
                   "高的宠物可以在别人攻击自己前先给自己加血。\n6.速度低的宠物可以在别人行动完毕后再复活队"
                   "友，避免复活起来又被攻击到。\n7.洗练宠物的时候多准备几只，洗到差不多的就换一只洗，避免"
                   "越洗越差。\n8.宠物<color='#ffff00'>洗髓变异</color>后，再洗髓"
                   "将有概率变回普通宠物。\n9.宠物穿戴符石可获得可直接增加属性，穿戴护符将获得技能。\n1"
                   "0.技能不好的护符可以在市场购买<color='#ffff00'>重置丹</color>，"
                   "但是无法重置附带技能个数。\n11.宠物进阶后，保留护符的一个技能，若护符有2个技能则取其"
                   "中一个，所以进阶用<color='#ffff00'>单技能护符</color>就好了。\n"
                   "12.宠物进阶到最高阶时，穿戴护符/符石后将不可卸下，只能被替换。\n13.<color="
                   "'#ffff00'>天赋异禀</color>这个宠物技能书可让宠物随机学习一个天生技能，宠"
                   "物的<color='#ffff00'>稀有技能</color>被顶掉可以用这个学回来！\n\n"
                   "<color='#00ff00'>【战斗篇】</color>\n1.阵法之间会互相克制。\n"
                   "2.战斗中长按人物或宠物可查看当前状态。\n3.战斗中长按技能可查看具体介绍。\n4.受到"
                   "嘲讽状态下，使用所有技能自动转换为普通攻击。\n5.除了秘言主攻回复生命，魔导也是有回复少"
                   "量生命的技能的。\n6.主城下方有擂台区域，可以在里面自由切磋。\n7.竞技场挑战无论成功"
                   "还是失败，不会有损失。\n8.竞技场每10秒可以刷新一次。\n9.竞技场、勇士战场战斗上阵"
                   "辅助秘言或兽灵守护超过2个时，辅助守护使用技能消耗的魔法将额外增加。\n10.未上阵的守护"
                   "可在助阵界面给其他守护提供<color='#ffff00'>属性加成</color>。\n\n"
                   "<color='#00ff00'>【任务篇】</color>\n1.队伍中如果有新人存在，"
                   "悬赏战斗中小怪将会有几率逃跑。\n2.重复打副本会被视为帮助他人，不能继续获得奖励，但可获"
                   "得<color='#ffff00'>积分</color>。\n3.远航任务的每一个道具都会"
                   "分别增加冒险经验，并不是全部都提交才能获得奖励。\n4.帮助他人完成远航商人活动，可获得冒"
                   "险经验奖励以及经验的提成。\n\n<color='#00ff00'>【装备篇】</colo"
                   "r>\n1.装备升阶不会影响<color='#ffff00'>强化等级</color>。\n"
                   "2.装备升阶后会重置附加<color='#ffff00'>属性和附加特效</color>。\n"
                   "3.装备重铸界面点击右上角的【打造预览】可以看到该部位可能出现的特效和具体效果说明。\n5"
                   ".升级装备可同时提升<color='#ffff00'>宝石等级上限</color>。\n6"
                   ".守护可以<color='#ffff00'>升级装备和镶嵌宝石</color>。\n7.翅"
                   "膀升阶后会重置品质。\n8.合成一阶翅膀所需的翅膀灵羽可通过挑战天空之塔和金币市场获得\n\n"
                   "<color='#00ff00'>【日常篇】</color>\n1.官方工作人员不会问你要"
                   "帐号密码，找你要密码的都是骗子。\n2.留意人物头像下方的BUFF补充饱食度，饱食度不足的"
                   "时候将不会在战斗结束后补充生命与魔法值。\n3.每周的<color='#ffff00'>双"
                   "倍</color>点数在<color='#ffff00'>周一重置</color>。\n4"
                   ".加点面板的小齿轮，点击可设置<color='#ffff00'>自动加点</color>。\n"
                   "5.新手玩家40级前可以<color='#ffff00'>免费洗点</color>一次。\n"
                   "6.冒险技能页面有一个【设为当前默认升级技能】的选项，可选择获得的冒险经验加到哪一个修炼中"
                   "。\n7.人物经验书每天最多可使用<color='#ffff00'>20本</color>"
                   "，宠物经验书可以无限次使用\n8.人物等级达到世界等级上限，经验转化成银币\n9.聊天界面"
                   "的小图片点开查看其实是<color='#ffff00'>自定义头像</color>。\n1"
                   "0.聊天界面出现过的组队信息可在队伍页面看到。\n11.访问其他玩家的空间将有机会获得礼物"
                   "。\n12.赠送999玫瑰同时可以获得300冒险经验\n13.带新人可以获得积分，可在商城"
                   "兑换礼品。\n14.参与竞技场获得的积分可在其商店兑换物品。\n15.活跃度达到一定的数量"
                   "时能领取相应的礼盒，礼盒中包含制作生活技能所需的活力值。\n16.进入公会达到24小时后，"
                   "每天可领取工资。\n17.生活技能和辅助技能升级需要银币和公会贡献。\n18.<color"
                   "='#ffff00'>金币</color>的获得除了钻石兑换，还可以通过出售道具获得，可获"
                   "得出售道具的地方有<color='#ffff00'>职业任务、金币市场、宝图任务</col"
                   "or>。\n19.通过宝图任务每天最多能获得<color='#ffff00'>10张藏宝图"
                   "</color>。\n20.商城里的<color='#ffff00'>神秘商店</colo"
                   "r>，里面的道具是每天都会刷新的，记得扫货哦！\n22.系统设置里可设置是否自动播放别人的"
                   "语音消息。\n23.游戏的左上角有当前时间，不用切换出去也能看时间。\n24.拥有翅膀后，"
                   "可在聊天窗口右上角控制飞行还是降落。\n25.使用波波果实可改变玩家外型。"),
      question =>
          [{1,
            lang:get("第1/2题,太阳重置丹和月亮重置丹可以改变护符技能个数吗"),
            [{1, "可以"}, {2, "不可以"}],
            2},
           {2,
            lang:get("第2/2题,用单技能护符进阶宠物，护符技能一定会出现在宠物身上吗"),
            [{1, "一定会"}, {2, "可能会"}, {3, "太阳护符会"}, {4, "月亮护符会"}],
            1}],
      reward => [{20052, 1}, {90000, 50000}], type => 1,
      order => 1070, time => 1468598400};
get_data({1008}) ->
    #{name =>
          lang:get("<color='#249015'>【新手攻略】</color>一句话玩转《星辰奇缘》"),
      content =>
          lang:get("\n<color='#00ff00'>01</color>、每周的双倍点数在<color="
                   "'#ffff00'>周一</color>重置\n\n<color='#00ff00'>02"
                   "</color>、加点面板的小齿轮，点击可设置<color='#ffff00'>自动加点<"
                   "/color>\n\n<color='#00ff00'>03</color>、新手玩家40"
                   "级前可以<color='#ffff00'>免费洗点</color>一次\n\n<color"
                   "='#00ff00'>04</color>、冒险技能页面有一个<color='#ffff0"
                   "0'>【设为当前默认升级技能】</color>的选项，可选择获得的冒险经验加到哪一个修炼中\n\n"
                   "<color='#00ff00'>05</color>、人物经验书每天最多可<color="
                   "'#ffff00'>使用20本</color>，宠物经验书可以无限次使用\n\n<colo"
                   "r='#00ff00'>06</color>、人物等级低于世界等级时，将会额外获得<col"
                   "or='#ffff00'>经验加成</color>与各种补助\n\n<color='#00"
                   "ff00'>07</color>、聊天中名字后带小图片点开可查看<color='#ffff"
                   "00'>自定义头像</color>\n\n<color='#00ff00'>08</col"
                   "or>、聊天界面出现过的组队信息可在队伍页面看到\n\n<color='#00ff00'>"
                   "09</color>、访问其他玩家的空间并选择<color='#ffff00'>“点赞一下"
                   "”</color>将有机会获得礼物哦\n\n<color='#00ff00'>10</co"
                   "lor>、带新人可以获得<color='#ffff00'>人品积分</color>，可在商"
                   "城兑换礼品\n\n<color='#00ff00'>11</color>、参与竞技场与各类"
                   "活动获得的<color='#ffff00'>积分</color>可兑换各类实用物品\n\n"
                   "<color='#00ff00'>12</color>、进入公会达到24小时后，每天可领取"
                   "<color='#ffff00'>公会分红</color>，职位越高分红越高\n\n<co"
                   "lor='#00ff00'>13</color>、生活技能升级需要消耗<color='#f"
                   "fff00'>银币和公会贡献</color>\n\n<color='#00ff00'>14"
                   "</color>、挖宝图可以获得丰厚的<color='#ffff00'>金币奖励</col"
                   "or>\n\n<color='#00ff00'>15</color>、通过宝图任务每天都能"
                   "轻松获得10张<color='#ffff00'>藏宝图</color>\n\n<color"
                   "='#00ff00'>16</color>、商城里的<color='#ffff00'>神秘"
                   "商店</color>，里面的道具每天都会刷新的，价格相当实惠\n\n<color='#00"
                   "ff00'>17</color>、系统设置里可设置是否<color='#ffff00'>自"
                   "动播放</color>别人的语音消息\n\n<color='#00ff00'>18</co"
                   "lor>、游戏的左上角有当前时间，不用切换出去也能看时间\n\n<color='#00ff"
                   "00'>19</color>、拥有2阶翅膀后，可在聊天窗口右上角控制<color='#ff"
                   "ff00'>飞行</color>还是降落\n\n<color='#00ff00'>20</"
                   "color>、使用波波果实等各种果实变身后，可以获得对应属性加成\n\n<color='#"
                   "00ff00'>21</color>、秘言的攻击技能为无视防御的<color='#ffff"
                   "00'>固定伤害</color>，与自身物攻、魔攻都不挂钩，所以秘言适合作为辅助加点\n\n"
                   "<color='#00ff00'>22</color>、帮助公会成员完成远航装箱可获得<c"
                   "olor='#ffff00'>冒险经验</color>\n\n<color='#00ff0"
                   "0'>23</color>、上古妖魔前10次有一定几率可以获得相应等级段的<color='"
                   "#ffff00'>装备魂</color>，价值不菲\n\n<color='#00ff00'"
                   ">24</color>、悬赏任务50环完成后依然能获得<color='#ffff00'>不"
                   "菲的宠物经验</color>，是练宝宝的好去处\n\n<color='#00ff00'>2"
                   "5</color>、宠物洗髓时有一定几率获得<color='#ffff00'>变异宝宝</"
                   "color>，变异宝宝除了资质比普通宝宝高一些外，还额外会多一个技能\n\n<color="
                   "'#00ff00'>26</color>、不少UI打开后会有一个<color='#ffff"
                   "00'>“！”</color>号，点击可以查看具体功能介绍\n\n<color='#00f"
                   "f00'>27</color>、<color='#ffff00'>极寒试炼</color>"
                   "与出售<color='#ffff00'>生活技能</color>产出的道具，都是赚取银币的"
                   "好办法\n\n<color='#00ff00'>28</color>、商城图标中有一个<c"
                   "olor='#ffff00'>积分标签</color>，里面的积分可以换取各种日常所需的道"
                   "具\n\n<color='#00ff00'>29</color>、角色等级最高不可超过本服"
                   "<color='#ffff00'>世界等级+8</color>，老服世界等级比较高，新人进"
                   "去后会有<color='#ffff00'>额外的经验加成</color>\n\n<colo"
                   "r='#00ff00'>30</color>、每天晚上<color='#ffff00'>8"
                   "点~11点</color>都会有各种不同的活动，尽量多参加活动，活动收益一般比常规任务会高"
                   "出很多\n\n<color='#00ff00'>31</color>、新玩家建议在<col"
                   "or='#ffff00'>栽培之术或魔药研制</color>中选择一个学习，等级越高制作的"
                   "道具在银币市场中出售价格就越高\n\n<color='#00ff00'>32</color"
                   ">、战斗中<color='#ffff00'>长按任意目标</color>，都会弹出详细信息"
                   "和指挥操作\n\n<color='#00ff00'>33</color>、攻速差距<col"
                   "or='#ffff00'>不超过10%</color>的情况下，有一定几率会出现乱敏的情况"
                   "，攻速差距越小乱敏的几率越\n\n<color='#00ff00'>34</color>、"
                   "宠物符石和护符在宠物没有<color='#ffff00'>进阶到最后一阶</color>时"
                   "，是可以取下来的\n\n<color='#00ff00'>35</color>、宠物进到最"
                   "后一阶后，<color='#ffff00'>符石可以重置属性</color>，有一定几率获"
                   "得更高的属性和额外效果\n\n<color='#00ff00'>36</color>、翅膀"
                   "进阶或升星，<color='#ffff00'>不会改变</color>已经获得的翅膀技能\n\n"
                   "<color='#00ff00'>37</color>、彩虹冒险中每层都有<color='"
                   "#ffff00'>2~3个</color>使者，但只有<color='#ffff00'>其"
                   "中一个</color>可以成功进入下一层，留意公会其他成员分享的信息可以更快抵达12层\n\n"
                   "<color='#00ff00'>38</color>、每天通过宝图任务获得的<color"
                   "='#ffff00'>藏宝图</color>，是获得金币的最主要途径\n\n<color="
                   "'#00ff00'>39</color>、在队伍中挂机时，非队长成员游戏缩入后台最长可以<"
                   "color='#ffff00'>保持60分钟</color>在线\n\n<color='#"
                   "00ff00'>40</color>、当宠物身上<color='#ffff00'>技能少于"
                   "4个</color>时，给宠物学习技能<color='#ffff00'>有几率额外增加</"
                   "color>一个技能\n\n<color='#00ff00'>41</color>、战弓使"
                   "用技能之前<color='#ffff00'>先使用战意</color>，技能效果会大幅度提"
                   "升"),
      question =>
          [{1,
            lang:get("第1/2题,每周双倍点数周几重置"),
            [{1, "周一"}, {2, "周五"}, {3, "周六"}, {4, "周日"}],
            1},
           {2,
            lang:get("第2/2题,宠物护符和宠物属性石可以拆下来吗"),
            [{1, "可以"}, {2, "不可以"}, {3, "宠物进阶到最高阶前可以"}, {4, "看运气"}],
            3}],
      reward => [{20052, 1}, {90000, 50000}], type => 1,
      order => 1080, time => 1468598400};
get_data({1009}) ->
    #{name =>
          lang:get("<color='#249015'>【新手攻略】</color>图鉴系统玩法解析"),
      content =>
          lang:get("图鉴系统已经开启了，相信对爱好收藏的玩家，一定具有极大的诱惑。但是，这个系统还有什么特别的"
                   "作用呢？现在，小编就为你解开其神秘面纱吧~\n\n<color='#00ff00'>开启条"
                   "件</color>\n首先，当玩家到达70级时，玩家可以在游戏界面右下角看到收藏功能，打开"
                   "后将会看到的许多图鉴。玩家消耗对应的碎片，即可完成图鉴收藏。\n\n<color='#00"
                   "ff00'>收集加成</color>\n当玩家消耗一定碎片完成收藏后，图鉴将提供永久的属性"
                   "加成，并获得相应道具，道具在邮件领取哦~此外，玩家还可以继续消耗相同的碎片，为进行图鉴升星"
                   "，升级后将提供更优秀的属性加成或特效~~\n\n<color='#00ff00'>卡片组合"
                   "</color>\n如果完成特定的组合，还会提供额外的属性加成哦~看到如此强大的属性加成，"
                   "是否心动了呢！比如风火山林组合，永久加成生命70，魔攻67，对于魔导可是极大的提升哦。\n\n"
                   "<color='#00ff00'>获得途径</color>\n碎片获取主要来源：通过无尽挑"
                   "战、银币市场等方式可获得图鉴碎片，不需要的碎片可将其炼化为积分，并在图鉴商店中兑换其他图鉴"
                   "碎片。这里要提的是，如果在无尽挑战中获得一定的名次，还会额外获得碎片哦~~\n\n温馨提示"
                   "：每张图鉴的属性加成是不一样的哦，对于不同的职业，优先解锁不同的图鉴，效果可是非常明显的呢"
                   "，因此，经常和好友交流图鉴效果是非常重要的呢~"),
      question =>
          [{1,
            lang:get("第1/2题,图鉴收藏达到一定条件会提供永久属性加成"),
            [{1, "不可能"}, {2, "可能"}],
            2},
           {2,
            lang:get("第2/2题,图鉴碎片主要来源"),
            [{1, "无尽挑战"}, {2, "银币商店"}, {3, "商店兑换"}, {4, "以上都对"}],
            4}],
      reward => [{20052, 1}, {90000, 50000}], type => 1,
      order => 1090, time => 1468598400};
get_data({2001}) ->
    #{name =>
          lang:get("<color='#249015'>【职业攻略】</color>千速封兽灵完全手册"),
      content =>
          lang:get("<color='#ffff00'>推荐加点</color>：四敏一体\n\n<color="
                   "'#ffff00'>宝石优先级</color>：风灵石、红宝石、魔防石、物防石、物攻石\n\n"
                   "<color='#ffff00'>装备属性优先级</color>：敏捷、（体质或耐力）、力"
                   "量、智力\n\n<color='#ffff00'>思路</color>：\n千速兽灵讲究一"
                   "个快，要比所有人都快，堆四敏甚至五敏的目的就在于要比对面的秘言和兽灵快。快有什么好处？如果"
                   "你先手控制了对面，他当前回合出不了手，下个回合还要浪费一次出手来解控，这是两个回合的控制，"
                   "所以速度慢于对手的话，就只能控一个回合，相当于速度快使控制能力翻倍！\n\n<color="
                   "'#ffff00'>装备宝石</color>方面的思路就很简单了，有速度加速度，没速度加血"
                   "和防。两种防御的选择，法防优先于物防。为什么，因为兽灵会更频繁地受到法术伤害。一般来说，物"
                   "理攻击更多的是单体点杀技能，而兽灵天生没什么人愿意点你，另一方面法术技能多为群体技能，一个"
                   "群法技能砸下来，能避开都是运气，所以法术防御对兽灵来说更为重要。\n\n\n冒险技能，优先"
                   "攻法修炼，靠控制吃饭，不点不行，建议点满。第二点攻法指挥，兽灵缺少输出，攻法指挥可以整体提"
                   "升守护和宠物输出，对平时的pve比较重要。第三点魔抗修炼，有没有发现，守护和人物在挂自动放"
                   "控制技能的时候，目标选择是有优先级的，秘言和兽灵会被优先控制，所以控制抵抗也比较重要，关键"
                   "一点，除了石头人和速度比你还快的宠物，没人能帮你解控，因为速度比你慢的队友就算帮你解控了，"
                   "你也错过了出手时机。\n\n<color='#ffff00'>宠物选择</color>：\n"
                   "推荐选择单体暴力宠物如55狼、65虎、75剑灵。兽灵自身缺乏输出，而守护的攻击比较随性，不"
                   "能有意识地集火目标，竞技场等单人活动会比较辛苦，所以我们需要一只暴力的单攻宠物，将主要的输"
                   "出集中在一点，快速撕开对方的阵型。\n除了攻击型的技能，单攻宠物推荐加上一个生存型的技能，"
                   "如高级隐身、高级保命。单攻宠一般走5力或4力1敏加点，自身比较脆，关键时刻能出个保命还是不"
                   "错的，有兽灵嘲讽住对面的输出单位，就是残血的宠物也有机会活下来。\n暴力单攻是单人活动带的"
                   "，段位赛和公会战等多人活动带的宠物就灵活多变了，主要看阵容和队友配合。\n\n<color"
                   "='#ffff00'>各个等级段值得入手的宠物</color>：\n首充云露，各方面表现优"
                   "异，自带法连，打个群体法术能带到55级。\n45雪狐，自带群法，攻击生存能力都不俗，人手必"
                   "备的群攻法宠。\n45犀牛，自带闪现隐身涅槃，关键时刻跳出来非常感人！\n55狼，第一只值"
                   "得培养的单攻宠物。\n55人鱼，秘术很牛，群攻群控。\n55森林巨人，自带高必，洗出好属性"
                   "也可以当暴力单攻，省钱～\n65老虎，善恶一时爽～\n65炎魔，秘术很牛，天生的龟速守尸王"
                   "！\n75剑灵，被老虎的善恶坑多了就知道舍身多好了！\n75雷暴，没得说，赶潮流也得弄一只"
                   "。控制好对面的情况下可以稳定压血。\n75石头人，星辰第一辅助宠，光速解控的秘术，全星辰仅"
                   "此一家。\n85雷霆战神，破甲加电击棒，你想到了什么？"),
      question =>
          [{1,
            lang:get("第1/2题,冒险技能中的攻法修炼，对兽灵职业最重要的帮助是"),
            [{1, "提高控制成功率"},
             {2, "提高宠物伤害"},
             {3, "提高守护伤害"},
             {4, "提高人物伤害"}],
            1},
           {2,
            lang:get("第2/2题,冒险技能攻法指挥的作用是"),
            [{1, "提高守护伤害"},
             {2, "提高宠物伤害"},
             {3, "提高控制成功率"},
             {4, "以上都对"}],
            4}],
      reward => [{20052, 1}, {90000, 50000}], type => 2,
      order => 2010, time => 1468598400};
get_data({2002}) ->
    #{name =>
          lang:get("<color='#249015'>【职业攻略】</color>秘言不完全攻略"),
      content =>
          lang:get("<color='#00ff00'>【加点方式】</color>\n如果非要个标准应该是3敏"
                   "1体1耐。其实最好根据自身打造出来的装备属性而定，比如说你装备大多都是敏捷，那咱手动加点的"
                   "时候可以多加点气血。3到4敏的加点方式能让你装备的可选择性更大一些。\n装备属性<colo"
                   "r='#ffff00'>体、耐、敏</color>都可以，智力和力量统统不要。\n既然说到"
                   "装备了，下面说下秘言的装备：\n\n<color='#00ff00'>【装备洗炼】</co"
                   "lor>\n打造的时候咱们要先点开预览。主要看<color='#ffff00'>治疗加强<"
                   "/color>的上限来选择而不是看附加的敏捷属性（附加属性可以洗）。比如70装备治疗加强上"
                   "限是1116，最低是850。不要小看这200多点的差距，这里相当于一个十级的治疗宝石了。\n"
                   "秘言主要注意的几件装备属性：<color='#ffff00'>武器（治疗加强）戒指（控制抵"
                   "抗）手镯（控制加强）腰带（气血上限）</color>。\n\n<color='#00ff0"
                   "0'>【装备特效】</color>\n\n<color='#ffff00'>武器和戒指</"
                   "color>\n可以洗<color='#ffff00'>元素结界、回魂祷言、生命赞美诗</"
                   "color>。一个是减少封人的技能冷却一回合，一个是多奶一个人。生命赞美是被赞美对象身上叠"
                   "一个保命buff，绝对团战神器，强烈推荐。（元素点燃也能凑合用用。）\n\n<color="
                   "'#ffff00'>手镯和腰带</color>\n手镯的话首选<color='#ffff0"
                   "0'>通天</color>手镯，控制率增加3%。自从有了通天手镯感觉自己脸白了不少。但是毕"
                   "竟封系你懂的。腰带首选是指挥腰带。秘言这种辅助职业太需要依靠宠物的输出了。指挥腰带前八回合"
                   "增加宝宝10%的输出。相当于多了一本高偷袭。非常给力。\n\n<color='#ffff0"
                   "0'>衣服和鞋子</color>\n衣服出<color='#ffff00'>神佑</col"
                   "or>，感觉不用刻意去洗。反正这么多场PK下来神佑几率不高。鞋子<color='#ffff"
                   "00'>疾速</color>，帮会里有两个疾速鞋的秘言出手特别快。但是要实在洗不出，咱加点"
                   "的时候多加些敏捷也是可以的嘛。主要出手快不代表就能封住。\n\n<color='#00ff"
                   "00'>【冒险经验优先顺序】</color>\n如果想要PK的话，攻法必须是优先点满的。人"
                   "物攻法>宠物伙伴攻法>人物魔抗>宠物伙伴魔抗，最后才是物理防御。当然，全部都满修自然是最好"
                   "的。\n\n<color='#ffff00'>宠物的选择</color>\n首选是<col"
                   "or='#ffff00'>法宠</color>，因为法宠的整体伤害想对点杀的宝宝来说要强一"
                   "些。充钱的玩家可以去弄糖糖。（或者非主流一点弄个猴子当法宠也是可以的，把法资用资质上限丹吃"
                   "上去绝壁不比糖糖差）不充钱至少也要<color='#ffff00'>狐狸炎魔</color"
                   ">什么的。\n建议大家的法宠不管是糖糖还是狐狸炎魔，打技能的时候上一个<color='#f"
                   "fff00'>高级幸运</color>。便宜实惠，效果谁用谁知道。其实无论竞技场也好，平时"
                   "PK也好，打上高幸运之后对面想秒你的宝宝基本上很难。然后加点方式是全智力，符石的话两个智力"
                   "一个生命吧。这样生存能力强一些。输出也够。当然团战的话宠物还是要多准备两只。一只候补输出一"
                   "只闪现高隐负责拉药。\n\n<color='#ffff00'>竞技伙伴搭配</color>\n"
                   "40、50级那些就不说了，都是过渡用的，不必刻意去弄。<color='#ffff00'>基"
                   "本配置</color>：露露、熔岩巨人（九尾狐狸）、阿瑞斯、福波斯；加<color='#f"
                   "fff00'>强版本</color>：熔岩巨人、九尾狐、福波斯、莉娜；防御阵型开山阵。\n\n"
                   "<color='#ffff00'>伙伴属性及宝石</color>\n熔岩跟狐狸个人偏向于体"
                   "耐，提高生存能力。九尾狐狸是秘言，熔岩巨人是兽灵。两个都是辅助。当然喜欢弄成高速的伙伴也是"
                   "可以的，要保证小伙伴的生存能力。至于阿瑞斯和福波斯这些输出型伙伴，装备属性无非就力量和智力"
                   "。\n\n<color='#ffff00'>结尾福利：关于秘言竞技场的小秘诀分享</col"
                   "or>\n秘言打竞技场一般带法宝宝，如果对手是法宠的，先点着对方的奶妈群，死了就守尸体。如"
                   "果是点杀宝宝，优先秒宝宝。至于先手封哪个？一般都是先手封宠物，尤其是对手带点杀宝宝的情况下"
                   "。如果对方带的是法宠，那要衡量一下法宠的输出和莉娜的输出然后再决定是否封宝宝。\n\n以上"
                   "都是小编玩秘言的个人心得体会，仅供各位看官参考。最后祝各位秘言竞技夺魁！ "),
      question =>
          [{1,
            lang:get("第1/2题,装备特效中，手镯哪个特效可以提高控制成功率"),
            [{1, "通天"}, {2, "强化"}, {3, "幸运"}, {4, "穿透"}],
            1},
           {2,
            lang:get("第2/2题,装备腰带特效中，指挥的效果是"),
            [{1, "人物伤害提高10%"},
             {2, "宠物伤害提高10%"},
             {3, "守护伤害提高10%"},
             {4, "以上都对"}],
            2}],
      reward => [{20052, 1}, {90000, 50000}], type => 2,
      order => 2020, time => 1468598400};
get_data({2003}) ->
    #{name =>
          lang:get("<color='#249015'>【职业攻略】</color>兽灵PK、加点全解析"),
      content =>
          lang:get("兽灵是个多样化的职业，可攻，可守，可辅助，其实培养得好，真的可以很强大的！今天我给大家主要"
                   "讲解下辅助流的兽灵。\n\n<color='#00ff00'>【四大技能】</color>\n"
                   "首先，看看兽灵四个辅助技能：\n\n<color='#ffff00'>幻灵怒雷</colo"
                   "r>：这个技能可以令敌方一个单位陷入<color='#ffff00'>混乱</color>"
                   "状态，不分敌我的普通攻击，持续<color='#ffff00'>三回合</color>，前"
                   "置冷却两回合。\n\n<color='#ffff00'>龟之怒吼</color>：<col"
                   "or='#ffff00'>嘲讽</color>两名敌方，吸引对方的出手，同时降低自身受到伤"
                   "害的20%，持续<color='#ffff00'>两回合</color>。（若出手慢于对方"
                   "，嘲讽持续回合+1，若速度比秘言快，对秘言释放持续回合-1）\n\n<color='#ff"
                   "ff00'>龙威破甲</color>：<color='#ffff00'>加深</color"
                   ">目标受到的伤害（物理伤害魔法伤害都增加），持续<color='#ffff00'>三回合<"
                   "/color>。\n\n<color='#ffff00'>兽王守护</color>：降低队"
                   "友35%受到的伤害，并有较大几率在受到致命伤的时候恢复20%的生命值。（释放这个技能第一个"
                   "出手）\n\n<color='#00ff00'>【加点方式】</color>\n\n<co"
                   "lor='#ffff00'>2敏2耐1体</color>或者<color='#ffff00"
                   "'>2敏2体1耐</color>\n优点：这个加点方式是速度与防御并存，可以先手于对面职业"
                   "进行控制，能扛得住对面的集火输出。\n缺点：不能及时的制止秘言的加血与复活，容易被翻盘（推"
                   "荐平民玩家及半人民币玩家）。\n\n<color='#ffff00'>3敏1体1耐</co"
                   "lor>\n优点：拥有绝对的速度优势，能制止对面秘言的、封印、buff、加血、以及复活。\n"
                   "缺点：皮太脆，不容易站住脚。（推荐土豪玩家）\n\n<color='#ffff00'>2体"
                   "2耐1敏</color>、<color='#ffff00'>3体2耐</color>、<c"
                   "olor='#ffff00'>2体3耐</color>\n优点：皮厚，抗击打\n缺点：速度"
                   "慢，不能有效的支援队友、克制敌方\n\n<color='#00ff00'>【PVP技能释放"
                   "】</color>\n\n<color='#ffff00'>龟之怒吼</color>：能有"
                   "效的制止对面输出职业对队友以及宝宝进行集火。（建议对狂剑或弓手使用）\n\n<color="
                   "'#ffff00'>龙威破甲</color>：能能加敌方受到的伤害。（建议对秘言使用）\n\n"
                   "<color='#ffff00'>幻灵怒雷</color>：能使对面无目标的普通攻击三回合"
                   "。（建议对秘言使用）\n接下来你就可以快乐的打酱油了！哈哈！总而言之，兽灵是个非常强大的职"
                   "业，PVP利器。壮哉我大兽灵！"),
      question =>
          [{1,
            lang:get("第1/2题,兽灵职业技能有哪些效果"),
            [{1, "控制"}, {2, "伤害加深"}, {3, "伤害降低"}, {4, "以上都对"}],
            4},
           {2,
            lang:get("第2/2题,兽灵技能龟之怒吼的混乱效果是"),
            [{1, "不分敌我普通攻击"}, {2, "不分敌我技能攻击"}],
            1}],
      reward => [{20052, 1}, {90000, 50000}], type => 2,
      order => 2030, time => 1468598400};
get_data({3001}) ->
    #{name =>
          lang:get("<color='#249015'>【宠物攻略】</color>全面解析宠物洗髓"),
      content =>
          lang:get("首先要普及一点，宠物属性主要通过<color='#ffff00'>升级、加点和符石技能</"
                   "color>三大部分来提升，而升级提升的属性主要与<color='#ffff00'>宠物资"
                   "质</color>挂钩，加点提升的属性主要与<color='#ffff00'>宠物成长</"
                   "color>挂钩\n\n<color='#00ff00'>一、宠物资质</color>\n\n"
                   "1)不同的宠物资质会影响宠物升级提升的对应宠物属性，例如：物攻资质会影响每升一级宠物加成的"
                   "物攻属性\n\n2)每个宠物的资质范围不一样，具体可在图鉴查看。以霜狼为例：\n\n霜狼的"
                   "物攻资质范围为<color='#ffff00'>1208~1510</color>，也就是"
                   "说洗髓的时候，洗出的霜狼宝宝的攻资在1208~1510这个范围内波动。但是洗出变异的话，是"
                   "可以超出这个范围的，因此<color='#ffff00'>变异霜狼</color>甚至有可"
                   "能到达1540攻资\n\n<color='#00ff00'>二、宠物成长</color>\n\n"
                   "1)、宠物的成长率主要影响<color='#ffff00'>每一点潜能</color>增加"
                   "的属性，如霜狼<color='#ffff00'>20点力量</color>在紫色成长时增加"
                   "<color='#ffff00'>70.4物攻</color>，红爪可以增加<color="
                   "'#ffff00'>74.5物攻</color>，可以想象当霜狼升到60级时，物攻差距会很"
                   "明显\n\n2)、图鉴显示的宠物能到达最高的宠物成长，如霜狼显示为<color='#fff"
                   "f00'>红爪1.86</color>，洗髓的时候宠物成长会在<color='#ffff0"
                   "0'>红、橙、紫、蓝</color>四种颜色中随机，其中红色最好哦\n\n<color='"
                   "#00ff00'>三、宠物技能</color>\n\n1）每种宠物自带的技能和技能数量不同"
                   "，洗髓可以随机获得技能（详情查看图鉴即可）如55级霜狼自带技能“<color='#ffff"
                   "00'>高级连击、高级偷袭、暴戾、保命</color>”，那洗髓的时候，霜狼宝宝最高能洗出"
                   "这4个技能\n\n2）变异：如果宠物变异的话，技能数量将会是 “原有技能数量+1”。如<c"
                   "olor='#ffff00'>变异霜狼</color>最高可以洗出5技能（6技能雷暴+进阶"
                   "2次+双技能护符=10技能！神宠不是梦！）\n\n<color='#00ff00'>四、洗"
                   "髓技巧</color>\n\n洗宠主要看该宠物的<color='#ffff00'>关键资质"
                   "</color>和<color='#ffff00'>技能数</color> "
                   "，还是以霜狼宝宝为例，就主要看最核心的<color='#ffff00'>物攻资质</col"
                   "or> ，技能的话虽说是尽量多，但也不强求，如果不够也可以<color='#ffff00'"
                   ">通过技能书</color>学习获得\n\n至于成长，如果关键资质足够好，成长稍微低一点都"
                   "是可以接受的，比如红色与橙色成长，所带来的属性加成差距不会太大，还是可以接受的。如果资质、"
                   "技能数量都不错，那么蓝爪成长也不是不可以哦！\n\n至于资质爆表、红爪、5/6技能的变异难"
                   "求！所以宠物洗髓一定要节制！节制！节制！知足常乐，开心游戏才是王道{face_1,52}\n\n"
                   "最后给大家分享个小技巧——如果洗出一只还算满意的宠，就拿霜狼为例，物攻资质1500、拥有3"
                   "~4个技能、紫色成长，那么如果还想追求<color='#ffff00'>更极品的宠物</c"
                   "olor>，不妨到银币市场再买一只<color='#ffff00'>野生宠物</color"
                   ">来洗，这样即使最终没洗出来，也有可以用的宠物啦，是不是很聪明{face_1,15}"),
      question =>
          [{1,
            lang:get("第1/2题, 宠物洗髓时，宠物成长什么颜色最佳"),
            [{1, "红色"}, {2, "紫色"}, {3, "橙色"}, {4, "蓝色"}],
            1},
           {2,
            lang:get("第2/2题,变异宠物与普通宠物有什么区别"),
            [{1, "资质上限"}, {2, "原有技能数量上限"}, {3, "外观"}, {4, "以上都对"}],
            4}],
      reward => [{20052, 1}, {90000, 50000}], type => 3,
      order => 3010, time => 1468598400};
get_data({3002}) ->
    #{name =>
          lang:get("<color='#249015'>【宠物攻略】</color>平民神宠打造完全攻略"),
      content =>
          lang:get("宠物在游戏占据非常重要的位置，宠物可以补全角色所缺乏的那一部分，比如你的是法师，有控制有输"
                   "出，但是身板弱，那么宠物这个时候就可以扮演前排作为肉盾的存在。当然，这要视乎你需要怎样的宠"
                   "物，那么问题来了，宠物那么多，怎么选择和培养才是最好的呢，下面给大家介绍一下，平民怎么打造"
                   "宠物，让你可以直视土豪！\n\n<color='#00ff00'>【选择最适合你的宠物】<"
                   "/color>\n首先当然是选择宠物，宠物基本分三种：<color='#ffff00'>物"
                   "宠、法宠、血宠</color>。不同的宠物拥有不同的效果，刷野怪以及pk所用的宠物也是不一"
                   "样的。下面我来简单介绍一下不同宠的效果吧！<color='#ffff00'>物宠</col"
                   "or>：以追求极限的单体输出为目的宠物。<color='#ffff00'>血宠</colo"
                   "r>：为玩家分担伤害，提供玩家保护，给敌方单位提供负面buf。<color='#ffff0"
                   "0'>法宠</color>：以群群体AOE伤害为最终目的，大面积覆盖性打击，伤害值总和会大"
                   "大的强于物宠。\n宠物除了补全角色缺点外，也可以视乎你自己性格来培养，比如你喜欢PK，那么"
                   "物宠就很适合你。\n\n<color='#00ff00'>【没有神兽 那就后天打造一只】<"
                   "/color>\n神兽谁都想要，但是要出来并不容易，既然没有，那么我们自己制造一只吧！当你"
                   "获得宠物后，如果宠物的资质或者成长太挫的话，那么可以通过消耗一定数量的<color='#f"
                   "fff00'>星辰精华进行洗髓</color>。洗髓可以<color='#ffff00'>"
                   "重置宠物的资质、成长率以及技能</color>。宠物资质上限以及宠物成长率是无法通过其他物"
                   "品进行提升的。宠物的资质上限以及成长越高宠物越强。\n\n宠物洗髓最重要的当然是资质了，资"
                   "质在你的理想范围后再去选择技能格子。<color='#ffff00'>优先追求高资质，技能"
                   "格子可以靠打书顶出4个</color>。至于洗髓丹，在游戏中获取的渠道很多，也可以每天看看"
                   "市场价格，一旦下滑立刻出手！不过最好还是通过任务，宝图，签到来获得，轻松嘛~\n\n<co"
                   "lor='#00ff00'>【有了资质补个技能就成神了】</color>\n宠物书籍千千万"
                   "，盲目的打书只会毒害自己的腰包毒害自己的宠物。小编在这里给大家讲解一下非特技宠物如何正确的"
                   "选择技能。\n\n<color='#ffff00'>物宠篇</color>\n技能梯队一："
                   "连击、必杀、暴虐、穿透、隐身\n技能梯队二：偷袭、强力、追击、狂暴追击\n技能梯队三：保命"
                   "、神佑、鬼魂术、驱鬼\n\n<color='#ffff00'>法宠篇</color>\n技"
                   "能梯队一：群法、法术连击、法术暴击、精通、暴虐\n技能梯队二：魔法反击、感知、审判、驱鬼\n"
                   "技能梯队三：保命、神佑、鬼魂术\n\n<color='#ffff00'>血宠篇</colo"
                   "r>\n技能梯队一：护主、强壮、反震、神佑、涅槃\n技能梯队二：连击、静魂、恐怖、破魔、封"
                   "心\n技能梯队三：冲击、流血、秘吟决、祝福\n技能书是让你的宠物更完美的一个环节，你想要什"
                   "么类型的宠物就打什么书吧，不缺少输出就打生存的，但是要注意的是，打书有可能会覆盖你原来的技"
                   "能哦·~而技能书来源也很广，宝图，副本，市场都可以轻松获得。\n\n通过洗髓和打书，宠物基"
                   "本成型了，剩下的就是进阶和升级了。平民打造宠物方法就先介绍到这里了~"),
      question =>
          [{1,
            lang:get("第1/2题,星辰精华洗髓宠物可以改变"),
            [{1, "资质"}, {2, "技能"}, {3, "成长率"}, {4, "以上都对"}],
            4},
           {2,
            lang:get("第2/2题,宠物技能书的获得方式"),
            [{1, "藏宝图"}, {2, "副本"}, {3, "商城与市场"}, {4, "以上都对"}],
            4}],
      reward => [{20052, 1}, {90000, 50000}], type => 3,
      order => 3020, time => 1468598400};
get_data({3003}) ->
    #{name =>
          lang:get("<color='#249015'>【宠物攻略】</color>平民打书必知"),
      content =>
          lang:get("目前很多玩家不太理解追击、连击、狂暴追击之间的差别和触发优先级，还有部分玩家对于一只宠物身"
                   "上同时存在低级和高级技能（如：神佑和高级神佑），或两个高级技能（如：高级神佑和高级神佑）的"
                   "时候，效果是否叠加也不清楚，今天天使飞猪老师就来给大家详细说明一下哦~\n\n<color"
                   "='#00ff00'>同时存在低级和高级技能，或两个高级技能</color>\n\n<co"
                   "lor='#ffff00'>原因解析</color>\n1、宠物通过打书可以同时存在同一类"
                   "型的低级技能和高级技能，比如宠物已有神佑，通过打书可以打上高级神佑。\n2、通过打书，不能"
                   "同时存在两个一样的低级技能，或者两个一样的高级技能。如果宠物已经有高级技能，佩戴护符还是可"
                   "以再加一个高级技能。\n\n<color='#ffff00'>效果解析</color>\n"
                   "如果宠物身上有两个同一类型的技能，不管是两个低级，两个高级，还是一个低级和一个高级，都<c"
                   "olor='#ffff00'>只有一个等级高的生效</color>。例如雷暴身上有个高级法"
                   "术暴击技能，太阳护符上还有个高级法术暴击技能，那么雷暴的暴击率仍然是30%，而不是叠加的6"
                   "0%。同理如果雷暴有一个法术暴击技能和一个高级法术暴击技能，那么雷暴的暴击率仍然是30%（"
                   "取高级技能的效果）。\n\n<color='#00ff00'>连击、追击、狂暴追击的触发优"
                   "先级</color>\n由于上面介绍过了低级技能和高级技能的情况，下面我们就都以低级技能为"
                   "例来说明。\n1、当怪物被一次击打死亡时，最优先触发追击，不会再触发连击和狂暴追击\n2、"
                   "当一次没打死且有其余敌方目标存在时，连击若触发，则为最优先级触发效果，第一下暴击仍将继续连"
                   "击第二下，若第二下没暴击则不会触发狂暴追击。无论第一下是否暴击，第二下暴击则必定触发狂暴追"
                   "击。\n根据以上关系可以得出优先级：追击>连击>狂暴追击。\nPs：若宠物与坐骑签订了连环"
                   "击契约，仍然不影响第二次连击触发的暴击和狂暴追击效果，也就是第二下或者第三下若出暴击，会打"
                   "完3次才进行狂暴追击；美猴王天赋技能腾云驾雾无论第一还是第二下暴击都可以触发狂暴追击，但是"
                   "不享受坐骑连击加成。\n\n<color='#00ff00'>神佑、保命、鬼魂术的触发优先"
                   "级</color>\n1、如果宠物同时拥有神佑、保命、鬼魂术三个技能，只有鬼魂术会生效，其"
                   "他两个技能无效。\n2、如果宠物同时拥有神佑和保命，只有神佑会生效，即使没有触发神佑，也不"
                   "会触发保命。\n3、如果宠物拥有鬼魂术，死亡以后有其他宠物闪现出来，那么鬼魂术会失效。"),
      question =>
          [{1,
            lang:get("第1/2题,法术暴击和高级法术暴击效果是否叠加"),
            [{1, "叠加"}, {2, "不叠加"}],
            2},
           {2,
            lang:get("第2/2题,追击、连击和狂暴追击，触发优先级最高"),
            [{1, "追击"}, {2, "连击"}, {3, "狂暴追击"}, {4, "以上都对"}],
            1}],
      reward => [{20052, 1}, {90000, 50000}], type => 3,
      order => 3030, time => 1468598400};
get_data({4001}) ->
    #{name =>
          lang:get("<color='#249015'>【任务攻略】</color>日常任务全解析"),
      content =>
          lang:get("<color='#00ff00'>【悬赏任务】（组队）,推荐指数：★★★★★</color"
                   ">\n悬赏任务是每日必做任务，可快速升级。5人组队日常任务，队员需要有一个秘言或者兽灵来赶"
                   "走狐狸，前期到了20级，跟着队伍做满当天50次就可以到达40-43级。<color='#f"
                   "fff00'>队伍配置</color>：秘言/兽灵(可以赶走一只怪物)+一个新手等级（新手"
                   "等级48以下，可以赶走一只怪）+其他职业\n\n<color='#00ff00'>【职业任"
                   "务】（单人）,推荐指数：★★★★★</color>\n职业任务为20个，10个为一轮。经验"
                   "奖励丰富，同时做完20个有<color='#ffff00'>3000金币</color>和"
                   "2个公会资金徽章（徽章可以增加公会资金同个人贡献）\n\n<color='#00ff00'"
                   ">【极寒试炼】（单人）,推荐指数：★★★★★</color>\n极寒试炼是获得游戏<col"
                   "or='#ffff00'>银币最多</color>的任务。每日1次，6个怪。全程杀完银币数"
                   "量大概在90万-100万。银币用途很多，比如为守护升级装备、上宝石、帮人物宠物点修炼等。\n\n"
                   "<color='#00ff00'>【宝图任务】（单人）,推荐指数：★★★★★</color"
                   ">\n宝图任务每日获得上限是10张。10次为一轮，绝对有必要做完。挖东西换金币！（如你是一"
                   "位伟大的壕，可以无视这任务）任务很方便，只需要拿了第1次，后面9次会<color='#ff"
                   "ff00'>自动完成</color>。(人品好1次一张，人品有些差时4次一张)\n\n<c"
                   "olor='#00ff00'>【远航商人】（单人）,推荐指数：★★★</color>\n这"
                   "日常任务奖励增加<color='#ffff00'>冒险技能</color>和人物经验。每次"
                   "需要上缴8个不同物品，完成后会有2本200经验冒险书，推荐3星原因是个人觉的这个任务太耗银"
                   "币。\n\n<color='#00ff00'>【公会任务】（单人）,推荐指数：★★★★★<"
                   "/color>\n公会任务每日只有一轮，5次。做完将获得贡献。<color='#ffff0"
                   "0'>生活技能</color>到达30级后都需要消耗一定贡献来学习。\n\n<color="
                   "'#00ff00'>【竞技场】（单人）,推荐指数：★★</color>\n竞技场每日有10"
                   "次挑战机会，赢1次会获得12积分，输一次也会获得6积分。通常当日挑战到第6次后就会遇上一定"
                   "难度。\n\n<color='#00ff00'>【挑战BOSS】（组队）,推荐指数：★★★"
                   "★</color>\nBoss每日奖励次数2次。boss分为4个：第1个boss挑战等级要"
                   "到40；第2个挑战等级50；第3个挑战等级60；第4个挑战等级70；当等级高于boss时候"
                   "，也可以挑战。个人觉得如就为了奖励，就可以2次都挑战40级boss。\n\n<color="
                   "'#00ff00'>【上古妖魔】（组队）,推荐指数：★★★★★</color>\n上古妖魔"
                   "次数其实是20次。上古妖魔奖励是<color='#ffff00'>魂石</color>。魂"
                   "石用来为<color='#ffff00'>装备提升等级</color>，也可以用来卖金币。"
                   "第21次后经验奖励降低100%没有奖励魂石奖励。\n\n<color='#00ff00'>"
                   "【情缘任务】（双人）,推荐指数：★★★</color>\n情缘任务可以带上你好基友或你的异"
                   "性朋友来做，夫妻一起做的话会获得恩爱值，<color='#ffff00'>恩爱值</col"
                   "or>可换取物品。\n\n<color='#00ff00'>【历练环任务】（单人）,推荐指"
                   "数：★★★★★</color>\n一周1次，次数为100，200时候会有奖励，奖励物品不定"
                   "。如人品爆发奖励你<color='#ffff00'>太阳护符</color>那你就发了~双"
                   "高技能等着你为宠物佩戴！\n\n<color='#00ff00'>【天空之塔】（组队）,推"
                   "荐指数：★★★★★</color>\n奖励丰富，下面说下一、二层BOSS的特点：\n\n<"
                   "color='#ffff00'>利贝尔二世</color>：怪物数量5只，需要10回合内战"
                   "斗完毕。主怪第3回合会开启一个护盾，受多少伤就会反弹多少伤害给输出者，护盾维持2回合。\n\n"
                   "<color='#ffff00'>狼王</color>：怪物数量5只，主怪会指挥攻击。第一"
                   "次指挥左边狼加血，第二回合右边狼输出，加血血量大概在8000左右。\n\n<color='"
                   "#ffff00'>火精灵</color>：会召唤小怪，最多召唤5个。需要同时击杀火精灵与水"
                   "精灵，不然会互相复活，2个精灵都可以封印。\n\n<color='#ffff00'>祸乱<"
                   "/color>：这个boss首先需要清理主怪左右2边的怪(到一定血量会隐身避免伤害)，不然"
                   "会复活前面的怪。前面的怪不需要理会，后面的怪死亡后会逃走。\n\n<color='#fff"
                   "f00'>巴恩</color>：怪物数量5只，这里需要注意的是：主怪指定那个人物或者宠物，"
                   "下一回合必会攻击(秒杀)，可以用保护来分担伤害，但对面的龙龟会为主增加一个护盾吸收伤害，可"
                   "以先控制龙龟，避免增加战斗回合数来完成。\n\n<color='#ffff00'>守望者<"
                   "/color>：主怪到一定血量会放一个群体冰封技能，该技能大概2-4回合，所以主怪前面3只"
                   "未死完，在没一定伤害前提下先同时击杀前面3只怪。\n\n<color='#ffff00'>"
                   "祖拉</color>：集火主怪。主怪会召唤4个蛋，其中1个蛋会为我们集团回血，其他3个蛋会"
                   "对我们输出。第2或者第3回合会扔群体中毒技能和群体击晕技能。\n\n<color='#ff"
                   "ff00'>红角大王</color>：当第2个大王血量降低后会抢红角大王护盾，那时候就可以"
                   "对红色大王输出，那个抢护盾的大王下回合护盾自动消失。\n\n<color='#ffff00"
                   "'>森罗</color>：这里绝对需要一个秘言。第1回合控制对面封印怪，清理花莹造型的怪，"
                   "到第4回合时候花莹造型的怪基本死亡，那秘言需要控制主怪，不然主怪会复活而死亡的怪。\n\n"
                   "<color='#ffff00'>复仇之灵</color>：必备秘言。会有5个怪：狐狸、老"
                   "鼠、剑灵、炎魔、人鱼精灵。5个怪死亡后都会复活1次（如宠物有高驱鬼技能，以100%驱走战场"
                   "，低级驱鬼技能也可以，但概率较低。另外审判应该也以，因为个人护符没有也没有合适的宠需要打，"
                   "所以没有试验过），狐狸、老鼠为群体伤害，优先击杀一个，秘言控制其中1个，人鱼为治疗怪，炎魔"
                   "/剑灵单体技能。\n\n以上为个人经验总结，希望能帮助到前期65级的朋友。"),
      question =>
          [{1,
            lang:get("第1/2题,历练环任务有没有可能获得太阳护符"),
            [{1, "有"}, {2, "没有"}],
            1},
           {2,
            lang:get("第2/2题,上古妖魔获得的装备魂石的用途"),
            [{1, "提升人物装备"},
             {2, "提升守护装备"},
             {3, "提升宠物属性"},
             {4, "提升翅膀"}],
            1}],
      reward => [{20052, 1}, {90000, 50000}], type => 4,
      order => 4010, time => 1468598400};
get_data({4002}) ->
    #{name =>
          lang:get("<color='#249015'>【天空之塔】</color>天空之塔第一层通关攻略"),
      content =>
          lang:get("\n想要获得星月石、宠物技能书和翅膀灵羽等珍贵道具，就一定要参加天空之塔！但是在等级不高的"
                   "情况下天空之塔通关可不是那么容易的哟！想要成功通关，除了要队伍上配置好，还要了解不同关卡的"
                   "打发！\n\n今天就来跟大家说一下天空之塔第一层通关攻略！\n\n<color='#fff"
                   "f00'>【队伍配置】</color>\n\n首先队伍的配置一定越平均越好！游戏内大部分玩"
                   "法都是这样，五个不同的职业配合起来才是最强大的阵容。当然，就像《饮食男女》里的台词：生活不"
                   "像做菜，我不能等把所有食材准备好了再下锅。我们实际玩游戏的时候不大可能会刻意去凑齐5个职业"
                   "再去挑战天空之塔。那么在实际情况下，我们至少应该保证队伍里有一位秘言、三位输出职业，输出职"
                   "业可以是狂剑、魔导、战弓。\n\n<color='#ffff00'>【第一关：幽冥狼王】<"
                   "/color>\n\n第一关还算比较容易打的，左边的幽狼会大量回血，右边的冥狼会陨落星群，"
                   "输出比较高。结合队伍实际情况，有控制的情况下可以控住冥狼，先杀幽狼后杀冥狼。没有控制的情况"
                   "下推荐优先击杀冥狼。毕竟新手队伍扛不住几波陨落星群。\n\n<color='#ffff00"
                   "'>【第二关：利贝尔二世】</color>\n\n这一关进去需要要注意一点，优先集火辅助类"
                   "职业禁卫军统领。因为他会使用各种辅助类的技能会对通关带来很大的影响需要优先打掉。然后选择清"
                   "除小怪。最后击杀boss。需要注意的是，这一关的boss在开启了盾之后，受到的伤害会反震一"
                   "半伤害到玩家身上。建议是boss开启盾的时候打小怪或手动防御，没有盾的状态下打boss。\n\n"
                   "<color='#ffff00'>【第三关：火精灵】</color>\n\n这一关难度不高"
                   "，怪物的输出不高，精灵会召唤波波球，进行助战。水精灵血量低的时候会停止补血，推荐优先把它的"
                   "血量压低。接着压低火精灵血量，血量差不多的时候请全力输出，一齐击杀两个精灵。如果只杀掉其中"
                   "一个，她们就会无限地相互复活。\n\n<color='#ffff00'>【第四关：祸乱】<"
                   "/color>\n\n这一关只要知道一个要点优先清除监工，控制好苦力就能轻松通关。因为主要"
                   "的输出都在苦力身上，而苦力死了它背后的监工会把它复活起来，所以打了也没用，必须先杀掉背后的"
                   "监工。"),
      question =>
          [{1,
            lang:get("第1/2题,火精灵关卡的通关难点是"),
            [{1, "舍不得下手"},
             {2, "需同时击杀"},
             {3, "助战太多"},
             {4, "BOSS有秒杀技能"}],
            2},
           {2,
            lang:get("第2/2题,祸乱关卡通关要点是"),
            [{1, "监工会复活苦力"},
             {2, "苦力输出高"},
             {3, "优先清除监工"},
             {4, "以上都对"}],
            4}],
      reward => [{20052, 1}, {90000, 50000}], type => 4,
      order => 4020, time => 1468598400};
get_data({4003}) ->
    #{name =>
          lang:get("<color='#249015'>【爵位挑战】</color>爵位挑战全攻略"),
      content =>
          lang:get("\n爵位挑战有着丰厚的奖励和荣耀称号！通过爵位挑战，玩家可以真正了解到自己的实力！\n\n"
                   "爵位挑战随着等级的提升，难度也会越来越大！一夏就详细说一下不同关卡的通关打法！\n\n<c"
                   "olor='#ffff00'>【第一关·暗夜&暗夜之眼】</color>\n这一关的特点是"
                   "，暗夜之眼每个回合会标记一个单位，下个回合暗夜将直接秒杀被标记的单位！血再多防再高也是没有"
                   "用的，手动防御也是没用的。怎么办？等死？其实还是有办法避免被秒的，那就是保护！选择保护被标"
                   "记的单位即可为其分摊伤害，避免被秒杀。保护好被标记的单位，集火击杀暗夜之眼，暗夜之眼一死，"
                   "暗夜就瞎了任人宰割。\n\n<color='#ffff00'>【第二关·职业怪】</col"
                   "or>\n这里的怪比较猛，狂剑的风暴连斩和战弓的陨落星群是没有CD的，休息完就放。这一关的"
                   "控制相当重要，推荐带凯恩、佛格瑞特、利贝尔二世或姬这类控制系守护。\n\n<color='"
                   "#ffff00'>【第三关·采蘑菇的大树】</color>\n大树每回合会吃一个蘑菇，吃完"
                   "两个蘑菇会休息一回合打个嗝，额...这一关要结合自身情况选择策略，如果你的输出比较猛，建议"
                   "一开始直接击杀防御蘑菇，后面打大树会好打很多。如果是秘言兽灵这种没什么输出的职业，请带上攻"
                   "击最猛的宠物，直接集火杀掉剧毒蘑菇，然后击杀大树。千万避免乱打一气，结果一个蘑菇没打掉全被"
                   "吃了。\n\n<color='#ffff00'>【第四关·不死巨人】</color>\n这"
                   "关所有怪物都带鬼魂术被动，被打死后四回合会原地复活。经常出现的悲剧就是一只一只打死之后，它"
                   "们一只一只又轮流站起来跟你撸个痛快...诀窍用一句话来说就是，尽量将怪物集中在一起干掉。需"
                   "要注意的是，最好不要将巨人留到最后，如果只剩下巨人一个，它会非常无赖地给自己套个护盾拖时间"
                   "，如果被拖到其他单位复活，那情况就非常不妙了！\n\n<color='#ffff00'>【"
                   "第五关·杰森】</color>\n杰森每次都会带上新等级可以携带的宠物，所带宠物都非常强力"
                   "，具有宠物图鉴里的对应特性。这一关就结合自身情况与对方的宠物安排战术。通常来说都是先清宠在"
                   "打杰森。\n\n<color='#ffff00'>【第七关·海公主】</color>\n海"
                   "公主会携带两只龙龟随从，物理龟的物理抗性很高，魔法龟的魔法抗性很高，并且回合开始时，会根据"
                   "玩家的职业，针对性地给海公主附加物理或魔法护盾。推荐攻略是，根据自身职业，如果是兽灵、狂剑"
                   "、战弓，则带上魔法攻击的守护。如果是魔导、秘言，则带上物理攻击的守护。物理攻击往魔法龟身上"
                   "招呼，魔法攻击往物理龟身上招呼。如果有控制技能，请务必控住海公主，她是最主要的输出。\n\n"
                   "<color='#ffff00'>【第八关·冰甲战熊&极限风暴】</color>\n很多人"
                   "卡在这一关，因为这一关看起来几乎无解！首先解析一下本关逻辑，这一关不能带守护，只能人宠上阵"
                   "，冰甲战熊有个非常无赖的特性，必定先手嘲讽人物。极限风暴的特性就是防御炒鸡低，血量炒鸡低，"
                   "但是你打不到啊喂！这一关正常情况下只有用宠物来打。战熊很肉没输出，风暴很脆输出高。一般人都"
                   "知道要先杀风暴，问题就是打不到。现给出若干种破解方案。\n\n方案一：暴力宠物，暴力破解！"
                   "人不是被控了吗？那我就让宠物打，暴力的单体点杀宠有机会在人宠都被耗死之前击杀风暴，杀完风暴"
                   "剩下就就是发泄了不是吗？\n\n方案二：宠物接力！如果你是秘言或兽灵等比较肉的职业，你可以"
                   "在第一只宠物挂掉或者快挂掉的时候召唤第二只宠物，继续击杀风暴。\n\n方案三：兽王幻身！兽"
                   "灵职业特有方案，利用兽王幻身反客为主。\n\n方案四：隐身宠物！风暴再暴力也打不到隐身，利"
                   "用隐身宠干掉它吧，前提是隐身宠物输出够，四回合的隐身可以击杀风暴。\n\n方案五：宠物喂药"
                   "！输出职业可以让速度比自己快的宠物给自己喂踏梦尘，一旦解控，请务必以迅雷不及掩耳的速度击杀"
                   "风暴！\n\n方案六：高级清心！如果身上有会高级清心的宠物，可以在第一回合就召唤出来，2回"
                   "合内人物免控，依靠这两个回合干掉风暴吧！\n\n这一关条件苛刻，但破解方法其实很多，以上并"
                   "不是全部，大家可以自己慢慢研究，看看哪种方法最巧妙最容易实现，这也是游戏的乐趣不是吗？\n\n"
                   "<color='#ffff00'>【第九关·不灭焰魂】</color>\n这一关的逻辑是，"
                   "一开始所有怪随机攻击，第二回合开始，所有怪物会集火血量最低的单位，怪物一旦成功击杀某个人会"
                   "立即狂暴，身上冒火，下个回个会改用群攻，输出爆表！所以这一关的应对策略就是保护与防御，时刻"
                   "盯着己方单位的血量，血量最低的单位能防御就防御，能保护就保护。击杀方面优先击杀主怪不灭焰魂"
                   "。\n\n<color='#ffff00'>【第十关·荒古牛魔】</color>\n请注意"
                   "，这一关存在大量的小牛，小牛会不停用嘲讽，而且它们的速度是最快的。不过对面还有一个初代守护"
                   "，只要他还存活，就会帮助玩家解除所有控制。所以这一关的关键就是保住初代守护！第二回合开始，"
                   "初代守护身上会带护盾，受到攻击反而会给他加血。玩家在清除小牛的同时必须不停攻击初代守护的护"
                   "盾，维持他的生命。没有他，我们基本动弹不得。还有一种另类解法，就是不管初代守护的死活，迅速"
                   "击杀小牛，初代守护死后人物喂药宠物清小牛，或者宠物喂药人物清小牛。条件比较苛刻并不推荐。\n\n"
                   "爵位挑战是单人玩法中难度最高的一个玩法，有很多值得研究的地方。如果各种方法都试过还是怎么都"
                   "过不去，那有可能是自身的属性跟不上，先放着，升多几级再回来打打看吧。\n\n过完关别忘了点"
                   "赞！"),
      question =>
          [{1,
            lang:get("第1/2题,暗夜&暗夜之眼关卡的难点"),
            [{1, "长相很萌"}, {2, "满血秒杀"}, {3, "长相太丑"}, {4, "回血太快"}],
            2},
           {2,
            lang:get("第2/2题,不灭之魂关卡的难点是"),
            [{1, "集火血量最低的目标"},
             {2, "击杀会狂暴"},
             {3, "输出高"},
             {4, "以上都对"}],
            4}],
      reward => [{20052, 1}, {90000, 50000}], type => 4,
      order => 4030, time => 1468598400};
get_data({4004}) ->
    #{name =>
          lang:get("<color='#249015'>【竞技攻略】</color>如何横扫竞技场 "
                   "（魔导篇）"),
      content =>
          lang:get("每日五场竞技场是必做的日常，不过到了后期，竞技场可不是那么容易打的。竞技场积分的价值我想不"
                   "用多说，大家心里都很清楚。今天就跟大家说一下竞技场轻松取胜之关键——魔导篇。\n\n<co"
                   "lor='#00ff00'>【助战搭配】</color>\n根据法师的职业定位，助战一定要"
                   "是双奶一法一兽。\n\n<color='#ffff00'>最佳搭配</color>姬+露露"
                   "+莉娜+二皇子。\n对方助战一般会出现的是无名+姬+佛格瑞特（利比尔二世），剩下的一个选择"
                   "则有可能是露露、莉娜、福波斯和阿瑞斯。无名和阿瑞斯输出高，不过皮脆。姬输出不错但是作为奶妈"
                   "职业没有办法持续输出，佛格瑞特和利比尔二世是标准兽灵，专业嘲讽抗伤害。露露全职加奶，皮脆。"
                   "莉娜和福波斯为不同特色的法系输出。\n宠物上，竞技场一般带的都是<color='#ffff"
                   "00'>输出宠</color>，几乎没人跑日常会带个功能宠。\n\n<color='#00"
                   "ff00'>【魔导VS输出职业】</color>\n魔导和常规的狂剑，战弓以及魔导进行pk"
                   "的时候，只需要注意以下几点：\n\n<color='#ffff00'>助战选择</colo"
                   "r>：标配两奶一法一兽\n\n<color='#ffff00'>宠物选择</color>："
                   "单体点杀宠\n打法：法师打法师优先输出<color='#ffff00'>宠物</color"
                   ">，然后清理<color='#ffff00'>物理职业</color>，最后将法师干掉。\n"
                   "法师打战弓由于战弓的魔法很低，只需要撑住两个回合不挂逼，那么战弓可以轻松干过。法师打狂剑是"
                   "最难的，<color='#ffff00'>守护必须够肉</color>，必须带上二皇子只需"
                   "要按照宠物→物理守护→狂剑→最后选择奶妈击杀。\n（注：以上方法都有一个注意点，那就是一定"
                   "要<color='#ffff00'>守尸</color>，这是法师pk的精髓。）\n\n<"
                   "color='#00ff00'>【魔导VS兽灵】</color>\n相信大家和兽灵pk都会"
                   "被兽灵的嘲讽所恶心住吧！法师更加讨厌兽灵。兽灵对输出不足，控制强必定是持久战。下面就教一下"
                   "大家如何使用法师打兽灵。\n\n<color='#ffff00'>助战选择</color>"
                   "：标配两奶一法一兽\n\n<color='#ffff00'>准备物料</color>：解封"
                   "药\n\n<color='#ffff00'>宠物选择</color>：单体点杀宠\n打法："
                   "由于兽灵需要抢先手那么必定大多的兽灵会比较脆皮，我们只需要将对方宠物清掉后，集火将兽灵清掉"
                   "就行了.被封住一定记得解封哟这很重要。\n\n<color='#00ff00'>【魔导VS"
                   "秘言】</color>\n详细大多数玩家都被双奶秘言队，三奶秘言队恶心过把！没错我杀不死你"
                   "我也要恶心死你。下面就来给大家介绍一下法师如何打秘言吧！\n\n<color='#ffff"
                   "00'>助战选择</color>：标配一奶三输出\n\n<color='#ffff00'>"
                   "宠物选择</color>：范围法宠\n打法：法师打秘言的优势在于拥有优于秘言奶量的血线压制"
                   "能力。加上点杀宠的携带。优先从宠物→物理守护→守尸。慢慢将对方的血线往下压胜利迟早是我们的"
                   "。\n（这套的打法在于：你不是能耗么？来我陪你一起<color='#ffff00'>耗</"
                   "color>。）"),
      question =>
          [{1,
            lang:get("第1/2题,通常情况下，竞技场打兽灵需要准备的是"),
            [{1, "解封药"}, {2, "幻化果"}, {3, "宠物休息"}, {4, "守护休息"}],
            1},
           {2,
            lang:get("第2/2题,魔导竞技的精髓是"),
            [{1, "守尸"}, {2, "防御"}, {3, "逃跑"}, {4, "捕捉"}],
            1}],
      reward => [{20052, 1}, {90000, 50000}], type => 4,
      order => 4040, time => 1468598400};
get_data({4005}) ->
    #{name =>
          lang:get("<color='#249015'>【夺宝奇兵】</color>勇夺珍宝，争做奇兵"),
      content =>
          lang:get("夺宝奇兵活动上线许久了，怪物们变着花样的出现，小编听说不少玩家仍觉得手足无措呢。不过不要怕"
                   "，所谓魔高一尺、道高一丈。今天小编就为大家带来一篇夺宝奇兵全攻略，希望大家能轻松把狡诈的怪"
                   "物降服。\n怪物阴险狡黠，挑战者们当需认真对待战斗，想要获得更多的奖励则千万<color="
                   "'#ffff00'>不要挂机</color>，注意和队友沟通，做好指挥，否则只能小编也无能"
                   "为力了。好了言归正传，首先为大家带来的是阵容推荐。\n\n<color='#00ff00'"
                   ">阵容推荐</color>\n秘言必不可少，输出位置至少三个，兽灵在一些特殊关卡往往能起到"
                   "关键作用，控到对面的奶妈或者控制都很不错哦。\n输出位置任选，魔导平均伤害高，战弓灵活性好"
                   "，狂剑单体集火BOSS时能超快速击杀。至于选哪些，这要看玩家平时结交了哪些职业的小伙伴了。\n\n"
                   "<color='#00ff00'>阵法推荐</color>\n在这个山岳阵遍地走，天火阵脆"
                   "成狗的时代，输出和防御两难全。这个时候苍穹阵的作用便越来越凸显，防御输出两不误哦。记得选好"
                   "阵法时，在队伍界面将辅助职业调整到免伤位置，输出职业调整到伤害提升位置哦。\n\n<col"
                   "or='#00ff00'>通关技巧</color>\n前五关的怪物属性不高，基本可以挂机完"
                   "成。从第六关开始就要注意战斗技巧咯。\n\n<color='#ffff00'>第六关：镜魔"
                   "</color>\n镜魔是个知己知彼的好对手，但是对于隐藏实力的玩家却经常摸不着头脑。镜魔"
                   "会复制出手前的我方阵容，因此我们需要做的\n1、战斗开始前换一级的宠物上阵\n2、战斗开始"
                   "第一回合先不要急着召唤，因为镜魔的速度很慢的，我们召唤出来他仍然会复制我们召唤出的宠物，所"
                   "以第一回合就尽情的攻击镜魔就行。\n3、第二回合召唤宠物\n4、优先击杀对面奶妈和强力输出\n\n"
                   "<color='#ffff00'>第七关：深海巨龟</color>\n深海巨龟免疫一切伤害"
                   "，而龟儿子受到伤害的同时，巨龟也会承受伤害，这大概就是伤在儿身，痛在爹身。因此我们需要做的\n"
                   "1、第一回合不必急着输出，可以释放一些BUFF/DEBUFF类技能，如秘言的加攻击，战弓自"
                   "身的战意，狂剑的碎灵双刃减一下巨龟的魔法伤害等等。\n2、后续回合集火龟儿子即可。\n\n"
                   "<color='#ffff00'>第八关：死亡骑士</color>\n死亡骑士拥有强大的召"
                   "唤能力，因为在他的眼里，死亡即是重生。但是重生也代表着希望，也许又是一个回血的祭祀，强力的"
                   "雷霆战神，又或者是捣蛋的新兵蛋子。但是在玩家没有足够强大之前，智谋比蛮力更可靠，抓住希望的"
                   "稻草前进吧。因此我们要做的\n1、如果前两个回合，死骑召唤出两个或以上的祭祀奶妈，果断逃跑"
                   "重来。\n2、优先击杀祭祀（奶妈），只要死骑BOSS重新召唤的不是另外一只奶妈，那么接下来"
                   "全部集火死骑BOSS。如果又召唤一次奶妈，我方状态不好，同样建议逃跑重来。毕竟击杀祭祀还是"
                   "比较快的。\n3、尽量不要释放太多AOE群体技能，因为小怪死了，BOSS是有可能召唤出奶妈"
                   "的，并且新兵蛋子会为我方补血，伤到他们可就等于跟自己过不去了。\n\n<color='#f"
                   "fff00'>第九关：地狱炎魔</color>\n地狱炎魔作为夺宝奇兵的最后一关的BOSS"
                   "，拥有超高的生命值和输出能力，一不留神可能就会灭队哦。但是上古妖魔也怕炸药桶这种黑科技，驱"
                   "鬼用来对付拥有鬼魂术的小怪颇有奇效。因此我们要做的是\n1、优先击杀小怪，美丽的蝴蝶花姬总"
                   "能魅惑人心，剑客伤害颇高，南瓜君打上超级禁魂便不能复活。依次击杀他们\n2、尽量不要使用群"
                   "体攻击技能，因为那样会令炸药桶提前爆炸使BOSS觉醒，BOSS觉醒后超高的伤害令人头疼。\n"
                   "3、不要全部集火一只小怪，保证附带驱鬼技能的宠物能恰好杀死小怪将其驱逐出场。\n4、小怪全"
                   "部击杀完成，即可集火BOSS，在BOSS血量快要降到一半时，群攻炸药桶，即可使用炸药桶炸死"
                   "BOSS。\n希望以上的攻略能帮助大家更轻松的通关，获得很多的奖励以提升实力，等将来实力成"
                   "熟的时候来挂机碾压他们岂不快哉？"),
      question =>
          [{1,
            lang:get("第1/2题,镜魔关卡通关要点是"),
            [{1, "先出场最强宠物"}, {2, "先出场低级宠物"}],
            2},
           {2,
            lang:get("第2/2题,深海巨龟关卡通关要点是"),
            [{1, "优先集火深海巨龟"}, {2, "优先集火龟儿子"}],
            2}],
      reward => [{20052, 1}, {90000, 50000}], type => 4,
      order => 4050, time => 1468598400};
get_data({4006}) ->
    #{name =>
          lang:get("<color='#249015'>【无尽挑战】</color>无尽挑战全面解析"),
      content =>
          lang:get("无尽挑战新玩法已经更新有一段时间了，玩法设置别样有趣但难度也让很多玩家头疼。为了英雄宝石和"
                   "图鉴以及其他奖励，无尽挑战不容错过，小编下面为大家带来一些小技巧，希望能帮助大家更轻松地获"
                   "得更多奖励。\n\n<color='#00ff00'>阵容推荐</color>\n双秘言+"
                   "3输出（兽灵可以封印爆发较高的怪物，为队伍营造生存空间，封到个别关卡出现的控制小浣熊时，小"
                   "浣熊还会谈跑哦）\n因为回合结束不会回血回蓝，且药物使用限制，因此双秘言能保证队伍血量一直"
                   "保持一个较为健康的状态，至于三个输出，魔导是万金油，战弓有群攻爆发，可以留着伤害较高的技能"
                   "，等到BOSS出现后迅速击杀。\n\n<color='#00ff00'>战斗准备</col"
                   "or>\n1、输出准备螳螂幻化果（感知）\n2、秘言推荐使用冰熊幻化果\n3、宠物推荐雷霆"
                   "战神（85级）\n4、专属技能建议携带回蓝的技能\n介绍：附带感知技能的螳螂幻化果能快速清"
                   "掉隐身怪物从而跳关，秘言使用附带保命技能的冰熊幻化果能在受到致命伤害时高几率复活。<col"
                   "or='#ffff00'>宠物推荐</color>\n物理系的精灵龙：雷霆战神\n雷霆战神"
                   "的续航能力在无尽挑战中的被更加凸显。下面做一个简单的计算：\n我们假设雷霆之怒平均弹两个目"
                   "标：那么总伤害系数为：1+0.7+0.7x0.7=2.19\n这意味着什么呢？举个例子，雷"
                   "霆打第一个目标5000血，总伤害5000x2.19约为11000，那么打了高级吸血的雷霆可"
                   "以吸血3300，此时如果坐骑技能是满级气贯长虹（增加20%的吸血），那么雷霆一下可以吸血5"
                   "500，再触发暴击的话，吸血量更多。\n因此一个体力加点的雷霆可以在无尽挑战中一直处于半血"
                   "以上的健康状态。此时秘言的加血就可以更多的分配到人物身上了，为队伍带来的收益可想而知。\n\n"
                   "<color='#00ff00'>战斗技巧</color>\n好了，准备工作到这里基本结束"
                   "了，下面简单说一下，过关的过程中的战斗小技巧\n1、前面几关相对来说比较简单，此时人物的技"
                   "能不必吝啬，控制好技能CD，留一些伤害比较高的技能打BOSS，例如战弓的陨落星群，魔导的湮"
                   "灭风暴等。\n2、因为打完BOSS宠物是不会回蓝的，所以比较简单的关卡可以考虑让宠物防御或"
                   "者普攻\n3、一定要尽快清掉怪物，因为势单力薄的怪物会召唤出波波助阵。分裂波波可是会让人感"
                   "到绝望呢。\n4、最后一点是，不要挂机，想获得更多奖励就认认真真的接受挑战吧"),
      question =>
          [{1,
            lang:get("第1/2题,无尽挑战推荐宠物室"),
            [{1, "雷暴"}, {2, "雷霆战神"}],
            2},
           {2,
            lang:get("第2/2题,输出类职业推荐幻化果"),
            [{1, "螳螂"}, {2, "冰熊幻化果"}],
            1}],
      reward => [{20052, 1}, {90000, 50000}], type => 4,
      order => 4060, time => 1468598400};
get_data(_) -> false.

